{
  "cases": [
    {
      "id": "GelykeKanseandOthersvChairpersonoftheSenateoftheUniversityofStellenboschandOthers",
      "href": "http://www.saflii.org/za/cases/ZACC/2019/38.html",
      "title": "Gelyke Kanse and Others v Chairperson of the Senate of the University of Stellenbosch and Others",
      "featured": false,
      "highlighted": true,
      "dateOfJudgment": "2019-10-10T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_6"
      ],
      "justicesConcurring": "Cameron J (Mogoeng CJ, Froneman J, Jafta J, Khampepe J, MadlangaJ, Mathopo AJ, Mhlantla J, Theron J and Victor AJ)",
      "summary": "The Senate and Council of the University of Stellenbosch adopted a new language policy in 2016. The University’s previous policy, adopted in 2014, established English and Afrikaans as languages of instruction (with interpretation). Compared to the 2016 Policy, the 2014 Policy would have cost an additional R640 million in infrastructure, plus about R78 million per year thereafter, entailing a 20% increase in fees (R8100 on top of the approximately R40 000 per year per student). The 2016 Policy makes teaching primarily English: teaching is in both English and Afrikaans ‘where reasonably practicable and pedagogically sound’ (parallel medium); and where demand is insufficient and recourses do not permit, only Afrikaans translations are provided, coupled with questions and answers in Afrikaans (as opposed to real-time interpreting). At the time of the judgment, Afrikaans was still offered on large scale at undergraduate level; all first-year lectures continue to be offered in Afrikaans; any student could be taught in English.\n\nFollowing an extensive and exhaustive process, and in the wake of Fees Must Fall and Open Stellenbosch upheavals on its campus in 2015, the University of Stellenbosch adopted a new language policy in 2016 under the Higher Education Act and the National Language Policy for Higher Education (LPHE) to replace its 2014 policy which would have cost the University millions more Rands in infrastructure and annual operational costs, resulting in fee increases. The 2016 Policy makes teaching primarily English: teaching is in both English and Afrikaans; and where demand is insufficient and recourses do not permit, only Afrikaans translations are provided, coupled with questions and answers in Afrikaans. \n\nThe Court upheld the 2016 Policy which was challenged under both section 29(2) and section 6 of the Constitution, ruling that it validly replaced the 2014 Policy which was not reasonably practicable as determined by the University.",
      "snippet": "<h1>Test Heading</h1><em>This case</em> concerned the decisions of the Senate and Council of the University of Stellenbosch to adopt a new language policy for the University (2016 Policy). The applicants approached the Constitutional Court to ask for the setting aside of the 2016 Policy on grounds that it violates section 29(2), and also contravenes other constitutional provisions, including section 6(2), section 6(4), the equality clause and other provisions of the Bill of Rights.",
      "facts": "",
      "decision": "The Court ruled, in respect of the section 6 challenge, that Afrikaans did not suffer ‘historically diminished use and status’ and therefore not qualify as a disadvantaged indigenous language in terms of section 6(2), even though it did qualify as indigenous; it only qualifies and is protected as an official language under section 6(4). \n\nThe state has a much wider margin under section 6(4) than under section 6(2). Under section 6(2), the state is obliged to advance historically diminished languages through ‘practical and positive measures’ without disregarding the official languages under section 6(4). However, under section 6(4), the state is only required to treat the official languages listed equitably by not diminishing them. This means that the state cannot disregard the official languages and is obliged to conserve them, but not at the expense of corrective, advancement measures under section 6(2).\n\nUltimately, the Court acknowledged that whilst the world was growing more hostile to minority languages, it was not the University’s burden to prevent the decline of Afrikaans across South African tertiary institutions.",
      "dissent": "Moegoeng CJ concurred separately, emphasizing emphasized the need to develop all indigenous languages including the spoken languages of the First Nation people. \n\nFroneman J concurred separately, laying out the implications of English dominance as a medium of instruction, namely the diminished use and protection of minority indigenous languages.",
      "citedCases": [
        "Kanse v The President of the Convocation of the Stellenbosch University 2017 JDR 1687 (WCC)",
        "Plascon-Evans Paints Ltd v Van Riebeeck Paints (Pty) Ltd 1984 (3) SA 623 (A)",
        "Ex parte Gauteng Provincial Legislature: In re Dispute Concerning the Constitutionality of Certain Provisions of the Gauteng School Education Bill of 1995 1996 (3) SA 165 (CC)",
        "University of Free State v AfriForum 2017 (4) SA 283 (SCA)",
        "Head of Department Mpumalanga Department of Education and Another v Hoerskool Ermelo and Another 2010 (2) SA 415 (CC)",
        "AfriForum v University of the Free State 2018 (2) SA 185 (CC)",
        "AfriForum v Chairperson of the Council of the University of Pretoria 2017 JDR 0150 (GP)",
        "Bato Star Fishing (Pty) Ltd v Minister of Environmental Affairs and Tourism 2004 (4) SA 490 (CC)",
        "Minister of Environmental Affairs and Tourism v Phambili Fisheries (Pty) Ltd; Minister of Environmental Affairs and Tourism v Bato Star Fishing (Pty) Ltd 2003 (6) SA 407 (SCA)",
        "Logbro Properties CC v Bedderson N.O. 2003 (2) SA 460 (SCA)",
        "City of Johannesburg Metropolitan Municipality v Blue Moonlight Properties 39 (Pty) Ltd 2012 (2) SA 104 (CC)",
        "Turnbull-Jackson v Hibiscus Coast Municipality 2014 (6) SA 592 (CC)",
        "Tshwane City v AfriForum 2016 (6) SA 279 (CC)",
        "Daniels v Scribante 2017 (4) SA 341 (CC)"
      ]
    },
    {
      "id": "AfriForumandAnothervUniversityoftheFreeState",
      "href": "http://www.saflii.org/za/cases/ZACC/2017/48.html",
      "title": "AfriForum and Another v University of the Free State",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2017-12-27T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_29__Education"
      ],
      "justicesConcurring": "Mogoeng CJ (Nkabinde ADCJ, Jafta J, Khampepe J, Madlanga J, Mhlantla J, Mojapelo AJ and Zondo J) Froneman J (Cameron J, Pretorius AJ)",
      "summary": "The University of the Free State formalised a bilingual (Afrikaans and English) language policy in 2003 after phasing it in since 1993. The effect (although not the intention) of the policy was, amongst other things, separate lecture rooms for white and black students and reported racial tension. \r\n\r\nAfter commissioning a report on the situation within the University under the 2003 policy, the University Council adopted a new policy in 2016 (to be phased in over five years) which made English the primary medium of teaching and learning, with Afrikaans continuing to be used in an expanded tutorial system and selected courses. \n\nSection 29(2) of the Constitution entitles everyone to education in the language of their choice in public institutions where ‘reasonably practicable’, taking into account: (a) equity; (b) practicability; and (c) the need to redress the results of past racially discriminatory laws and practices’.\nThe University of the Free State formalised a bilingual language policy in 2003 after phasing it in since 1993. The effect (although not the intention) of the policy was, amongst other things, separate lecture rooms for white and black students and reported racial tension. \n",
      "snippet": "This case was about whether the adoption of the language policy that discontinues the use of Afrkiaans as a primary medium of instruction, by the University of the Free State, is constitutionally valid and whether the University's policy is consistent with the Ministerial Language Policy Framework. AfriForum and Solidarity approached the Court as they believe that proper research was not conducted, and that most white and some black Afrikaans-speaking students prefer to be taught in Afrikaans. They see no justification for the language policy-shift. ",
      "facts": "",
      "decision": "The Court ruled that the fuelling of racial tension was an ‘appropriate justification’ for the limiting the existing access to the right to be taught in one’s mother tongue. \r\nThe Court explained that it may be practically possible or feesable to retain Afrikaans as a major medium of instruction; but – given that the link between racially segregated lectures and racial tensions had not been denied – it was not ‘reasonably practicable’ to maintain the 2003 bilingual policy if that policy endangered race relations and threatened to perpetuate racial discrimination. This was decided, especially so, in light of the state’s responsibility to redress the damage caused by apartheid.\r\nThe Court recognised Afrikaans as a highly developed language of scholarship and science, and a national resource to be treasured. \r\n",
      "dissent": "Froneman J (Cameron J, Pretorius AJ) dissented, arguing that: (1) the case should not have been dismissed, but argued before the Court in a hearing because it related to ‘unfinished business’ under the constitution, there were prospects of success (the applicants might have been successful) and because it would have been more consistent with the Court’s practice; (2) more evidence, and therefore further hearings at a High Court level, was needed; and (3) the judgment should (hopefully) not undermine the development of other languages aside from English and Afrikaans.",
      "citedCases": [
        "Head of Department, Mpumalanga Department of Education v Hoërskool Ermelo 2010 (2) SA 415 (CC); \r\nSouth African Revenue Service v Commission for Conciliation, Mediation and Arbitration 2017 (1) SA 549 (CC);\r\nFerreira v Levin N.O.; Vryenhoek v Powell N.O. 1996 (1) SA 984 (CC);\r\nBiowatch Trust v Registrar Genetic Resources 2009 (6) SA 232 (CC);\r\nAffordable Medicines Trust v Minister of Health 2006 (3) SA 247 (CC);\r\nFedsure Life Assurance Ltd v Greater Johannesburg Transitional Metropolitan Council 1999 (1) SA 374 (CC)",
        "Cool Ideas 1186 CC v Hubbard 2014 (4) SA 474 (CC);\r\nDengetenge Holdings (Pty) Ltd v Southern Sphere Mining and Development Company Ltd 2014 (5) SA 138 (CC);\r\nDepartment of Land Affairs v Goedgelegen Tropical Fruits (Pty) Ltd 2007 (6) SA 199 (CC); \r\nSalem Party Club v Salem Community [2017] ZACC 46;\r\nDaniels v Scribante 2017 (4) SA 341 (CC);\r\nTrencon Construction (Pty) Limited v Industrial Development Corporation of South Africa Ltd (5) SA 245 (CC);\r\nAllpay Consolidated Investment Holdings (Pty) Ltd v Chief Executive Officer, South African Social Security Agency 2014 (4) SA 179 (CC);\r\nMEC for Education, KwaZulu-Natal v Pillay 2008 (1) SA 474 (CC); \r\nBato Star Fishing (Pty) Ltd v Minister of Environmental Affairs and Tourism  2004 (4) SA 490 (CC);\r\nFraser v Naude 1999 (1) SA 1 (CC);\r\nSnyders N.O. v Louistef (Pty) Ltd 2017 (6) SA 646 (CC); \r\nRadio Pretoria v Chairperson, Independent Communications Authority of South Africa 2005 (4) SA 319 (CC);\r\nDe Reuck v Director of Public Prosecutions, Witwatersrand Local Division 2004 (1) SA 406 (CC);\r\nIslamic Unity Convention v Independent Broadcasting Authority 2002 (4) SA 294 (CC);\r\nNational Education Health and Allied Workers Union v University of Cape Town 2003 (3) SA 1 (CC);\r\nS v Boesak 2001 (1) SA 912 (CC);\r\nBrummer v Gorfil Brothers Investments (Pty) Ltd 2000 (2) SA 837 (CC);\r\nMunicipal Employees Pension Fund v Natal Joint Municipal Pension Fund (Superannuation) [2017] ZACC 43;\r\nS v Barlow 2017 (2) SACR 535 (CC);\r\nDepartment of Home Affairs v Public Servants Association (2017) 38 ILJ 1555 (CC); \r\nCape Town City v Aurecon SA (Pty) Ltd 2017 (4) SA 223 (CC);\r\nAgri SA v Minister for Minerals and Energy 2013 (4) SA 1 (CC);\r\nAlbutt v Centre for the Study of Violence and Reconciliation 2010 (3) SA 293 (CC);\r\nMasetlha v President of the Republic of South Africa 2008 (1) SA 566 (CC);\r\nMashavha v President of the Republic of South Africa 2005 (2) SA 476 (CC);\r\nPresident of the Republic of South Africa v Hugo 1997 (4) SA 1 (CC);\r\nEx parte Chairperson of the Constitutional Assembly: In re Certification of the Constitution of the Republic of South Africa, 1996 1996 (4) SA 744 (CC);\r\nAzanian Peoples Organisation (AZAPO) v President of the Republic of South Africa 1996 (4) SA 671 (CC);\r\nS v Makwanyane 1995 (3) SA 391 (CC);\r\nEx parte Gauteng Provincial Legislature: In re Dispute Concerning the Constitutionality of Certain Provisions of the Gauteng School Education Bill of 1995 1996 (3) SA 165 (CC);\r\nTshwane City v AfriForum 2016 (6) SA 279 (CC);"
      ]
    },
    {
      "id": "MECforEducationKwaZuluNatalandOthersvPillay",
      "href": "http://www.saflii.org/za/cases/ZACC/2007/21.html",
      "title": "MEC for Education: KwaZulu-Natal and Others v Pillay",
      "featured": true,
      "highlighted": false,
      "dateOfJudgment": "2007-05-10T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_31"
      ],
      "justicesConcurring": "Langa CJ (Moseneke DCJ, Madala J, Mokgoro J, Navsa AJ, Ngcobo J, Nkabinde J, Sachs J, Skweyiya J and Van der Westhuizen J)",
      "summary": "A School Code of Conduct banned the wearing of jewellery (at school), except for plain stud earrings and wrist watches. The ban extended to any other piercings, including nose studs. A learner, taking part in a voluntary (non-compulsory) cultural and religious practice, pierced her nose and returned to school after the holidays wearing a nose stud, in contravention of the School Code of Conduct. Does the refusal of the school – in enforcing uniformity under the terms of its Code of Conduct, to which the learner consented through her parent upon admission to the school – amount to unfair discrimination and/or a violation of the learner’s cultural and religious rights under sections 9 and 31 of the Constitution respectively? The Constitutional Court found that the refusal amounted to a violation of those rights; and that schools must reasonably accommodate differences and diversity in their communities. The Court found that it was legitimate (in general) for schools to promote uniformity in aiming to establish a disciplined school environment, but that exceptions (reasonable accommodations) must be allowed where demanded by the Constitution – as determined through a balancing of rights and interests. The Court ordered the School to amend its Code of Conduct to provide for exemption procedures allowing learners, on genuine cultural or religious grounds, to apply for permission to deviate from the uniform and other standards and requirements of the Code of Conduct, thereby allowing for the rights and interests to be weighed and balanced in the specific circumstances on a case-by-case basis.",
      "snippet": "This case concerned the right of a learner to wear a nose stud to school and whether the rule prohibiting the wearing of jewellery had the potential for indirect discrimination because it allowed certain groups of learners to express their religious and cultural identity freely, while denying that right to others.",
      "facts": "Ms Sunali Pillay (the learner), through her mother Ms V Pillay (the Respondent), had consented to the school Code of Conduct upon admission to the school in 2002. The Code of Conduct banned the wearing of jewellery (at school), including any piercings, and except for plain stud earrings and wrist watches. A learner, taking part in a voluntary (non-compulsory) cultural and religious practice, pierced her nose and returned to school after the holidays wearing a nose stud, in contravention of the School Code of Conduct. After consultation between the parties, and between the School and experts, the School ultimately refused to allow her to continue wearing the nose stud and sought to enforce its Code of Conduct against her through conducting a disciplinary hearing. The refusal and scheduling of a disciplinary hearing prompted Ms V Pillay (the Respondent) to launch proceedings in the Equality Court.",
      "decision": "The Court noted that whilst uniforms and school rules serve an important purpose in education, the case was not about uniforms in general, but about a specific exemption to a uniform. The Court found that permitting this particular exemption would not endanger uniformity or school discipline in general; but rather that granting an exemption to Ms Sunali Pillay (the learner) might encourage more learners to express their religion or culture, which was to be celebrated, not feared (as diversity itself is to be promoted and celebrated not only tolerated). The Court ruled that the constitutional rights and protections (namely, under section 31) apply equally to both compulsory and voluntary (non-compulsory) practices of culture and religion.",
      "dissent": "O’Regan J partially dissented. O’Regan J agreed with most of the order and reasons of the majority, but disagreed with the part of the order in which the Court declared the refusal by the School to allow Ms Sunali Pillay to wear the nose stud as unfair discrimination (the declaratory relief).\n\nMs Sunali Pillay had graduated and left the school before judgment was handed down by the Constitutional Court. O’Regan J argued that because of this, the declaratory relief was moot (‘pointless’) and inappropriate. O’Regan contended that had Ms Sunali Pillay still be enrolled at the School by the time the Court heard the case, it would have been appropriate to refer the matter back to the School for the proper exemption procedure to be carried out in accordance with its amended Code of Conduct.",
      "citedCases": [
        "Pillay v MEC for Education, KwaZulu-Natal, and Others 2006 (6) SA 363 (EqC); 2006 (10) BCLR 1237 (N)",
        "National Coalition for Gay and Lesbian Equality and Others v Minister for Home Affairs and Others 2000 (2) SA 1 (CC)",
        "JT Publishing (Pty) Ltd and Another v Minister of Safety and Security and Others 1997 (3) SA 514 (CC)",
        "Independent Electoral Commission v Langeberg Municipality 2001 (3) SA 925 (CC)",
        "AAA Investments Pty (Ltd) v Micro Finance Regulatory Council and Another 2007 (1) SA 343 (CC)",
        "Minister of Health and Another NO v New Clicks South Africa (Pty) Ltd (Treatment Action Campaign and Another as Amicus Curiae) 2006 (2) SA 311 (CC)",
        "South African National Defence Union v Minister of Defence and Others 2007 (5) SA 400 (CC)",
        "NAPTOSA and Others v Minister of Education Western, Western Cape Government and Others 2001 (2) SA 112 (C)",
        "Mandla and another v Dowell Lee and another 1983 (1) All ER 1062 (HL)",
        "Bernstein and Others v Bester and Others NNO 1996 (2) SA 751 (CC)",
        "Alexkor Ltd and Another v Richtersveld Community and Others 2004 (5) SA 460 (CC)",
        "Prince v President, Cape Law Society, and Others 2001 (2) SA 388 (CC) (Prince I)",
        "Prince v President, Cape Law Society, and Others 2002 (2) SA 794 (CC) (Prince II)",
        "Port Elizabeth Municipality v Various Occupiers 2005 (1) SA 217 (CC)",
        "Bhe and Others v Magistrate, Khayelitsha, and Others (Commission for Gender Equality as Amicus Curiae); Shibi v Sithole and Others; South African Human Rights Commission and Another v President of the Republic of South Africa and Another 2005 (1) SA 580 (CC)",
        "Affordable Medicines Trust and Others v Minister of Health and Others 2006 (3) SA 247 (CC)",
        "National Coalition for Gay and Lesbian Equality and Another v Minister of Justice and Others 1999 (1) SA 6 (CC)",
        "Christian Education South Africa v Minister of Education 2000 (4) SA 757 (CC)",
        "Harksen v Lane NO and Others 1998 (1) SA 300 (CC)",
        "Ferreira v Levin NO and Others and Vryenhoek and Others v Powell NO and Others 1996 (1) SA 984 (CC)",
        "Minister of Home Affairs and Another v Fourie and Another; Lesbian and Gay Equality Project and Others v Minister of Home Affairs and Others 2006 (1) SA 524 (CC)",
        "McLean v Sasol Mine (Pty) Ltd Secunda Collieries; McLean v Sasol Pension Fund 2003 (6) SA 254 (W) ",
        "Public Servants Association of South Africa and Others v Minister of Justice and Others 1997 (3) SA 925 (T)",
        "Eaton v Brant County Board of Education 1997 (1) SCR 241",
        "Central Okanagan School District No 23 v Renaud 1992 (2) SCR 970",
        "Multani v Commission Scolaire Marguerite-Bourgeoys 2006 (1) SCR 256",
        "R (on the application of Begum) v Head Teacher and Governors of Denbigh High School 2006 (2) All ER 487 (HL)",
        "Bato Star Fishing (Pty) Ltd v Minister of Environmental Affairs and Others 2004 (4) SA 490 (CC)",
        "Doctors for Life v Speaker of the National Assembly and Others 2006 (6) SA 416 (CC)",
        "Lyng, Secretary of Agriculture, et al v Northwest Indian Cemetery Protective Association et al 485 US 439 (1988)",
        "Pretoria City Council v Walker 1998 (2) SA 363 (CC)",
        "President of the Republic of South Africa and Another v Hugo 1997 (4) SA 1 (CC)",
        "Prinsloo v Van der Linde and Another 1997 (3) SA 1012 (CC)",
        "South African Broadcasting Corp Ltd v National Director of Public Prosecutions and Others 2007 (1) SA 523 (CC);"
      ]
    },
    {
      "id": "EconomicFreedomFightersvSpeakeroftheNationalAssemblyandOthersDemocraticAlliancevSpeakeroftheNationalAssemblyandOthersZACCBCLRCCSACC",
      "href": "http://www.saflii.org/za/cases/ZACC/2016/11.html",
      "title": "Economic Freedom Fighters v Speaker of the National Assembly and Others; Democratic Alliance v Speaker of the National Assembly and Others [2016] ZACC 11; 2016 (5) BCLR 618 (CC); 2016 (3) SA 580 (CC)",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2016-03-31T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_9"
      ],
      "justicesConcurring": "Mogoeng CJ, Moseneke DCJ, Bosielo J, Cameron J, Froneman J, Jafta J, Khampepe J, Madlanga J, Mhlantla J, Nkabinde J, and Zondo J. ",
      "summary": "The case concerned the legal status of the remedial powers that are vested in the Public Protector after the second respondent failed to comply with the remedial action taken against him. His argument lay in the fact that the Public Protector was not a judge and could not be afforded the same power to have binding remedial actions.\n\nThe Court emphasised that the office of the Public Protector was created to strengthen democracy and as such, it is impartial and subject only to the Constitution and the law. The Public Protector derived its powers from the Constitution primarily and the Public Protector Act did not take away nor did it substitute any of the powers vested in the Public Protector by the Constitution. Instead, the Public Protector Act enhanced the powers afforded to the Public Protector under the Constitution. \n\nMaking recommendations that may be disregarded was held by the court to be inconsistent with ss 11 and 182 of the Constitution which govern the Public Protector. The court held that there was a safeguard to the remedial powers of the Public Protector because the remedial actions decided by the Public Protector were open to being challenged in court.\n\nLastly, not all remedial actions would be binding but the context of the case would determine the legal status of the remedial action. \n",
      "snippet": "<h1>Test Heading </h1><em>The case</em>concerned the legal status of the remedial powers that are vested in the Public Protector after the second respondent failed to comply with the remedial action taken against him. His argument lay in the fact that the Public Protector was not a judge and could not be afforded the same power to have binding remedial actions.",
      "facts": "The Public Protector (third respondent) in terms of her powers investigated allegations of improper conduct and irregular expenditure regarding the security upgrades done to the private residence of the second respondent. After conducting her investigation, the Public Protector concluded that the second respondent had acted contrary to the Constitution because he had knowingly benefited from the irregular expenditure of State resources. The Public Protector then directed that the second respondent pay back the portion of the undue benefit that had benefitted him and his family. In addition to this, the Public Protector directed that the second respondent would have to reprimand the Ministers that were involved in the project for acting inappropriately.",
      "decision": "The primary source of the power to take remedial action was the Constitution and the Public Protector Act was a secondary source. \n\nThis remedial power can only be exercised against people that the Public Protector is by law allowed to investigate. \n\nThe Public Protector is empowered to decide on the appropriate remedial action to be taken and how the action must be implemented. \n\nContext, nature, and language would be used to determine whether remedial action is binding or not. \n\n",
      "dissent": "The main dissenting views in the case were regarding the legal status of the remedial powers that lay with the Public Protector. \r\n\r\nThe second respondent argued that compliance with the Public Protectors remedial action was optional. The remedial action was never intended to be binding on the person being investigated as the Public Protector was not a judicial officer. It was also argued that the Public Protector Act watered down the powers of the Public Protector in particular the remedial powers. \r\n\r\nOn the other hand, it was argued that in the case of the Public Protector handing down an unfavourable remedial action, the person investigated had no option but to comply with the action. A remedial action could not serve as a remedy to an injured party unless it was able to deal with the matter. Therefore, the power to take remedial action would be rendered useless if the person against whom the remedial action is taken could ignore that action.\r",
      "citedCases": [
        "Nyathi v Member of the Executive Council for the Department of Health Gauteng and Another [2008] ZACC 8; 2008 (5) SA 94 (CC); 2008 (9) BCLR 865",
        "My Vote Counts NPC v Speaker of the National Assembly and Others [2015] ZACC 31; 2016 (1) SA 132 (CC); 2015 (12) BCLR 1407 (CC); \nDoctors for Life",
        "President of the Republic of South Africa and Others v South African Rugby Football Union and Others [1999] ZACC 9; 199 (4) SA 147 (CC); 199 (7) BCLR 725 (CC)",
        "President of the Republic of South Africa and Another v Hugo [1997] ZACC 4; 1997 (4) SA 1 (CC); 1997 (6) BCLR 708 (CC); \nSouth African Broadcasting Corporation Soc Ltd and Others v Democratic Alliance and Others [2015] ZASCA 156; [2015] 4 All SA 719 (SCA); \nCertification of the Constitution of the Republic of South Africa, 1996 [1996] ZACC 26; 1996 (4) SA 744 (CC); 1996 (10) BCLR 1253 (CC)",
        "SABC v DA",
        "Fose v Minister of Safety and Security [1997] ZACC 6; 1997 (7) BCLR 851 (CC)",
        "Democratic Alliance v South African Broadcasting Corporation Limited and Others [201] ZAWCHC 161; 2015 (1) SA 551 (WCC)",
        "Pharmaceuticals Manufacturers Association of South Africa and Another",
        "MEC for Health, Easer Cape and Another v Kirkland Investments (Pty) Ltd [2014] ZACC 6; 2014 (3) SA 481 (CC); 2014 (5) BCLR 547 (CC)",
        "Democratic Alliance v President of the Republic of South Africa and Others [2012] ZACC 24; 2013 (1) SA 248 (CC); 2012 (12) BCLR 1297 (CC)",
        "Justice Alliance of South Africa v President of Republic of South Africa and Others",
        "Helen Suzman Foundation v Judicial Service Commission and Others [2014] ZAWCHC 136; 2015 (20 SA 498 (WCC); [2014] 4 All SA 395 (WCC)",
        "Mazibuko v Sisulu and Another [2013] ZACC 28; 2013 (11) BCLR 1297 (CC)",
        "Rail Commuters Action Group v Transnet Ltd t/a Metrorail [2004] ZACC 20; 2005 (2) SA 359 (CC); 2005 (4) BCLR 301 (CC)",
        ""
      ]
    },
    {
      "id": "PublicProtectorvSouthAfricanReserveBankZACCBCLRCCSACC",
      "href": "http://www.saflii.org/za/cases/ZACC/2008/13.html",
      "title": "Public Protector v South African Reserve Bank [2019] ZACC 29; 2019 (9) BCLR 1113 (CC); 2019 (6) SA 253 (CC)",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2019-07-22T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "Chapter_9_Institutions"
      ],
      "justicesConcurring": "Mogoeng CJ, Basson AJ, Cameron J, Dlodlo AJ, Froneman J, Goliath AJ, Khampepe J, Mhlantla J, Petse AJ and Theron J",
      "summary": "The applicant investigated an agreement that was entered into by the respondent and Bankorp Limited during the apartheid era.\t\r\n\r\nIn her final report, the applicant directed that the Chairperson of the Parliamentary Portfolio Committee take steps to amend the Constitution to strip the respondents of its primary object of protecting the value of the currency and amend its consulting obligations with the Minister of Finance.The report also recommended that the Special Investigating Unit to approach the President and take steps to recover misused public funds from ABSA Bank Limited who had purchased Bankorp. \r\n\r\nThe main issue in the present case was whether the conduct of the applicant during her investigation warranted the order made that she be personally liable for 15% of the costs of the case. \r\n\r\nThe court decided that the applicant had acted in bad faith and had been grossly negligent in the pursuant of her investigation and as such the order made against her to be personally responsible for the cost of the case was warranted. \r",
      "snippet": "This case concerned the lawfulness of various search and seizure operations that were carried out at the officers of Mr Zuma's attorney and Thint, and at the residences and former offices of Mr Zuma. Messrs Zuma and Hulley and Thint applied to the Constitutional Court for an order for the return of their documents, arguing that Ngoepe JP should not have issued the warrants because the state failed to disclose various material facts. They argued that the warrants were overbroad and vague and effectively authorised an unbounded search of the relevant premises, contrary to their right to privacy in terms of section 14 of the Constitution. Finally, they asserted that Mr Zuma’s right to a fair trial in terms of section 35(3) of the Constitution had been threatened because the warrants did not sufficiently protect his legal professional privilege. ",
      "facts": "\nThe applicant investigated an agreement that was entered into by the respondent and Bankorp Limited during the apartheid era.        \n\nIn her final report, the applicant directed that the Chairperson of the Parliamentary Portfolio Committee take steps to amend the Constitution to strip the respondent of its primary object of protecting the value of the currency and amend its consulting obligations with the Minister of Finance.\n\nThe report also recommended that the Special Investigating Unit approach the President and take steps to recover misused public funds from ABSA Bank Limited who had purchased Bankorp . \n\n",
      "decision": "Holding public officials personally responsible for costs in cases against them is a constitutional mechanism that ensures that they act in good faith and in line with the relevant laws and the Constitution. \r\nThe applicant had acted in bad faith and had exceeded the bounds of her powers and as such, she wasn’t afforded protection under the Public Protector Act. \r\nThe applicant also failed to engage with the respondent and allow them to make representations before publishing her final report. \r\nThat the applicant had misrepresented herself under oath and her behaviour was found to be contradictory further confirming that she acted in bad faith. \r\n \r",
      "dissent": "The majority judgement written by Khampepe J and Theron J (Basson AJ, Cameron J, Dlodlo AJ, Froneman J, Mhlantla J and Petse AJ concurring) agreed with the High Court that the behaviour of the applicant was in bad faith and fell short of the standards imposed by her office. As a result, the personal costs order made against her was justified. \r\n\r\nThe minority judgement written by Mogoeng CJ (Goliath AJ concurring) decided that the courts exist not as places to crush litigants but to teach them and caution constructively. The minority judgement further held that making the applicant personally responsible for the costs of the case would ruin her financially and career-wise.\r",
      "citedCases": [
        "Economic Freedom Fighters v Speaker, National Assembly [2016] ZACC 11; 2016 (3) SA 580 (CC); 2016 (5) BCLR 618 (CC)",
        "Plastic Converters Association of South Africa on behalf of Members v National Union of Metalworkers of SA [2016] ZALAC 39; [2016] 37 ILJ 2815 (LAC) (Plastic Converters Association of South Africa)",
        "Absa Bank Limited v Public Protector 2018 JDR 0190 (GP) (High Court judgment)",
        "Black Sash Trust v Minister of Social Development [2017] ZACC 20; 2017 (9) BCLR 1089 (CC)",
        "United Democratic Movement v Speaker, National Assembly [2017] ZACC 21; 2017 (5) SA 300 (CC); 2017 (8) BCLR 1061 (CC)",
        "Mazibuko N.O. v Sisulu N.O. [2013] ZACC 28; 2013 (6) SA 249 (CC); 2013 (11) BCLR 1297 (CC)",
        "Zondi v MEC for Traditional and Local Government Affairs [2004] ZACC 19; 2005 (3) SA 589 (CC); 2005 (4) BCLR 347 (CC)",
        "Limpopo Legal Solutions v Vhembe District Municipality [2017] ZACC 30; 2018 (4) BCLR 430 (CC)",
        "Long v South African Breweries (Pty) Limited [2019] ZACC 7; 2019 JDR 0218 (CC); 2019 (5) BCLR 609 (CC); \nBiowatch Trust v Registrar, Genetic Resources [2009] ZACC 14; 2009 (6) SA 232 (CC); 2009 (10) BCLR 1014 (CC); \nAffordable Medicines Trust v Minister of Health [2005] ZACC 3; 2006 (3) SA 247 (CC); 2005 (6) BCLR 529 (CC)",
        "Investigating Directorate: Serious Economic Offences v Hyundai Motor Distributors (Pty) Ltd: In Re Hyundai Motor Distributors (Pty) Ltd v Smit N.O. [2000] ZACC 12; 2001 (1) SA 545 (CC); 2000 (10) BCLR 1079 (CC)",
        "Sanderson v Attorney-General, Eastern Cape [1997] ZACC 18; 1998 (2) SA 38 (CC); 1997 (12) BCLR 1675 (CC); \nMadyibi v Minister of Safety and Security 2008 JDR 0505; \nFerreira v Levin N.O.; Vryenhoek v Powell N.O. [1996] ZACC 27; 1996 (2) SA 621 (CC); 1996 (4) BCLR 441 (CC)",
        "Stainbank v SA Apartheid Museum at Freedom Park [2011] ZACC 20; 2011 JDR 0706 (CC); 2011 (10) BCLR 1058 (CC)",
        "Helen Suzman Foundation v President of the Republic of South Africa [2014] ZACC 32; 2015 (2) SA 1 (CC); 2015 (1) BCLR 1 (CC) ",
        "Florence v Government of the Republic of South Africa [2014] ZACC 22; 2014 (6) SA 456 (CC); 2014 (10) BCLR 1137 (CC); \n National Coalition for Gay and Lesbian Equality and Others v Minister of Home Affairs and Others [1999] ZACC 17; 2000 (2) SA 1 (CC); 2000 (1) BCLR 39 (CC); \nTrencon Construction (Pty) Ltd v Industrial Development Corporation of South Africa Ltd [2015] ZACC 22; 2015 (5) SA 245 (CC); 2015 (10) BCLR 1199 (CC)",
        " Hotz v University of Cape Town [2017] ZACC 10; 2018 (1) SA 369 (CC); 2017 (7) BCLR 815 (CC) ",
        "Swartbooi v Brink [2003] ZACC 25; 2006 (1) SA 203 (CC); 2003 (5) BCLR 502 (CC)",
        " Limpopo Legal Solutions v Vhembe District Municipality [2017] ZACC 14; 2017 (9) BCLR 1216 (CC) (Limpopo Legal Solutions I) ",
        " Pheko v Ekurhuleni Metropolitan Municipality (No. 2) [2015] ZACC 10; 2015 (5) SA 600 (CC); 2015 (6) BCLR 711 (CC) ",
        "South African Social Security Agency v Minister of Social Development (Corruption Watch (NPC) RF Amicus Curiae) [2018] ZACC 26; 2018 JDR 1451 (CC); 2018 (10) BCLR 1291 (CC)",
        "MEC for Health, Eastern Cape v Kirland Investments (Pty) Ltd t/a Eye & Lazer Institute [2014] ZACC 6; 2014 (3) SA 481 (CC); 2014 (5) BCLR 547 (CC) (Kirland)",
        " Njongi v MEC, Department of Welfare, Eastern Cape [2008] ZACC 4; 2008 (4) SA 237 (CC); 2008 (6) BCLR 571 (CC)",
        "South African Liquor Traders’ Association v Chairperson, Gauteng Liquor Board [2006] ZACC 7; 2009 (1) SA 565 (CC); 2006 (8) BCLR 901 (CC) (Liquor Traders)",
        " Mohamed v President of the Republic of South Africa (Society for the Abolition of the Death Penalty in South Africa and Another Intervening) [2001] ZACC 18; 2001 (3) SA 893 (CC); 2001 (7) BCLR 685 (CC)",
        "Chief Lesapo v North West Agricultural Bank [1999] ZACC 16; 2000 (1) SA 409 (CC); 1999 (12) BCLR 1420 (CC)",
        "Nyathi v MEC for Department of Health, Gauteng [2008] ZACC 8; 2008 (5) SA 94 (CC); 2008 (9) BCLR 865 (CC)",
        "MEC for Health, Gauteng v Lushaba [2016] ZACC 16; 2017 (1) SA 106 (CC); 2016 (8) BCLR 1069 (CC)",
        "Helen Suzman Foundation v Judicial Service Commission [2018] ZACC 8; 2018 (4) SA 1 (CC); 2018 (7) BCLR 763 (CC)",
        "SS v VV-S [2018] ZACC 5; 2018 JDR 0275 (CC); 2018 (6) BCLR 671 (CC) ; Limpopo Legal Solutions v Eskom Holdings Soc Limited [2017] ZACC 34; 2017 (12) BCLR 1497 (CC) (Eskom)",
        "Mtuze v Bytes Technology Group South Africa (Pty) Ltd [2013] ZACC 31; 2013 JDR 1998 (CC); 2013 (12) BCLR 1358 (CC)",
        "Paulsen v Slip Knot Investments 777 (Pty) Limited [2015] ZACC 5; 2015 (3) SA 479 (CC); 2015 (5) BCLR 509 (CC); ",
        " President of the Republic of South Africa v Quagliani; President of the Republic of South Africa v Van Rooyen; Goodwin v Director-General, Department of Justice and Constitutional Development [2009] ZACC 9; 2009 (2) SA 466 (CC); 2009 (8) BCLR 785 (CC) ",
        "De Lacy v South African Post Office [2011] ZACC 17; 2011 JDR 0504 (CC); 2011 (9) BCLR 905 (CC)",
        " Social Development [2016] ZACC 43; 2017 (3) SA 570 (CC); 2017 (3) BCLR 267 (CC)",
        " Mighty Solutions t/a Orlando Service Station v Engen Petroleum Ltd [2015] ZACC 34; 2016 (1) SA 621 (CC); 2016 (1) BCLR 28 (CC)",
        " Maphango v Aengus Lifestyle Properties (Pty) Ltd [2012] ZACC 2\n\n"
      ]
    },
    {
      "id": "EconomicFreedomFightersvGordhanandOthersPublicProtectorandAnothervGordhanandOthersZACCBCLRCC",
      "href": "http://www.saflii.org/za/cases/ZACC/2020/10.html",
      "title": "Economic Freedom Fighters v Gordhan and Others; Public Protector and Another v Gordhan and Others [2020] ZACC 10; 2020 (8) BCLR 916 (CC)",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2020-05-29T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "Chapter_9_Institutions"
      ],
      "justicesConcurring": "Khampepe ADCJ, Jafta J, Madlanga J, Majiedt J, Mathopo AJ, Mhlantla J, Theron J, Tshiqi J and Victor AJ",
      "summary": "The second applicant conducted an investigation into the respondent regarding violations of the Executive Ethics Code as well as maladministration, improper conduct, and corruption by the South African Revenue Services. The second applicant in her remedial action then directed that the President take note of her findings of maladministration, improper conduct, and corruption against the respondent and take disciplinary action against him.\r\n. \r\nThe respondent then took the report of the applicant for judicial review and applied for an urgent interdict to temporarily suspend the remedial action and prevent the applicant from enforcing it until the review of the report had been concluded. The High Court was satisfied that the respondents’ application met the test for urgency and granted him the urgent interdict sought. \r\n\r\n\r\nThe issue brought before the Constitutional Court was whether the test for urgent interdicts was appropriate for granting interdicts against the second applicant. The first applicant argued that a stricter test for interim interdicts against the second applicant be developed.\r\n \r\nThe court decided that the current test for urgent interdicts provided by the OUTA case where the applicant has to prove:\r\n1.\tThat on the face of it there is a right\r\n2.\tThat there is imminent harm to the right\r\n3.\tBalance of convenience and\r\n4.\tThat the applicant has no other remedy that can help\r\nwas satisfactory. \r\n\r",
      "snippet": "The Public Protector issued the SARS Report which directed the President to take note of the findings of maladministration, corruption and improper conduct and take appropriate disciplinary action against Mr Gordhan. Mr Gordhan launched an urgent application in the High Court on 10 July 2019 for an order temporarily suspending this remedial action and interdicting the Public Protector from enforcing it, pending the finalisation of a judicial review in which Mr Gordhan sought to set aside the SARS Report. This case concerned the appropriate test to be applied when granting interim interdicts against the Public Protector. ",
      "facts": "The second applicant investigated the respondent and concluded her investigation by releasing a report into her findings. The report directed that the President take note of the findings made of maladministration, improper conduct, and corruption and take action against the respondent. The respondent then approached the High Court for an urgent interdict to temporarily suspend the remedial action and prevent the applicant from enforcing it. ",
      "decision": "\r\nThe first applicant’s argument for a stricter test for urgent interdicts against the second applicant was without merit.\r\nThe OUTA test already provided that urgent interdicts are granted only in exceptional circumstances.\r\nThe OUTA test was flexible enough to take into account the constitutional role of the Public Protector and it had enough safeguards to protect these powers and functions when an interim order was being sought. \r\nWhen allowing the interim order, the court also took into account whether or not the interdict would interfere with the powers of the second applicant.\r\nIt was found that the powers of the second applicant would not be hindered by the interdict. \r\n\r",
      "dissent": "",
      "citedCases": [
        "National Treasury v Opposition to Urban Tolling Alliance [2012] ZACC 18; 2012 (6) SA 223 (CC); 2012 (11) BCLR 1148 (CC)",
        "Biowatch Trust v Registrar, Genetic Resources [2009] ZACC 14; 2009 (6) SA 232 (CC); 2009 (10) BCLR 1014 (CC)",
        "Tiekiedraai Eiendomme (Pty) Limited v Shell South Africa Marketing (Pty) Limited [2019] ZACC 14; 2019 JDR 0719 (CC); 2019 (7) BCLR 850 (CC) ",
        "Economic Freedom Fighters v Speaker of the National Assembly and Others; Democratic Alliance v Speaker of the National Assembly [2016] ZACC 11; 2016 (5) BCLR 618 (CC); 2016 (3) SA 580 (CC)",
        "Gcaba v Minister for Safety and Security [2009] ZACC 26; 2010 (1) SA 238 (CC); 2010 (1) BCLR 35 (CC)",
        "Chirwa v Transnet Limited [2007] ZACC 23; 2008 (4) SA 367 (CC); 2008 (3) BCLR 251 (CC) ",
        "General Council of the Bar of South Africa v Jiba [2019] ZACC 23; 2019 JDR 1194 (CC); 2019 (8) BCLR 919 (CC) ",
        "Mankayi v AngloGold Ashanti Ltd [2011] ZACC 3; 2011 (3) SA 237 (CC); 2011 (5) BCLR 453 (CC)",
        "Minister of Safety and Security v Luiters [2006] ZACC 21; 2007 (2) SA 106 (CC); 2007 (3) BCLR 287 (CC)",
        "Phoebus Apollo Aviation CC v Minister of Safety and Security [2002] ZACC 26; 2003 (2) SA 34 (CC); 2003 (1) BCLR 14 (CC) at para 9; and S v Boesak [2000] ZACC 25; 2001 (1) SA 912 (CC); 2001 (1) BCLR 36 (CC)",
        "Loureiro v Imvula Quality Protection (Pty) Ltd [2014] ZACC 4; 2014 (3) SA 394 (CC); 2014 (5) BCLR 511 (CC) ",
        "Magajane v Chairperson, North West Gambling Board [2006] ZACC 8; 2006 (5) SA 250 (CC); 2006 (10) BCLR 1133 (CC)",
        " Phillips v National Director of Public Prosecutions [2005] ZACC 15; 2006 (1) SA 505 (CC); 2006 (2) BCLR 274 (CC)",
        "S v Pennington [1997] ZACC 10; 1997 (4) SA 1076; 1997 (10) BCLR 1413",
        "Radio Pretoria v Chairperson, Independent Communications Authority of South Africa [2004] ZACC 24; 2005 (4) SA 319 (CC); 2005 (3) BCLR 231 (CC)",
        "African Christian Democratic Party v Electoral Commission [2006] ZACC 1; 2006 (3) SA 305 (CC); 2006 (5) BCLR 579 (CC)",
        "South Cape Corporation (Pty) Ltd v Engineering Management Services (Pty) Ltd 1977(3) SA 534 (A) (South Cape Corporation)",
        "lnternational Trade Administration Commission v SCAW South Africa (Pty) Ltd [2010] ZACC 6; 2012 (4) SA 618 (CC); 2010 (5) BCLR 457 (CC).",
        "Machele v Mailula [2009] ZACC 7; 2010 (2) SA 257 (CC); 2009 (8) BCLR 767 (CC)",
        "United Democratic Movement v Speaker of the National Assembly [2017] ZACC 21; 2017 (5) SA 300 (CC); 2017 (8) BCLR 1061 (CC).",
        "Public Protector v South African Reserve Bank [2019] ZACC 29; 2019 (6) SA 253 (CC); 2019 (9) BCLR 1113 (CC)",
        "Florence v Government of the Republic of South Africa [2014] ZACC 22; 2014 (6) SA 456 (CC); 2014 (10) BCLR 1137 (CC)",
        "Trencon Construction (Pty) Limited v Industrial Development Corporation of South Africa Limited [2015] ZACC 22; 2015 (5) SA 245 (CC); 2015 (10) BCLR 1199 (CC) ",
        "National Coalition for Gay and Lesbian Equality v Minister of Home Affairs [1999]  ZACC 17[1999] ZACC 17; ; 2000 (2) SA 1 (CC); 2000 (1) BCLR 39 (CC)",
        "Black Sash Trust v Minister of Social Development (Freedom Under Law intervening) [2017] ZACC 20; 2017 (9) BCLR 1089 (CC) (Black Sash)",
        "Swartbooi v Brink [2003] ZACC 25; 2006 (1) SA 203 (CC); 2003 (5) BCLR 502 (CC)",
        "South African Social Security Agency v Minister of Social Development (Corruption Watch (NPC) RF Amicus Curiae) [2018] ZACC 26; 2018 JDR 1451 (CC); 2018 (10) BCLR 1291 (CC)",
        "President of the Republic of South Africa v South African Rugby Football Union [1999] ZACC 11; 2000 (1) SA 1(CC)[1999] ZACC 11; ; 1999 (10) BCLR 1059 (CC)",
        "Head of Department: Mpumalanga Department of Education v Hoërskool Ermelo [2009] ZACC 32; 2010 (2) SA 415 (CC); 2010 (3) BCLR 177 (CC)\r\n"
      ]
    },
    {
      "id": "CertificationoftheConstitutionoftheRepublicofSouthAfrica",
      "href": "http://www.saflii.org/za/cases/ZACC/1996/26.html",
      "title": "\r\nCertification of the Constitution of the Republic of South Africa, 1996\r\n\r",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "1996-09-06T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_1__Republic_of_South_Africa"
      ],
      "justicesConcurring": "President Chaskalson A ,Deputy President  Langa P, Justice Ackermann L, Justice Didcott J, Justice Kriegler J, Justice Madala T, Justice Mahomed I, Justice Mokgoro Y, Justice O’ Reagen K, Justice Sachs A, Justice Golstone RJ",
      "summary": "The  Constitutional Court judgment was unique in the sense that it required the Constitutional Court to consider whether the constitutional text adopted by the Constitutional Assembly complied with the 34 constitutional principles in schedule four of the Interim Constitution. \r\n\r\nThe first draft of constitutional text was adopted by the Constitutional Assembly on 10 May 1996 and referred to the Constitutional Court in order certify. It is also important to note that in the process, the Constitutional Court heard various submissions on the final constitutional text by political parties and other civil bodies and as elaborated further below the Constitutional Court found that the draft constitutional text did not comply in all aspects with the constitutional principles and referred it back to the Constitutional Assembly.\r\n\r\nThe  Constitutional Court, was tasked with certifying the final constitutional text and the Court had to determine whether the constitutional text complied with the 34 constitutional principles in Schedule 4 of the Interim Constitution. \nThe Constitutional Court’s judgment was divided in eight chapters, ranging from the context of the certification process, the interpretation of the constitutional principles to the application and interpretation of the Bill of Rights and provincial and local Government powers. \n\nThere were certain serious concerns raised by the Constitutional Court in measuring the final text against the constitutional principles. One of the concerns involved the safeguarding and protection of the independence of the Public-Protector and the Auditor-General which did not comply with Constitutional Principle CP XXIX, relating to the independence of the Public Service Commission, the Reserve Bank, an Auditor General and a Public Protector. The Constitutional Court also emphasised that the independence and impartiality of the Public Protector is critical to ensuring an accountable and effective government. As stated above the constitutional text was referred back to the Constitutional Assembly for further amendments. \n",
      "snippet": "",
      "facts": "",
      "decision": "In the Constitution, section 1 refers to the founding values of the Constitution. These values emphasise that the Republic of South Africa is “one, sovereign, democratic state” which is founded on various core value such as human dignity, non-racialism, supremacy of the Constitution and a multi-party system of democratic governance. It is perhaps critical before briefly summarising the Constitutional Court’s views on these values in the judgment to highlight that these founding values form the foundation of our constitutional order and in terms of the Constitution numerous requirements need to be met to amend these provisions.\r\nTurning to the Constitutional Court judgment, the Court emphasised that it is necessary to identify the basic structures of our new constitutional order and it was the first question the Court was faced with on certifying the final constitutional text against the 34 constitutional principles. The Constitutional Court emphasised that these structures include “a constitutional democracy based on the supremacy of the Constitution protected by an independent judiciary” which aligns with Constitutional principles IV, VII and XV. Furthermore, the Constitutional court emphasised the need for a “representative government embracing multi-party democracy, a common voters’ roll and, in general, proportional representation”. The Constitutional Court found that the new final constitutional test satisfied the  basic structures of our new constitutional order which is now captured in section 1 of the Constitution.\r",
      "dissent": "",
      "citedCases": [
        "Coetzee v Government of the Republic of South Africa; Matiso and Others v Commanding Officer, Port Elizabeth Prison and Others 1995 (4) SA 631 (CC)",
        "Du Plessis and Others v De Klerk and Another 1996(3) SA 850 (CC), 15 May 1996",
        "Executive Council, Western Cape Legislature and Others v President of the Republic of South Africa and Others, 1995 (4) SA 877 (CC)",
        "In re: KwaZulu-Natal Amakhosi and Iziphakanyiswa Amendment Bill of 1995, In re: Payment of Salaries  Allowances and Other privileges to the Ingonyama Bill of 1995,  1996 (4) SA 653 (CC)",
        "Ex Parte Speaker of the National Assembly: In re Dispute Concerning the Constitutionality of Certain Provisions of the National Education Policy Bill 83,1995 1996 (3) SA 289 (CC)",
        "S v Williams and Others, 1995 (3) SA 632 (CC)",
        "The Azanian Peoples Organisation (AZAPO) and Others v The President of the Republic of South Africa and Others (CC) 1996 (4) SA 672, 25 July 1996\r\n"
      ]
    },
    {
      "id": "ABandAnothervPridwinPreparatorySchoolandOthersZACC",
      "href": "http://www.saflii.org/za/cases/ZACC/2020/12.html\r\r",
      "title": "\r\n\r\nAB and Another v Pridwin Preparatory School and Others [2020] ZACC 12\r",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2020-06-17T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_8"
      ],
      "justicesConcurring": "Mogoeng CJ, Cameron J, Froneman J, Jafta J, Khampepe J, Ledwaba AJ, Madlanga J, Mhlantla J, Nicholls AJ and Theron J",
      "summary": "The applicants were the parents of children that went to the first respondent’s school. The applicants had signed contracts for the two children with the respondent. In these contracts was a clause that allowed the respondent to cancel the contract at any time, for any reason as long as a full term’s written notice was given. \n\nAfter a series of incidents where the applicants behaved inappropriately in front of young children, the respondent terminated the applicants’ contracts with a written full-term notice. The applicants then proceeded to approach the High Court for an interim order whilst they sought to have the termination of their contract with the respondent cancelled.\n\nThe issue was whether the clause in the contract was a Constitutionally valid one as it did not afford the other party to the contract to state their case before the contract was terminated. \nSecondly, whether independent schools had constitutional duties and obligations that limited their exercise of contractual rights.\n\nThe court found that s 8 of the Constitution allowed for the development of the common law to hold independent schools as providing basic education. \n",
      "snippet": "",
      "facts": "",
      "decision": "\r\nThat the clause was unconstitutional, went against public policy and was unenforceable because there was no fair procedure followed in the case. \r\nIt was found that once an independent school provided basic education then it was required of that school to ensure that the education of the children attending the school were not affected. \r\nThe argument that only the state provides basic education and not independent schools was based on incorrect pre-constitutional common law principles that cannot stand in light of the Constitution. \r\nThe common law was developed under s 8(3)(a) to hold independent schools of providing basic education. \r",
      "dissent": "\r\nThere were five different judgements that all agreed with the fact that the clause was constitutionally invalid because it went against not only public policy but the Constitution. \r\nIt also impacted the rights of the children in so far as it compromised their basic right to education. \r",
      "citedCases": [
        "Governing Body of the Juma Musjid Primary School v Essay NO [2011] ZACC 13; 2011 JDR 0343 (CC); 2011 (8) BCLR 761 (CC)",
        "Barkhuizen v Napier [2007] ZACC 5; 2007 (5) SA 323 (CC); 2007 (7) BCLR 691 (CC)",
        "Ruta v Minister of Home Affairs [2018] ZACC 52; 2019 (2) SA 329 (CC); 2019 (3) BCLR 383 (CC)",
        "National Coalition for Gay and Lesbian Equality v Minister of Home Affairs [1999] ZACC 17; 2000 (2) SA 1 (CC); 2000 (1) BCLR 39 (CC);JT Publishing v Minister of Safety and Security [1996] ZACC 23; 1997 (3) SA 514 (CC); 1996 (12) BCLR 1599 (CC)",
        "President of the Republic of South Africa v Democratic Alliance [2019] ZACC 35; 2019 JDR 1753 (CC); 2019 (11) BCLR 1403 (CC)",
        "Sebola v Standard Bank of South Africa Ltd [2012] ZACC 11; 2012 (5) SA 142 (CC); 2012 (8) BCLR 785 (CC); \nIndependent Electoral Commission v Langeberg Municipality [2001] ZACC 23; 2001 (3) SA 925 (CC); 2001 (9) BCLR 883 (CC)",
        "POPCRU v SACOSWU [2018] ZACC 24; 2019 (1) SA 73 (CC); 2018 (11) BCLR 1411 (CC); \nMankayi v AngloGold Ashanti Ltd [2011] ZACC 3; 2011 (3) SA 237 (CC); 2011 (5) BCLR 453 (CC)",
        "National Education Health & Allied Workers Union v University of Cape Town [2002] ZACC 27; 2003 (3) SA (1) (CC); 2003 (2) BCLR 154 (CC) at para 25 and S v Boesak [2000] ZACC 25; 2001 (1) SA 912 (CC); 2001 (1) BCLR 36 (CC); \nMEC for Education, Kwazulu-Natal v Pillay [2007] ZACC 21; 2008 (1) SA 474 (CC); 2008 (2) BCLR 99 (CC); \nMinister for Welfare and Population Development v Fitzpatrick [2000] ZACC 6; 2000 (3) SA 422 (CC); 2000 (7) BCLR 713(CC)",
        "J v National Director of Public Prosecutions [2014] ZACC 1; 2014 (2) SACR 1 (CC); 2014 (7) BCLR 764 (CC); \nS v M [2007] ZACC 18; 2008 (3) SA 232 (CC); 2007 (12) BCLR 1312 (CC); \nDirector of Public Prosecutions, Transvaal v Minister of Justice and Constitutional Development [2009] ZACC 8; 2009 (4) SA 222 (CC); 2009 (7) BCLR 637 (CC); \nC v Department of Health and Social Development, Gauteng [2012] ZACC 1; 2012 (2) SA 208 (CC); 2012 (4) BCLR 329 (CC); \nKwazulu-Natal Joint Liaison Committee v MEC for Education, Kwazulu-Natal [2013] ZACC 10; 2013 (4) SA 262 (CC); 2013 (6) BCLR 615 (CC)",
        "Head of Department, Mpumalanga Department of Education v Hoërskool Ermelo [2009] ZACC 32; 2010 (2) SA 415 (CC); 2010 (3) BCLR 177 (CC); \nAAA Investments (Pty) Ltd v Micro Finance Regulatory Council [2006] ZACC 9; 2007 (1) SA 343 (CC); 2006 (11) BCLR 1255 (CC); \nResidents of Joe Slovo Community, Western Cape v Thubelisha Homes [2009] ZACC 16; 2010 (3) SA 454 (CC); 2009 (9) BCLR 847 (CC); \nAllPay Consolidated Investment Holdings (Pty) Ltd v Chief Executive Officer, South African Social Security Agency (No 2) [2014] ZACC 12; 2014 (4) SA 179 (CC); 2014 (6) BCLR 641 (CC); \nDu Plessis v De Klerk [1996] ZACC 10; 1996 (3) SA 850 (CC); 1996 (5) BCLR 658 (CC)",
        "Centre for Child Law v Minister for Justice and Constitutional Development [2009] ZACC 18; 2009 (6) SA 632 (CC); 2009 (11) BCLR 1105 (CC)",
        "Teddy Bear Clinic for Abused Children v Minister of Justice and Constitutional Development [2013] ZACC 35; 2014 (2) SA 168 (CC); 2013 (12) BCLR 1429 (CC)",
        "Ex Parte Gauteng Provincial Legislature: In re Dispute Concerning the Constitutionality of the Gauteng School Education Bill of 1995 [1996] ZACC 4, 1996 (3) SA 165 (CC), 1996 (4) BCLR 537",
        "Gelyke Kanse v Chairperson of the Senate of the University of Stellenbosch [2019] ZACC 38; 2020 (1) SA 368 (CC); 2019 (12) BCLR 1479 (CC); \n"
      ]
    },
    {
      "id": "TheCitizenPtyLtdandOthersvMcBride",
      "href": "\r\nhttp://www.saflii.org/za/cases/ZACC/2011/11.html\r\r",
      "title": "The Citizen 1978 (Pty) Ltd and Others v McBride",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2011-04-08T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_10"
      ],
      "justicesConcurring": "Ngcobo CJ, Brand AJ,Cameron J,Froneman J, Nkabinde J, Yacoob J, Khampepe J, Mogoeng J.",
      "summary": "The respondent worked as an operative of the armed wing of the political party, the African National Congress (Umkhonto we Sizwe) and he carried out a car bomb attack outside a Restaurant on the Durban beachfront in 1986, that killed three young women and injured 69 other people. The respondent was found guilty of murder and was sentenced to death. In 1997 he however applied for amnesty under the Promotion of National Unity and Reconciliation Act 34 of 1995 and was granted it in 2001. In 2003 the respondent was a candidate to head the Ekurhuleni metro police. The appellant in September and October 2003 published various articles and editorials questioning the respondent’s candidacy and expressed the view that he was a “criminal” and “murdered”. Some of the articles failed to mention that the respondent was granted amnesty by the National Truth and Reconciliation Commission and the respondent sued the appellant and other journalists for defamation in the Witwatersrand Local Division (South Gauteng High Court), arguing that the articles were malicious as he was granted amnesty. The respondent was successful in the High Court with the defamation claim and the appellants then appealed to the Supreme Court of Appeal. The Supreme Court of Appeal only partially upheld the appeal and reduced the amount of damages awarded to the respondent. The appellants then appealed to the constitutional Court against the Supreme Court of Appeal judgment and the respondent cross-appealed the reduction in damages awarded by the Supreme Court of Appeal.\n\nThe key issue the Constitutional Court had to determine was how amnesty granted to the respondent for crimes committed (during the struggle against apartheid) by the National Truth and Reconciliation Commission affected a claim for defamation. The respondent was granted amnesty in terms of the Promotion of National Unity and Reconciliation Act 34 of 1995 for crimes committed in 1986. In 2003 the appellants in various commentary covering the candidacy of the respondent for the position of head of the Erkhuleni Metro police referred to the respondent as a “murderer” and “criminal”. Justice Cameron writing for the majority geld that the Promotion of National Unity and Reconciliation Act 34 of 1995 did not make the fact that the respondent committed murder untrue and the Act did not prohibit frank public discussion. Justice Cameron emphasised that the requirement that a comment must be ”fair”  protects criticism even if it is extreme so long it is without malice, on a matter of public interest and  on facts that are true. The Constitutional Court therefore upheld the appellant’s main appeal and dismissed the respondent’s cross appeal but the Court did find that the appellant had defamed the respondent by claiming falsely that he was not contrite and awarded the respondent damages on this aspect.",
      "snippet": "",
      "facts": "",
      "decision": "As the matter essentially concerned a defamation claim and the defences raised thereto a key issue the Constitutional Court had to decide was, how to find a balance between two constitutional rights, namely the appellant’s right to freedom of expression on the one hand and the respondent’s right to human dignity. Justice Cameron writing for the majority, emphasised that the right to human dignity is not only given separate constitutional recognition in s 10 of the Constitution but is also one of the founding values of the society terms of s 1. Therefore, a failure to uphold the right is not only a violation of s10 but is also a threat to a founding value underpinning the legitimacy of the State. However importantly Cameron J, pointed out that freedom of expression is just as important as human dignity and one cannot say that human dignity trumps freedom of expression. The law of defamation importantly must be interpreted to give effect to the appropriate balance between the right to freedom of expression on the one hand and a person’s human dignity on the other hand. Cameron J held on this interpretation that the requirement that a comment must be “fair” in defence to a claim for defamation gives effect to the balance between the right to freedom of expression and dignity.",
      "dissent": "Partial dissenting judgments were written by Ngcobo J and Mogoeng J. Justice Ngcobo agreed with the majority judgment that the Promotion of National Unity and Reconciliation Act 34 of 1995 did not make the facts of the commission of the murders untrue but Ngcobo J held that the balancing of the right to freedom and the right to dignity  required the facts upon which the appellant relied in their comment to include the fact that the respondent was granted amnesty by the National Truth and Reconciliation Commission. However, on reading the coverage of the respondent’s candidacy collectively Ngcobo J found that this fact was adequately stated. Justice Ngcobo however held that since the appellant failed to make reference to the circumstances under which the appellant was released from detention in Mozambique the statement of the appellant concerning gun-running allegations in Mozambique was based on “half-truths” and therefore was untrue, justifying the respondent’s cross appeal. Justice Mogoeng in his judgment specifically held that the defamatory statements that the respondent was a “criminal” and “murder “must be determined within the context of the objective of the amnesty process and that the truth told during the amnesty process was not meant to be used in a manner that defeats the purpose of national reconciliation. Justice Mogoeng held that the defamatory statements that the respondent was a “murderer” and “criminal” was malicious and was contrary to the pursuit of national reconciliation. ",
      "citedCases": [
        "Albutt v Centre for the Study of Violence and Reconciliation and Others 2010 (3) SA 293 (CC)",
        "Azanian Peoples Organisation (AZAPO) and Others v President of the Republic of South Africa and Others 1996 (4) SA 671 (CC)",
        "Bhe and Others v Magistrate, Khayelitsha, and Others (Commission for Gender Equality, as amicus curiae); Shibi v Sithole and Others; South African Human Rights Commission and Another v President of the Republic of South Africa and Another 2005 (1) SA 580 (CC)",
        "Brümmer v Minister for Social Development and Others 2009 (6) SA 323 (CC)",
        "Dawood and Another v Minister of Home Affairs and Others; Shalabi and Another v Minister of Home Affairs and Others; Thomas and Another v Minister of Affairs and Others 2000 (8) BCLR 837 (CC)",
        "Dikoko v Mokhatla 2007 (1) BCLR 1 (CC)",
        "Doctors for Life International v Speaker of the National Assembly and Others 2006 (6) SA 416 (CC)",
        "Du Toit v Minister for Safety and Security and Another 2009 (12) BCLR 1171 (CC)",
        "Government of the Republic of South Africa and Others v Grootboom and Others 2001 (1) SA 46 (CC)",
        "Islamic Unity Convention v Independent Broadcasting Authority and Others  2002 (4) SA 294 (CC)",
        "Khumalo and Others v Holomisa 2002 (5) SA 401 (CC)",
        "Le Roux and Others v Dey [2011] ZACC 4",
        "Minister for Justice and Constitutional Development v Chonco and Others 2010 (4) SA 82 (CC)",
        "National Coalition for Gay and Lesbian Equality and Another v Minister of Justice and Others 1998 (12) BCLR 1517 (CC)",
        "President of the Republic of South Africa and Another v Hugo 1997 (6) BCLR 708 (CC)",
        "S v Mamabolo (E TV and Others, intervening) 2001 (5) BCLR 449 (CC)",
        "Shalabi and Another v Minister of Home Affairs and Others; Thomas and Another v Minister of Home Affairs and Others [2000] ZACC 8; 2000 (3) SA 936 (CC)",
        "South African Broadcasting Corp Ltd v National Director of Public Prosecutions and Others 2007 (1) SA 523 (CC)\n "
      ]
    },
    {
      "id": "SvMakwanyaneandAnother",
      "href": "http://www.saflii.org/za/cases/ZACC/1995/3.html",
      "title": "S v Makwanyane and Another",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "1995-06-06T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_11",
        "sec_10"
      ],
      "justicesConcurring": "Chaskalson P, Ackermann J, Didcott J, Kentridge AJ, Langa J, Madala J, Mahomed J, Mokgoro J, O’Regan J, Sachs J",
      "summary": "The matter was referred to the Constitutional Court by the Appelate  division of the Supreme Court, and the Constitutional Court essentially had to determine whether the death sentence  in terms of s 277(1)(a) of the Criminal Procedure Act 51 of 1977 was consistent with ss 9 and 11 (2) of the Interim Constitution, concerning the right to life and the prohibition againt ”cruel, inhuman or degrading punishment”. It is important to note that the trial was concluded before the Interim Constitution (also known as the Constitution of the Republic of South Africa,1993)  came into operation and therefore the constitutionality of the death sentence was not considered  at the trial itself.\n\nChaskalson J,writing for the majority  essentially found that such an extreme form of punishment putting an end to the right to life itself and infringing on  various other constitutional rights, especially the right not to be subjected to cruel, inhuman or degrading punishment, could not be justified as  reasonable in terms of the limitation test in s33 of the Interim Constitution. The Constitutional Court declared  the death penalty unconstitutional.\n\nThe Constitutional Court was principally concerned with the question whether the death penalty in terms of s 277(1)(a) of the Criminal Procedure Act 51 of 1977 was in conflict with various provisions of the then Interim Constitution such as the right to life, dignity and the prohibition against “cruel, inhuman or degrading punishment”. \n\nChaskalson P, considered various foreign judgment  and decisions of International Human Rigs  Tribunals  that  emphasised that ”cruel, inhuman and degrading punishment” is in clear contrast to the right of dignity which is also a  founding value of the South African Constitution.\n\nChaskalson P, applied the limitation of rights test in terms of s 33 of the Interim Constitution,which involves a two-stage test to determine  whether the limitation on a constitutional right is reasonable, necessary and proportional taking into account all competing rights. Chaskalson P, specicially held that one has to ask whether the death penalty is ”cruel, inhumanor degrading” and whether it can be justified in terms of  s 33 of the Interim Constitution.\n",
      "snippet": "",
      "facts": "",
      "decision": "\nIt is important to note that the constitutionality of the death sentence triggered an analysis of various constitutional rights besides the right to life, which at the times was provided for in s 9 of the Interim Constitution. The right not to be subject to “cruel, inhuman and degrading punishment” and the right to dignity were also critical in the analysis. The majority judgment written by Chaskalson P, in fact focused more on the justification of the death sentence in relation to the right not to be subject on “cruel, inhuman and degrading punishment” in light of alternative severe sentences such as life imprisonment. It is however  important to note that Chaskalson P held that although the right to life is stated in unqualified terms, the right itself must accommodate the right to kill in lawful self-defence of one’s own life or the lives of others. \n\n<p>The concurring judgment of O’Reagen dealt more with the right to life and O’ Reagen J  explicitly held that the death sentence was also a breach of the right to life and dignity. O’Reagen J,  held that the meaning of the right to life must be considered in light of its purpose for which it was included in the Constitution. O’Reagen J emphasised that the right to life is interlinked with the right to dignity and was included in the Constitution not only to preserve the right to existence but includes the right to experience humanity and is central to a society where every individual is recognised and valued.</p> [sec_11]\n\n<p>The constitutional <b>right to dignity</b> directly comes into question on consideration of the constitutionality of the death penalty. Chaskalson P,  on analysis of the right to dignity specifically considered various foreign law which prohibited capital punishment. This analysis  included  judgments by the Federal Constitutional Court in Germany which emphasised that respect for human dignity specifically requires  the prohibition of cruel punishments and that the idea is not that “the State should turn an offender into an object of crime prevention to the detriment of his constitutionally protected right to social worth and respect”.</p>[sec_10]\n\n\n\n",
      "dissent": "All the justices of the Constitutional Court concurred with the main  judgment by Chaskalson P. It is however important that critical additional points were made by several justices in their separate judgments. \r\n\r\nJustice Sachs, pointed out although he was in full agreement with the main judgment, he was of the opinion that more weight  should have been placed on the right to life and right to dignity than the prohibition against ”cruel, inhuman or degrading punishment”. \r\n\r\nJustice Kriegler, in his separate judgment held that he also agreed with the reasoning of the main judgment but he was of the opinion that the s 33 limitation of rights’ test  in terms of the Interim Constitution, did not need to extend further than s 9  of the Interim Constitution, concerning the right to life. \r",
      "citedCases": [
        "S v Zuma and Two Others CCT/5/94"
      ]
    },
    {
      "id": "PortElizabethMunicipalityvVariousOccupiers",
      "href": "http://www.saflii.org/za/cases/ZACC/2004/7.html\r\r",
      "title": "Port Elizabeth Municipality v Various Occupiers\r\n\r",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2004-10-01T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_25__Property_Rights"
      ],
      "justicesConcurring": "Sachs J (Chaskalson CJ, Langa DCJ, Madala J, Mokgoro J, Moseneke J, Ngcobo J; O’Regan J, Skweyiya J, Van der Westhuizen J and Yacoob J concurring)",
      "summary": "The Port Elizabeth Municipality required an eviction order against 68 people who erected and occupied 29 shacks on privately owned land within the municipality. In their version, the occupiers had been living on the land for periods ranging from two to eight years and had not applied to the municipality for housing. They indicated that they were willing to leave the property if given reasonable notice and provided suitable alternative land to which they could move. \n\n<p>They were told they could move to a place referred to as Walmer Township and they rejected the proposal saying the area was crime-ridden and over-crowded and further that they feared they would have no security of occupation there and find themselves liable to further eviction. The municipality argued that if alternative land was made available to them, they would be disrupting the housing programme and forcing the municipality to grant them preferential treatment.</p>\n\n<p>The applicant sought for leave to appeal against the decision of the Supreme Court of Appeal to have the eviction order against the respondent restored. The court had to determine whether the decision of the SCA to set aside the eviction order should be overturned. It held that when dealing with constitutionally protected rights, it is important to uphold the values of human dignity, equality and freedom. One of the provisions of the Bill of Rights that has to be interpreted with these values in mind, is section 25, which provides for the right to property. This matter accordingly turns on establishing an appropriate constitutional relationship between section 25 and section 26. The court held that the provisions of section 25 (4) and (5) must be borne in mind whenever section 25 was being construed, this is because they emphasised that under the Constitution, the protection of property as an individual right was not absolute but subject to societal considerations.</p>\n\nThe Prevention of Illegal Eviction from and Unlawful Occupation of Land Act cannot simply be looked at as a legislative mechanism to re-establish common law property rights and it should not be seen as a means of promoting legal compassion in favour of the poor.  \nIn making its decision, the court must consider all relevant circumstances, including the manner in which occupation was effected, its duration and the availability of suitable alternative accommodation or land and as such it held that the application for leave to appeal was denied.\n",
      "snippet": "",
      "facts": "",
      "decision": "The Court, in a unanimous decision held that considering the period which the occupiers have lived on the land, the fact that eviction is not necessary for the land to be put to productive use and that this is a relatively small group of people who appear to be genuinely homeless and in need, it would not be just and equitable to order the eviction. It found that the state has a duty to satisfy both property and housing rights provided for in sections 25 and 26 of the Constitution. The application for leave to appeal was dismissed with costs.",
      "dissent": "",
      "citedCases": [
        "First National Bank of SA Limited t/a Wesbank v Commissioner for the South African Revenue Services and Another; First National Bank of SA Limited t/a Wesbank v Minister of Finance,   [2002] ZACC 5",
        "Government of the Republic of South Africa and Others v Grootboom and Others [2000] ZACC 19\r\n"
      ]
    },
    {
      "id": "MkontwanavNelsonMandelaMetropolitanMunicipality",
      "href": "http://www.saflii.org/za/cases/ZACC/2004/9.html \r\r\n",
      "title": "Mkontwana v Nelson Mandela Metropolitan Municipality",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2004-10-06T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_25__Property_Rights"
      ],
      "justicesConcurring": "Yacoob J ( Chaskalson CJ, Langa DCJ, Madala J, Moseneke J, Ngcobo J, Skweyiya J and Van der Westhuizen J  concurring); O'Regan J (Mokgoro J concurring) ",
      "summary": "There were three cases before the court, and they were all concerned with the constitutional validity of laws that in effect burden owners in relation to consumption charges for water and electricity supplied to other people who occupy their immovable property. The applicants applied for confirmation of an order of the High Court declaring the unconstitutionality of section 118(1) of the Local Government: Municipal Systems Act because the section permitted arbitrary deprivation of property and thus in conflict with section 25(1) of the Constitution. In the Mkontwana case, Ms Mkontwana bought a house for by an agreement that provided for her to pay the outstanding consumption charges necessary to obtain the section 118(1) certificate. She was informed that consumption charges were incurred by previous occupiers were in excess and had to be paid before the certificate could be issued.The applicants had applied for direct access to the Constitutional Court for confirmation of an order of the High Court declaring section 118(1) of the Local Government: Municipal Systems Act unconstitutional due to its deprivation of property which was in conflict with section 25(1) of the Constitution. The High court said that the section placed limits on the owner’s power to transfer immovable property. The issue before the court was whether the provisions 118(1) was consistent with section 25 of the Constitution.\n\nSection 118(1) of the Act and section 50(1)(a) of the Gauteng Local Government Ordinance No 17 of 1939 both precluded the transfer of immovable property unless all electricity and water consumption charges due to a municipality in connection with the property by all occupiers of including non-owner occupiers for a specified period were paid. The court in majority decided that the legislation deprives people of property. However, the deprivation is not arbitrary. The provision has an important purpose that encourages payment as well as a sense of civic responsibility. There is sufficient reason for the deprivation. Also, all municipalities had to provide owners with copies of electricity and water accounts sent to occupiers if the owners requested these in writing. The order of the South Eastern Cape Local Division of the High Court was not confirmed.\n",
      "snippet": "",
      "facts": "",
      "decision": "The court decided that these laws allow for arbitrary deprivation of property and infringe section 25(1) of the Constitution. The majority of the court said the legislation deprives people of property. However, the deprivation is not arbitrary. The provision has an important purpose that encourages payment as well as a sense of civic responsibility and such there was sufficient reason for the deprivation. Also, all municipalities had to provide owners with copies of electricity and water accounts sent to occupiers if the owners requested these in writing. The order of the South Eastern Cape High Court set aside.",
      "dissent": "",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "ThintPtyLtdvNationalDirectorofPublicProsecutionsandOthersZumaandAnothervNationalDirectorofPublicProsecutionsandOthers",
      "href": "http://www.saflii.org/za/cases/ZACC/2008/13.html",
      "title": "Thint (Pty) Ltd v National Director of Public Prosecutions and Others, Zuma and Another v National Director of Public Prosecutions and Others ",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2008-07-31T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_35"
      ],
      "justicesConcurring": "Langa CJ",
      "summary": "The National Director of Public Prosecution prosecuted Mr Zuma for corruption. The investigator pursued and sought 21 search and seizure warrants in terms of section 29 of the National Prosecuting Authority Act 32 of 1998 with the purpose of implicating Mr Zuma and Thint in the crimes they were suspected of. A total of 250 members of the Directorate of Special Operations were involved with a total of 93’000 documents seized. The State emphasised the need for surprise in their papers to ensure no evidence was removed or destroyed. Mr Zuma successfully challenged the lawfulness of the warrants and their execution in the Durban High Court submitting that the state had failed to prove the need for the warrants and that the warrants were vague and there was insufficient protection for Mr Zuma’s right to legal professional privilege. A similar challenge by Thint in the Pretoria High Court failed.\r\n\n<p>The applicants applied to the Constitutional Court for an order for the return of their documents. After an order by the Supreme Court of Appeal ruled that the state had shown sufficient need for a search and seizure operation, the warrants were neither too vague nor too broad, and that Mr Zuma’s right to privilege had been sufficiently protected. The court ordered that the state could retain the seized documents.</p>\n\n<p>The applicants argued that the warrants should have not been issued because the state failed to disclose various material facts. They also argued that Mr Zuma’s right to a fair trial in terms of <b>section 35(3) of the Constitution</b> had been threatened because the warrants did not sufficiently protect his legal professional privilege. It held that the reason that the state did not notify the applicants when it applied for the warrants was not unlawful as there was no reason to depart from the ordinary procedure. The court held further that none of the applicants made any claim of privilege during the searches. Moreover, since those searches, the applicants have failed to claim privilege in respect of any particular item or document seized, despite having had adequate time to do so. The court decided that all the applicants’ challenges to the search and seizure operation executed at various premises connected had failed. The court in a majority ruling dismissed the appeal.</p>",
      "snippet": "",
      "facts": "",
      "decision": "The court held that all the applicants’ challenges to the search and seizure operation executed at various premises connected to them had failed. It concluded that the application for the warrants, the terms of the warrants themselves, and their subsequent execution were lawful, in view of the relevant common-law, national legislation and constitutional principles. For that reason, although the applications for leave to appeal were granted, the appeals themselves were denied and the judgments of the Supreme Court of Appeal appealed against the applicants were confirmed.",
      "dissent": "The court in its dissenting judgment held that the state breached the duty of utmost good faith, by failing to disclose various material facts in its application for the warrants. The court found that  found that the state failed to justify its resort to the more drastic measure of a search warrant on the basis that other less drastic measures such as a section 28 summons would not have been effective in obtaining information from the applicants. In dealing with the idea by the state that people who were suspects were less likely to co-operate voluntarily. The court held that such a view was inconsistent with the spirit of the Constitution, in particular the right to be presumed innocent.",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "ExecutiveCounciloftheWesternCapeLegislatureandOthersvPresidentoftheRepublicofSouthAfricaandOthers",
      "href": "http://www.saflii.org/za/cases/ZACC/1995/8.html\r\r",
      "title": "Executive Council of the Western Cape Legislature and Others v President of the\r\nRepublic of South Africa and Others\r",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "1995-09-22T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "Separation_of_Powers"
      ],
      "justicesConcurring": "Chaskalson P",
      "summary": "The matter arises from a dispute between the Executive Council of the Western Cape and the national government relating to the validity of amendments to the Local Government Transition Act. The applicants applied for direct access to the Constitutional Court for an order declaring amendments to the Transition Act, effected by the President in terms of Proclamations R58 and R59 and section 16A of the same Act unconstitutional. \n\n<p>The applicants applied for direct access to the Constitutional Court and for an order declaring amendments to the Local Government Transition Act 209 of 1993, effected by the President in terms of Proclamations R58, R59 and section 16A of the same Act unconstitutional.  The issue before the court was whether Parliament had the authority to transfer its powers vested upon it by the Constitution to the executive arm of government. They argued that the Transition Act did not fall within the scope of the President's powers under section 235(8) of the Constitution to assign laws. The court held that adherence to the prescribed forms and procedures and insistence upon the executive not exceeding its powers are important safeguards in the Constitution.</p>\n\n<p>Section 16A was specifically authorised by Parliament and proclamations under that section were issued in consultation with and had the approval of the relevant committees of both houses of Parliament. The court held that the proclamations were recorded in Parliament and could have been invalidated by resolution and although this was inconsistent with the Constitution, no such resolution was made. The applicants succeeded in having Section 16A of the Transition Act declared inconsistent with the Constitution. The court held further that Proclamations R 58 and R 59 of 1995, which were purportedly endorsed under the provisions of section 16A of the Transition Act, cannot be validated under the provisions of section 235 of the Constitution and as such were also unconstitutional.</p>",
      "snippet": "",
      "facts": "",
      "decision": "The court held that by virtue of their inconsistency with the Constitution, the provisions of section 16A of the Local Government Transition Act were invalid. The Court, by a majority of 9 to 2, concluded that Proclamations R 58 and R 59 of 1995, which were promulgated under the provisions of section 16A of the Transition Act, cannot be validated under the provisions of <b>section 235 of the Constitution</b>. The court held that an order declaring that section 16A of the Transition Act inconsistent with the Constitution be made.",
      "dissent": "In its dissenting judgment by Madala J and Ngoepe AJ, the court concluded that the vesting of wide-ranging powers to the first respondent is an act of its own kind necessitated by the unique circumstances of transition which the country was facing. Due to this interpretation, it would not be able to strike down the proclamations on the basis that there could not have been a valid assignment of the administration of the relevant sections of the Transition Act. It held that <b>section 235(8) of the Constitution</b> provided a source of power for the first respondent to issue Proclamations R58 and R59.",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "DeLangevSmutsNOandOthers",
      "href": "http://www.saflii.org/za/cases/ZACC/1998/6.html",
      "title": "De Lange v Smuts NO and Others ",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "1998-05-28T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "Separation_of_Powers",
        "sec_12"
      ],
      "justicesConcurring": "Ackermann J.  Separate concurring judgment by Sachs J. Dissent by Didcott J, concurred by Kriegler J, O'Regan J and Mokgoro J.",
      "summary": "An application was made on behalf of the second, third and fourth respondents for the issue of a warrant committing the applicant to prison under section 66(3) of the Insolvency Act on the grounds that he had, been in breach of the provisions of the Act, failed to produce the books and documents he had been summoned to produce and that he had failed to answer questions lawfully put to him under section 65(1) fully and satisfactorily. The application was postponed for argument and thereafter the presiding officer who was not a magistrate, issued a warrant committing the applicant to prison. The court held that the matter was one that had to be to be determined through the application of the doctrine of separation of powers because section 66(3) of the Insolvency Act gave authority to appointees who happen not to be judicial officers to send recalcitrant witnesses to jail.\r\n\n\n<p>The appellant made an application for confirmation of an order made by the Cape of Good Hope High Court on the constitutional invalidity of section 66(3) of the Insolvency Act 24 of 1936 which authorized a person presiding over a creditors' meeting to imprison an unruly witness. The issue before the court was whether a presiding officer who was not a magistrate should have the power to commit to prison a recalcitrant witness as provided for in section 66(3) of the Insolvency Act. The Court decided that the High Court order was only confirmed to the extent that section 66(3) of the Insolvency Act was unconstitutional in so far as it authorized a presiding officer who was not a magistrate to commit a disobedinet witness to prison. As such, the provisions of section 66(3) were only unconstitutional were they empowered a presiding officer who was not a magistrate to commit an uncooperative witness to imprisonment as these were the powers of judicial officers. The court ruled that only judicial officers may, consistent with the proper separation of government powers, commit recalcitrant witnesses to prison. The court said that the power to commit an uncooperative witness to prison was within the very core of constitutional judicial power and therefore could not be exercised by non-judicial officers. </p>",
      "snippet": "",
      "facts": "",
      "decision": "The court ruled in majority that considering that the first respondent was a magistrate, it was not unconstitutional for a magistrate to issue a warrant of committal under section 66(3). It ruled further that the order of invalidity made by the High Court was confirmed only to the extent that section 66(3), read with section 39(2) of the Insolvency Act  24 of 1936, was unconstitutional where it authorised a presiding officer who was not a magistrate to issue a warrant committing to prison a witness at a creditors meeting held under section 65 of the Insolvency Act. [Separation_of_powers]\n\n<p> The court held that section 66(3) was not inconsistent with any fair procedure right protected by <b>section 12(1) of the Constitution</b>. However, the court found that the committal provision of section 66(3), read with section 39(2) of the Insolvency Act, infringed <b>section 12(1)(b) of the 1996 Constitution</b> only to the extent that a person who is not a magistrate is authorised by the subsection to issue a warrant committing to prison an examinee at a creditors meeting held under section 65 of the Insolvency Act. </p> [sec_12]\n\n",
      "dissent": "In its dissent, the court disagreed with the majority court decision that section 66(3) of the Insolvency act would be invalid where it empowered a presiding officer who was not a magistrate to issue a warrant of committal to prison. It held further that an aggrieved party could approach the High Court and thus involve the judiciary for their dissatisfaction with the procedure or imprisonment. It held that section 66(3) Insolvency Act did not infringe the rule of law or the doctrine of separation of powers and  that it was not unconstitutional for an officer who was not a magistrate presiding over a creditors meeting to commit a recalcitrant witness to imprisonment.",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "SvDodo",
      "href": "http://www.saflii.org/za/cases/ZACC/2001/16.html",
      "title": "S v Dodo ",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2001-04-05T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "Separation_of_Powers"
      ],
      "justicesConcurring": "Ackermann J",
      "summary": "The applicants applied for confirmation of the constitutional invalidity of section 51(1) of the Criminal Law Amendment Act, 105 of 1997 by the Eastern Cape High Court under the provisions of <b>section 172(2) of the Constitution</b>. Challenge to section 51(1), read with section 51(3)(a) of the Criminal Law Amendment Act, obliged High Courts to sentence people convicted of certain serious offences to life imprisonment, unless substantial and compelling circumstances justified the imposition of a lesser sentence. The High Court declared the section to be constitutionally invalid on the basis that it was inconsistent with both <b>section 35(3)(c) of the Constitution</b> which made provisions for the right to be tried before an ordinary court as well as the constitutionally required separation of powers.\n<p>The applicants applied for confirmation of the constitutional invalidity of section 51(1) of the Criminal Law Amendment Act. The issue before the court was the constitutional validity of the provisions of section 51(1) of the Act which created an obligation for a High Court to sentence an accused person who was convicted of offences specified in the Act, to imprisonment for life unless, the court was satisfied that substantial and compelling circumstances existed which justified the imposition of a lesser sentence. The High Court declared the section in question to be constitutionally invalid, because it was inconsistent with <b>section 35(3)(c) of the Constitution</b>, which guaranteed every accused person a public trial before an ordinary court and was also inconsistent with the separation of powers required by the Constitution. It said that the legislature and the executive shared important interests in punishments imposed by courts and that punishment was not the exclusive discretion of the courts. The separation of powers is not inflexible, and an overlapping of functions was allowed. The court held further that there was no infringement of the separation of powers or of the rights contained in <b>section 35(3)(c) of the Constitution</b> and declined to confirm the order of invalidity by the High Court.</p>",
      "snippet": "",
      "facts": "",
      "decision": "The court in a unanimous decision decided that there was no infringement of the separation of powers or of the rights contained in <b>sections 12(1)(e)</b> and <b>35(3)(c) of the Constitution</b>. The order of invalidity by the High Court was therefore not confirmed. The court refused to confirm the declaration of unconstitutionality of section 51(1) of the Criminal Law Amendment Act. The matter was referred back to the Eastern Cape High Court to be dealt with in accordance with the decision of the Constitutional Court.\r\n",
      "dissent": "",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "FerreiravLevinNOandOthersVryenhoekandOthersvPowellNOandOthers",
      "href": "http://www.saflii.org/za/cases/ZACC/1995/13.html",
      "title": "Ferreira v Levin NO and Others; Vryenhoek and Others v Powell NO and Others ",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "1995-12-06T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_36"
      ],
      "justicesConcurring": "Ackerman J, Chaskalson P, Mahomed DP, Didcott J, Langa J, Madala J, Trengove AJ, Mokgoro J, O'Regan J, Sachs J, Kriegler J.",
      "summary": "It is important to note that the matter heard by the Constitutional Court in fact related to two matters (the Ferreira referral and the Vryenhoek referral) but as the issues raised were identical the Constitutional Court heard it together. The Constitutional Court only had to determine the constitutionality of certain provisions of s 417 of the Companies Act 61 of 1973, concerning the summoning of persons during the winding-up provisions of two companies. The facts relavnt to this matter is that in both matters the applicants were summoned for examination in terms of s 417 of the Companies Act 61 of 1973 in the winding-up process of two companies. In both cases the applicants objected to being compelled to answer questions put to them that might tend to incriminate them and they applied to the Witwatersrand Local Division of the Supreme Court for a temporary interdict against the respondents, prohibiting further interrogation pending the determination of the constitutionality of s 417(2)(b) of the Companies Act. The Witwatersrand Local Division of the Supreme Court also heard the two matters together and referred the constitutional challenge to the Constitutional Court.\n\n<p>The Constitutional Court essentially had to determine the constitutionality of certain provisions of s 417 of the Companies Act 61 of 1973, relating to the examination of persons in the winding-up process of companies. The applicants (as they were referred to in the two referral cases) objected to being compelled to answer questions put to them which might tend to incriminate them. The applicants held that any answer given might be used in evidence against them in subsequent criminal proceedings, infringing on their <b>section 25(3)</b> constitutional right to a fair criminal trial (in terms of the then Interim Constitution – similar provision in <b>section 35(1)(c) of the Constitution</b>). The applicants held that the right against self-incrimination is not limited to detained, arrested or accused persons (as per s 25 of the Interim Constitution) but also extends to “extra-curial proceedings” including proceedings in terms of s 417 of the Companies Act 61 of 1973. The infringement of various other constitutional rights including the right to freedom and security of the person and personal privacy in ss 11 and 13 of the Interim Constitution respectively were  also argued in the alternative.</p>\r\n\r\n<p>The majority judgment written by Ackerman J, held that in order to rely on s 25(3) of the Constitution there must “be an infringement or threat” to the right and the s 25(3) rights only accrue an “accused person” in a criminal trial. The threat only arises once a person who tendered evidence in a section 417 enquiry is accused in a criminal trial and that evidence tendered is specifically used.  Therefore s 417(2)(b) of the Companies Act 61 of 1973 was not held to constitute an infringement on any section 25(3) rights and the majority dismissed this challenge. Justice Ackerman then considered the alternative main argument that s 417 of the Companies Act 61 of 1973 infringed ss 11 and 13 of the Interim Constitution. On this analysis Ackerman J held that this analysis required two stages. One first has to determine whether there was   an infringement off ss 11 and 13 of the Constitution. If there was an infringement then one has to analyse whether this infringement may be justified under <b>s 33(1) of the Interim Constitution</b> (the limitation clause – now <b>section 36 of the Constitution</b>). On this analysis Ackerman J, held that s 417(2)(b) of the Companies Act unduly infringed on s 11(1) of the Interim Constitution and declared it invalid only to the extent that answers given at such an enquiry may be used against such a person in criminal proceedings against the person. </p>",
      "snippet": "",
      "facts": "",
      "decision": "It is firstly important to note that this matter was heard in terms of the Interim Constitution. <b>Section 36 of the Constitution</b> (the limitation of rights provision) was found in section 33 of the Interim Constitution. It is important to note that this judgment confirmed that the limitation of rights concerns two stages. The first stage involves a consideration of the scope of the constitutional right and the challenged law. Ackerman J writing for the majority analysed whether section 417(2)(b) of the Companies Act 633 of 1971 firstly limited <b>section 11(1) of the Interim Constitution</b>, relating to the right to freedom and security of the person. Ackerman J emphasised that a broad interpretation should be given at this stage of the entrenched right as the second stage of the limitation test involving <b>section 33(1) of the Interim Constitution</b> prescribes the criteria that has to be met before an entrenched right can be limited. Ackerman held that s 417(2)(b) limited <b>section 11(1) of the Interim Constitution</b> and then turned to the second stage of the limitation test. The second stage involved analysing whether this limitation could be justified as reasonable in a democratic society taking into account the prescribed factors in <b>section 33 (1) of the Interim Constitution</b>. Ackerman J, importantly emphasised in this matter that the onus is on the party relying on the legislation to justify the limitation in terms of <b>section 33(1) of the Interim Constitution</b> and not for the party challenging it. On applying the second stage of the limitation test, Ackerman J held that section 417(2)(b) unduly infringed on <b>section 11(1) of the Interim Constitution</b>.",
      "dissent": "The dissenting judgment was written by Kriegler J. Although Kriegler J agreed with the majority judgments that the rights in terms of <b>section 25(3) of the Interim Constitution</b> does not extend to witnesses at a section 417 enquiry, he disagreed that <b>section 11(1) of the Interim Constitution</b> applied to this case. Kriegler J essentially raised concerns on the timing of the matter and held that access to the Constitutional Court in terms of section 100(2) of the Constitution and Rule 17 of the Constitutional Rules was not justified by the applicants. The applicants only had a “hypothetical fears” that the evidence given at such an enquiry may be used in a subsequent criminal proceeding. The matter would only have been ripe in the event that the applicants were challenged at a criminal trial with the evidence they have given and then only could they have resorted to their <b>section 25(3)</b> constitutional rights.",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "DanielsvScribanteandAnother",
      "href": "\nhttp://www.saflii.org/za/cases/ZACC/2020/12.html",
      "title": "Daniels v Scribante and Another",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2017-05-11T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_8"
      ],
      "justicesConcurring": "Mogoeng CJ, Moseneke DCJ, Bosielo J, Cameron J, Froneman J, Jafta J, Khampepe J, Madlanga J, Mhlantla J, Nkabinde J, and Zondo J. ",
      "summary": "The applicant resided as an Extension of Security of Tenure Act resident on a farm owned by the second respondents. The dwelling is which she lived in required improvements which would make it fit for human living. The applicant decided to carry out improvements which she would personally pay for. \n\n<p>The lawyer for the applicant sent a letter to the first respondent informing him of the applicant’s intent to make improvements to the dwelling. The first respondent responded by sending a letter that refused to give the applicant permission to make the improvements.</p>\n\n<p>The applicant then approached the court seeking a declarator that she was allowed to make improvements to her dwelling without the owner’s permission.</p>\n\n<p>The applicant resided as an Extension of Security of Tenure Act resident on a farm owned by the second respondents. The dwelling is which she lived in required improvements which would make it fit for human living. The applicant decided to carry out improvements which she would personally pay for.</p> \n\n<p>The lawyer for the applicant sent a letter to the first respondent informing him of the applicant’s intent to make improvements to the dwelling. The first respondent responded by sending a letter that refused to give the applicant permission to make the improvements.</p>\n\n<p>The main question was whether the Extension of Security of Tenure Act afforded residents the right to make improvements to their dwelling without the owner’s permission. </p>\n\n<p>The court disagreed with the Magistrate’s Court and the Land Claims Court view that the Extension of Security of Tenure Act did not afford residents the right to make improvements. The court decided that taking into account the purpose of Act as well as the fact that the improvements were basic amenities the applicant was allowed  to make the improvements without the owner’s permission.</p>",
      "snippet": "",
      "facts": "",
      "decision": "<p>While <b>section 8(2) of the Constitution</b> holds that the Bill of Rights can be enforced against individuals this section does not impose a positive obligation on private individuals.</p>\n\n<p>However, in this case <b>section 8(2)</b> was found to impose a positive duty on a private individual, the farm owner because the right of the applicant to live in a house with basic amenities was an important right.</p> \n\n<p>The court acknowledged that the duty imposed on the owner to make improvements was a heavy one because they might have had to compensate the applicant for the improvements.</p>\n\n<p>The two parties had not had meaningful engagement so the court ordered them to engage regarding the improvements to be made.</p>",
      "dissent": "",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "MinisterofFinanceandOthervVanHeerden",
      "href": "\nhttp://www.saflii.org/za/cases/ZACC/2004/3.html ",
      "title": "\nMinister of Finance and Other v Van Heerden",
      "featured": false,
      "highlighted": true,
      "dateOfJudgment": "2004-07-29T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_9"
      ],
      "justicesConcurring": "Moseneke J",
      "summary": "<p>The applicants made an application for leave to appeal against High Court decision. The matter concerned a challenge to the constitutionality of rules of the Political Office-Bearers Pension Fund, rule 4.2.1 which provided for differentiated employer contributions in respect of members of Parliament and other political office-bearers. The respondent argued that the differentiation in the employer contributions laid down by Rule 4.2.1 was arbitrary, unreasonable, unfairly discriminatory and as such unconstitutional. The applicants defended the measures on the grounds that they constituted limited affirmative action. The High Court stated that anyone who relied on <b>section 9(2) of the Constitution</b> to justify discriminatory measures had the responsibility to establish on a balance of probabilities that the measures have been taken to promote the achievement of equality.</p>\n\n<p>The applicants made an application for leave to appeal against High Court decision declaring Rule 4.2.1 of the Political Office-Bearers Pension Fund unconstitutional. The rules of the Pension Fund provided for differentiated employer contributions in respect of members of Parliament and other political office-bearers. The respondent argued that the rules were unfairly discriminatory and that the pension fund was not validly established under <b>section 219 of the Constitution</b>. Applicant contended that the rules were an acceptable affirmative action measure. </p>\n\n<p>The High Court then found that the Minister and the pension fund had failed to prove that the rules were an acceptable affirmative action measure and held that rule 4.2.1 was not a measure designed to advance a previously disadvantaged group therefore it amounted to unfair discrimination. The issue before the court was whether the High Court misconceived the true nature of the equality protection recognised by the Constitution. The applicants argued that the purpose of the differentiated scheme of employer benefits was to advance equality. The court found that legislative and other measures that properly fell within the requirements of <b>section 9(2)</b> were not presumably unfair. The court also found that the differentiation aimed at protecting or advancing persons disadvantaged by unfair discrimination was necessary provided the measures followed the internal test set by <b>section 9(2)</b>. The court decided that the order of the High Court declaring Rule 4.2.1 unconstitutional and invalid must be set aside.</p>\n",
      "snippet": "",
      "facts": "",
      "decision": "The court in a unanimous decision, held that leave to appeal was to be granted; that the appeal was to be upheld and that the order of the High Court declaring Rule 4.2.1 unconstitutional and invalid to be set aside. The court held further that if a restoration measure, even based on any of the grounds of discrimination listed under <b>section 9(3)</b>, passed under <b>section 9(2) of the Constitution</b>, it could not be presumed to be unfairly discriminatory. The disputed pension contribution scheme passed as a restorative measure as it was directed at achieving equality between old and new parliamentarians whom the vast majority have been disadvantaged by past unfair discrimination and exclusion. The court held that the measure was not unfairly discriminatory.\n",
      "dissent": "",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "LesbianandGayEqualityProjectandEighteenOthersvMinisterofHomeAffairsandOthers",
      "href": "http://www.saflii.org/za/cases/ZACC/2005/20.html",
      "title": "\nLesbian and Gay Equality Project and Eighteen Others v Minister of Home Affairs and Others",
      "featured": true,
      "highlighted": false,
      "dateOfJudgment": "2005-12-01T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_9"
      ],
      "justicesConcurring": "Sachs J",
      "summary": "The applicants appealed against the decision of the Supreme Court of Appeal and the respondents pursued leave to cross-appeal against the Supreme Court of Appeal judgment. The applicants complaints argued that the law excluded them from publicly celebrating their love and commitment to each other in marriage. They maintained that the exclusion came from the common law definition which stated that marriage in South Africa was a union of one man with one woman, to the exclusion of all others, while it lasted. In the second case, the Equality Project case the Gay and Lesbian Equality Project challenged section 30(1) of the Marriage Act, which made reference to wife or husband and they argued that it was unconstitutional as it excluded same-sex couples.\n\n<p>The applicants argued that the law excluded them from publicly celebrating their love and commitment to each other in marriage as the common law definition stated that marriage in South Africa was a union of one man with one woman, to the exclusion of all others, while it lasted. The Gay and Lesbian Equality Project challenged section 30(1) of the Marriage Act, which made reference to wife or husband and they argued that it was unconstitutional as it excluded same-sex couples. The issue before the court was whether the fact that no provision was made for the applicants, and all those in a similar situation, to marry each other, amounted to denial of equal protection of the law and unfair discrimination by the state against them because of their sexual orientation which was contrary to the provisions of the Constitution guaranteeing the right to equality in terms of <b>section 9</b>.</p>\n\n<p>The Constitutional Court set aside the order of the Supreme Court of Appeal and held that the common law definition of marriage was to be declared inconsistent with the Constitution and invalid to the extent that it did not permit same-sex couples to enjoy the status and the benefits coupled with responsibilities it accorded to heterosexual couples. It held further that the provisions of section 30(1) of the Marriage Act were inconsistent with the Constitution, and the Marriage Act is declared to be invalid to the extent of this inconsistency.</p>\n",
      "snippet": "",
      "facts": "",
      "decision": "The court in a unanimous decision held that South Africa had a multitude of family formations that evolve rapidly as society develops. As such it was inappropriate to entrench any particular form of family as the only socially and legally acceptable one. The court set aside the order of the Supreme Court of Appeal and held that the common law definition of marriage was to be declared inconsistent with the Constitution and invalid to the extent that it did not permit same-sex couples to enjoy the status and the benefits coupled with responsibilities it accords to heterosexual couples.",
      "dissent": "O'Regan J agreed with the finding of unconstitutionality of the Marriage Act but held that the Constitutional Court should develop the common law and at the same time read in words to section 30 (1) of the Act,  which permitted same sex couples to marry with immediate effect.\n",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "NationalCoalitionforGayandLesbianEqualityandAnothervMinisterofJusticeandOthers",
      "href": "http://www.saflii.org/za/cases/ZACC/1998/15.html",
      "title": "National Coalition for Gay and Lesbian Equality and Another v Minister of Justice and Others",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "1998-10-09T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_9"
      ],
      "justicesConcurring": "Ackermann J",
      "summary": "The applicants made an application for the confirmation of an order of the High Court declaring the constitutional invalidity of section 20A of the Sexual Offences Act, 1957 which included sodomy as an item in Schedule 1 of the Criminal Procedure Act 51 of 1977 which prohibited sexual conduct between men in certain circumstances as well as the inclusion of sodomy as an item in the Schedule to the Security Officers Act 92 of 1987. \n\n<p>The applicants made an application for the confirmation of an order of the High Court declaring the constitutional invalidity of the common law offence of sodomy, the inclusion of sodomy in schedules to certain Acts of Parliament, and a section of the Sexual Offences Act which prohibits sexual conduct between men in certain circumstances. The court had to determine whether the common law crime of sodomy unfairly discriminated against gay people on the grounds of sexual orientation. The court held that gay people were a vulnerable minority group in society. Sodomy laws criminalized their most intimate relationships and this devalued and degraded gay men and therefore constituted a violation of their fundamental right to dignity. The court said fact that the offences, which were at the center of the discrimination, also violated the rights to privacy and dignity strengthened the conclusion that the discrimination against gay men was unfair and such inconsistent with <b>section 9 of the Constitution</b>. The court held that the offences were all aimed at prohibiting sexual intimacy between gay men and violated their right to equality provided for in <b>section 9 of the Constitution</b> in that they unfairly discriminated against gay men on the basis of sexual orientation. Such discrimination was presumed to be unfair since the Constitution expressly included sexual orientation as a prohibited ground of discrimination.</p>\n\n",
      "snippet": "",
      "facts": "",
      "decision": "The court in a unanimous decision held that there was no legitimate reason as to why the rights of gay men should be limited. The court concluded that the common law offence of sodomy, its inclusion in certain statutory schedules, and the relevant section of the Sexual Offenses Act were not reasonable or justifiable limitations on the rights of gay men to equality, dignity and privacy. The offences were accordingly found to be unconstitutional and invalid. \n",
      "dissent": "In a separate concurring judgement, Sachs J, held that the scope of what is constitutionally normal had expanded and included the widest range of perspectives to acknowledge, accommodate and accept the largest spread of difference. The decision of the court should thus be seen as part of a growing acceptance of difference in an increasingly open and pluralistic South Africa.",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "CentreForChildLawandOthersvMediaLimitedandOthers",
      "href": "http://www.saflii.org/za/cases/ZACC/2019/46.html ",
      "title": "Centre For Child Law and Others v Media 24 Limited and Others\n",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2019-12-04T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_10"
      ],
      "justicesConcurring": "Mhantla J",
      "summary": "The SCA had declared section 154(3) of the Criminal Procedure Act unconstitutional and invalid to the extent that the provision did not protect the identity of child victims in criminal proceedings. The applicants requested a declaration that section 154(3) should protect the anonymity of child victims of crime when properly interpreted. In 1997, the second applicant, was taken from her biological parents whilst in the maternity ward at a hospital. In 2015 when the applicant was 17 years old, she was found by her biological parents. Her abductor was criminally charged and prosecuted, and the applicant was a potential, witness in the trial. The trial was scheduled to begin after applicant’s 18th birthday. Concerned by the media attention, the second applicant approached the first applicant, the Centre for Child Law, for legal support. The Centre for Child Law wrote to all major media houses and requested that they don’t reveal the first applicant’s identity.\n\n\n<p>The applicants requested a declaration that section 154(3) should protect the anonymity of child victims of crime when properly interpreted. The media respondents asserted that the two extensions of section 154(3) are constitutionally impermissible, as they are in conflict with the rights to freedom of expression and the principle of open justice. The issue before the court was that section 154(3) expressly provided anonymity protection for child accused or witnesses in criminal proceedings, however, the protection did not extend to child victims. The court also had to determine whether the protection afforded by section 154(3) should extend into adulthood for child accused, witnesses and victims.</p>\n\n<p>The court held that the predominant purpose of section 154(3) of the Criminal Procedure Act was child protection. Protection from the potentially harmful effects of the publication of their names and identities as a result of being implicated in criminal proceedings. Since this protection is only afforded to child accused and witnesses, there was a gap in the law as it pertained to protecting child victims in criminal proceedings. The court held that the exclusion of child victims in section 154(3) limited the right to equality, as it constituted a one-sided differentiation that did not offer equal protection and benefit of the law. The court found that rights of children, their dignity and privacy were inherently linked, as each child had their own “individual dignity, special needs and interests”. To not have control over how some of the most traumatic and intimate moments of a child’s life are shared with the public attacked the very core of the child’s dignity.</p>",
      "snippet": "",
      "facts": "",
      "decision": "The court found that the right to dignity limited the reach of the right to freedom of expression, which is guaranteed by <b>section 16 of the Constitution</b> and included <b>the right of the media to publish information</b>. The right to publish information was not to be used to justify the breach of the right to dignity. The court found that limitations arising from a failure to provide ongoing protection were not justified. The purpose of freedom of expression and open justice were compelling, but when it came to the balancing of these competing rights, the best interests of children, the right to dignity and privacy outweighed the barrier to the principle of open justice. The serious harms caused to child participants, overshadow the minimal harm to open justice. The granting of the default ongoing protection would not present a harsh interference into media freedom. ",
      "dissent": "Cameron J, Froneman J and Jafta J agreed with the majority decision on the issue of victim protection but differed on the issue relating to ongoing protection. The court held that the right to freedom of expression and the principle of open justice tipped the scales in favour of a default regime in which anonymity protection ended when a child participant reaches 18 years, unless a court expressly extends the protection. The dissenting Justices held further that the conclusion that the rights to dignity, privacy and the best interests of the child were infringed was hard to understand in the context of the ongoing protection. This was because the issue was that section 154(3) failed to protect children when they turn 18 years of age hence the fear that the media were going to publish the first applicant’s identity when she turned 18. Otherwise before that she had been adequately protected by the section.",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "UnionofRefugeeWomenandOthersvDirectorPrivateSecurityIndustryRegulatoryAuthorityandOthers",
      "href": "\nhttp://www.saflii.org/za/cases/ZACC/2006/23.html",
      "title": "\nUnion of Refugee Women and Others v Director, Private Security Industry Regulatory Authority and Others",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2006-06-12T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_12"
      ],
      "justicesConcurring": "Kondile AJ",
      "summary": "The applicants made an application regarding the rights of refugees to work in the private security industry in South Africa. The Private Security Industry Regulation Act 56 of 2001 required security service providers to register with the Private Security Industry Regulatory Authority. Section 23(1)(a) of the Security Act listed citizenship or permanent residence as a requirement for registration. Despite the provisions of section 23(1)(a), section 23(6) granted the Authority the decision to register any applicant as a security service provider, on good cause shown and on grounds which are not in conflict with the purpose of the Security Act and the objects of the Authority. The applicants challenged section 23(1)(a) on the basis that it constituted a violation of the right to equality and discriminated against them on the basis that they are not citizens or permanent residents. All of the respondents opposed the application. \n\n<p>The Private Security Industry Regulation Act 56 of 2001 required security service providers to register with the Private Security Industry Regulatory Authority. Section 23(1)(a) of the Security Act listed citizenship or permanent residence as a requirement for registration. The applicants argued that section 23(1)(a) was unconstitutional on the basis that it constituted a violation of the right to equality and discriminated against them on the basis that they are not citizens or permanent residents. The issue before the court was whether the provision of the Security Act to the extent it excluded refugees from its scope was unconstitutional.</p>\n\n<p>The court held that while refugees were fully entitled to work in South Africa, <b>section 22 of the Constitution</b> limited the right to choose a job to citizens only. The right to equality was held not to be violated by section 23 of the Security Act. The court held that the private security industry was a special environment and at stake was the safety and security of the public at large. <b>Section 12 of the Constitution</b> provides everyone the right to freedom and security of the person, which included the right to be free from all forms of violence from either public or private sources. In a society damaged by violent crime, the importance of protecting this right could not be exaggerated.</p>\n",
      "snippet": "",
      "facts": "",
      "decision": "The court held that the regulatory scheme was carefully designed for the purpose of screening entrants to the private security industry rather than constituting a blanket ban on the registration of refugees as private security service providers. <b>Section 12 of the Constitution</b> provides everyone the right to freedom and security of the person, which included the right to be free from all forms of violence from either public or private sources. That is not to say that foreign nationals, including refugees, are inherently less trustworthy than South Africans. In a country where xenophobia has caused increased suffering, it is important to stress this and that it was not that the Authority did not trust refugees. The Security Act was designed to limit eligibility for registration to people whose trustworthiness could be objectively verified. The preamble to the Act acknowledges that the right to security of the person is fundamental to the well-being and to the social and economic development of every person.\n",
      "dissent": "In their dissenting judgement, Mokgoro J and O'Regan J held that section 23(1)(a) of the Private Security Industry Regulation Act discriminated unfairly on the basis of refugee status. The court was not convinced that the purpose identified by the Minister to ensure that security service employees were trustworthy was really provided by the section. The dissenting judgment held that the order it would have proposed was to require that refugees who could meet the other requirements of the Act should not be barred from registration as security service providers. Those refugees who cannot meet those requirements should seek to establish that “good cause” exists for them to be registered as contemplated by section 23(6).\n",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "NMandOthersvSmithandOthersZACCSACCBCLRCC",
      "href": "\nhttp://www.saflii.org/za/cases/ZACC/2007/6.html",
      "title": "\nNM and Others v Smith and Others [2007] ZACC 6; 2007 (5) SA 250 (CC); 2007 (7) BCLR 751 (CC)",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2007-04-04T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_14"
      ],
      "justicesConcurring": "\nMadala J, Moseneke DCJ, Mokgoro J, Skweyiya J, Van der Westhuizen J, Yacoob J, Sachs J, Langa J and O’Regan J.",
      "summary": "The applicants who were HIV positive were involved in clinical trials. During these clinical trials, they raised concerns about the illnesses and fatalities amongst the patients. One of the concerns raised was that the consent forms for their trials were not explained to them. The second respondent was appointed to investigate the applicants' allegations. The second respondent then appointed a third party to conduct the investigation. The third-party issued a report that contained the names of the applicant but this report was sent to a few people. The first respondent was approached by the third respondent who wanted to write a biography about the second respondent. The published biography revealed the names and HIV status of the applicants.\n\n<p>The applicants who were HIV positive were involved in clinical trials. During these clinical trials, they raised concerns about the illnesses and fatalities amongst the patients. One of the concerns raised was that the consent forms for their trials were not explained to them. The second respondent was appointed to investigate the applicants' allegations. The second respondent then appointed a third party to conduct the investigation. The third-party issued a report that contained the names of the applicant but this report was sent to a few people. The first respondent was approached by the third respondent who wanted to write a biography about the second respondent. The published biography revealed the names and HIV status of the applicants.</p>\n\n<p>The applicants asked the respondents to remove their names from the book, but the respondents refused to do so.</p>\n\n<p>The issue was whetther the respondent had violated the applicants' right to privacy under <b>section 14 of the Constitution</b> when they published the HIV statuses of the applicants in the biography. The second issue was the balancing act between the right to privacy and freedom of speech.</p>\n\n<p>The court when giving out its judgement mentioned that the respondents knew that the applicants had not given consent to have their HIV status published but they had gone ahead and published their names. This violated the applicants' <b>rights to privacy and dignity</b>.</p>\n<p>The respondents could have used pseudonyms to protect the identity of the applicants. The applicants were found to have infringed on the applicants' rights to privacy and dignity and ordered to pay damages to the applicants.</p>\n",
      "snippet": "",
      "facts": "",
      "decision": "<b>The right to privacy</b> is one that cannot be interfered with unless there is a social need that allows a person’s <b>right to privacy</b> to be violated. \n<p>There was no public interest that justified the violation of the applicant’s right to privacy in this case. \nThe respondents did not establish if consent had been given by the applicants despite them having time to do so.</p>\n<p>The respondents could have used pseudonyms which would not have taken away fro the authenticity of the book. The need for access to medical information was not sufficient to breach the applicants' <b>right to privacy</b>. There needs to be a very good reason for the public to want to be informed.</p>\n",
      "dissent": "\nMadala J (Moseneke DCJ, Mokgoro J, Skweyiya J, Van der Westhuizen J and Yacoob J concurring) decided that the respondents were aware that the applicants had not given their consent but still went ahead and published their names, violating their <b>rights to privacy and dignity</b>.\n\n<p>Sachs J  concurring decided that even though the respondents believed that the applicants had placed their medical status in the public domain, the sensitive nature of the information meant that the respondents had to take more care in verifying this belief.</p>\n \n<p>Langa CJ concurred with the two judgments above but disagreed that the respondents had a further duty to verify the information and ensure that the applicants had consented.</p>\n\n<p>O’Regan J disagreed with the above judgments. He agreed that there was limited consent but found that imposing an additional duty on the respondents to ensure that the applicants had consented to the original publication of their names would impose on the respondents' right to freedom of expression.</p>\n\n\n",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "MinisterofJusticeandConstitutionalDevelopmentandOthersvPrinceClarkeandOthersInterveningNationalDirectorofPublicProsecutionsandOthersvRubinNationalDirectorofPublicProsecutionsandOthersvActon",
      "href": "\nhttp://www.saflii.org/za/cases/ZACC/2018/30.html",
      "title": "Minister of Justice and Constitutional Development and Others v Prince (Clarke and Others Intervening); National Director of Public Prosecutions and Others v Rubin; National Director of Public Prosecutions and Others v Acton ",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2018-09-18T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_14"
      ],
      "justicesConcurring": "\nZondo ACJ, Cameron J, Froneman J, Jafta J, Kathree Setiloane AJ, Kollapen AJ, Madlanga J, Mhlantla J, Theron J, and Zondi AJ.",
      "summary": "Three different High Court cases were heard as one case because they were all dealing with the same matter. The three cases argued that certain sections of the Drugs and Drug Trafficking Act (Drugs Act)  and the Medicines and Related Substances  Control Act were unconstitutional.\n\n<p>The High Court declared certain sections of the above Acts to be unconstitutional and the State appealed this decision to the present court. </p>\n\n<p>Three different High Court cases were heard as one case because they were all dealing with the same matter. The three cases argued that certain sections of the Drugs and Drug Trafficking Act (Drugs Act)  and the Medicines and Related Substances Control Act (Medicines Act)  were unconstitutional.</p>\n\n<p>The issues before the court were whether:</p>\n\n<p>1. Section 4(b) of the Drugs Act which prohibited the use or possession of any dangerous dependence producing substances; \n2. Section 5(b) of the Drugs Act which prohibited dealing in dangerous dependence producing substances;\n3. Section 22A(9)(a)(i) read with Schedule 7 of the Medicines Act that prohibited acquiring, using, possessing, manufacturing, or supplying cannabis;\n4. Section 22A(10) of the Medicines Act which prohibited the sale or administration of cannabis except for medical purposes were unconstitutional.</p>\n\n<p>The court decided that s 4(b) and 5(b) of the Drugs Act together with Part III of Schedule 2 of the Drugs Act and ss 22A(9)(a)(i) and 22A(10) of the Medicines Act together with Schedule 7 of the Medicines Act were unconstitutional because they violated <b>section 14 of the Constitution</b>.</p> \n<p>The sections were found to violate the right of privacy to extent that they prohibited the use, possession, and cultivation of cannabis in a private dwelling personal consumption.</p>\n\n<p>The appeal by the state was dismissed.</p>\n\n",
      "snippet": "",
      "facts": "",
      "decision": "The <b>right to privacy</b> entitles an adult to cultivate or possess cannabis in private for their personal consumption and the above sections infringed on this right. That the above sections were an unjustifiable limitation on the right to privacy. The <b>right to privacy</b> was not limited to a home or dwelling because there are other places other than a person’s home or dwelling where prohibiting the use or possession of cannabis would infringe on the person’s <b>right to privacy</b>.\n",
      "dissent": "",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "FreedomofReligionSouthAfricavMinisterofJusticeandConstitutionalDevelopmentandOthers",
      "href": "\nhttp://www.saflii.org/za/cases/ZACC/2019/34.html",
      "title": "Freedom of Religion South Africa v Minister of Justice and Constitutional Development and Others",
      "featured": false,
      "highlighted": true,
      "dateOfJudgment": "2019-09-18T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_15"
      ],
      "justicesConcurring": "\nMogoeng CJ, Basson AJ, Cameron J, Dlodlo AJ, Froneman J, Goliath AJ, Khampepe J, Mhlantla J, Petse AJ, and Theron J",
      "summary": "A father was accused of abusing his son and he was convicted of common assault despite him raising the defence of reasonable and moderate chastisement of a child. He then appealed this decision to the High Court. The High Court dismissed the father’s claim and ruled that the defence of moderate and reasonable chastisement of a child was unconstitutional based on age, equal protection of the law, dignity, freedom from all forms of violence and degradation, and bodily and psychological integrity. \n\n<p>The applicant then applied to the Constitutional Court to challenge the decision of the High Court because it said that the decision limited its right to religious freedom as provided by <b>section 15 of the Constitution</b>.</p>\n\n<b>The issue before the court was whether the High Court’s ruling that the defence of reasonable chastisement was unconstitutional was correct.</p>\n\n<p>The court agreed with the stance taken by the High Court and decided that children could be disciplined without having to use moderate and reasonable chastisement. There were less restrictive means available to discipline children. The court held that moderate and reasonable chastisement was indeed unconstitutional as it violated <b>sections 10, 12(1)(c) and 28(2) of the Constitution</b>.</p>\n\n\n",
      "snippet": "",
      "facts": "",
      "decision": "<p>Unlike the constitutional protection available to children, the right to freedom of religion does not entitle a parent to moderately and reasonably chastise a child. The Constitution does not acknowledge a cultural right that entitles a parent to moderately and reasonably chastise their child. </p>\n<p>The court held that there are less restrive means to enforce discipline in children. The limitation of the rights to practice their religion in moderate and reasonable chastisement was justifiable in light of the rights of the child that it violated.</p>\n",
      "dissent": "",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "ChristianEducationSouthAfricavMinisterofEducation",
      "href": "http://www.saflii.org/za/cases/ZACC/2000/11.html",
      "title": "Christian Education South Africa v Minister of Education",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2000-08-18T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_15"
      ],
      "justicesConcurring": "Sachs J",
      "summary": "The applicant brought an appeal before the Constitutional Court arguing that the South African Schools Act which prohibited corporal punishments in school violated the rights of parents and learners to freedom of religion. \n\n<p>The applicant further argued that the South African Schools act interfered with the right to participate in the cultural life of their choice, the right to enjoy their culture and practise their religion.</p>\n\n<p>The applicant in their argument stated that parents delegated the authority to discipline their children to the teachers and that this delegation was in accordance with their beliefs. The applicant argued that corporal punishment in schools was done biblically and that prohibiting corporate punishment was unconstitutional because it violated <b>section 15</b>.</p>\n\n<p>The question before the court was whether the South African Schools Act violated the rights of parents of children in independent schools who, in line with their religious convictions had consented to corporeal punishment.</p> \n\n<p>The court did find that the South African Schools Act in particular section 10 which prohibited corporate punishment was a reasonable and justifiable limitation of the parents' rights under <b>section 15</b>. This was because the state had to take steps to reduce violence in public and private life. The state also had a duty to protect children.</p>  \n\n<p>The court added that it would be difficult to monitor the administration of corporal punishment in schools and there was a possibility that teachers might act excessively.</p> \n\n",
      "snippet": "",
      "facts": "",
      "decision": "<p>Religious practises are based on faith and this is in contrast to public or private concerns which are evaluated according to their reasonableness.Believers cannot claim an automatic right to be exempted by their beliefs from the laws of the country. The state on the other hand cannot put believers in positions where they have to choose between their faith and obeying the rule of law.</p>\n\n<p>While parents may no longer authorise teachers to corporally punish their children, parents are not deprived of bringing up their children according to their Christian beliefs. The effect of the South African Schools Act was to disempower schools from delivering corporal punishment.</p>\n",
      "dissent": "",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "SouthAfricanBroadcastingCorporationLimitedvNationalDirectorofPublicProsecutionsandOthers",
      "href": "http://www.saflii.org/za/cases/ZACC/2006/15.html",
      "title": "South African Broadcasting Corporation Limited v National Director of Public Prosecutions and Others",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2006-09-21T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_16"
      ],
      "justicesConcurring": "Langa CJ, Kondile AJ, Madala J, Nkabinde J, O’Regan J, Van Heerden AJ,  Yacoob J, Sachs J  Moseneke DCJ and Mokgoro J",
      "summary": "The applicant was appealing a judgement made by the Supreme Court of Appeal where it was only granted permission to broadcast visuals of the respondents pending trial but without sound. The reasoning behind this decision was that the respondents' right to a fair trial was sufficient enough to justify the limitation of the applicant’s right to freedom of expression.\n\n<p>The issue before the Constitutional Court was whether the test applied by the Supreme Court of Appeal where broadcasting would not be permitted unless the Court was satisfied that justice for the respondents would not be affected limited <b>section 16</b>.</p>\n\n<p>The court agreed with the Supreme Court of Appeal and found that allowing the applicant to only broadcast visuals without sound was a limitation of the applicant’s <b>right to freedom of expression</b>. However, it was justifiable taking into context the importance of the respondents' <b>right to a fair trial</b>.</p> \n\n",
      "snippet": "",
      "facts": "",
      "decision": "<p>The refusal to allow the applicant to have sound recordings of the respondents' hearing affected the applicants' right to freedom of expression under <b>section 16 of the Constitution</b>. The public also has a fundamental constitutional right to freedom of expression and this encompasses the right to receive information and ideas.</p> \n<p>The public should as far as possible be informed of what goes on in the courts. The right to freedom of expression encompasses the right of the media to not only gather footage and deliver it to the public but to also broadcast that footage. </p>\n<p>However, in this particular case, the respondents' right to a fair trial as well as the impact of the broadcasting on witnesses was sufficient to justify the limitation of the <b>right to freedom of expression</b>.</p> \n",
      "dissent": "The majority judgement written by Langa CJ (Kondile Aj, Madala J, Nkabinde J, O’Regan J, Van Heerden AJ, and Yacoob J concurring) agreed with the approach taken by the Supreme Court of Appeal that the applicant only be granted visual rights without sound. \n\n<p>Sachs J concurred with the majority but for different reasons.</p>\n\n<p>Moseneke DCJ  (Mokgoro J concurring) dissented from the majority judgement. The test used by the Supreme Court in deciding not to allow the applicant to broadcast the sound of the proceedings put the <b>right to a fair trial</b> above that of <b>freedom of speech</b>. This was an inappropriate test because there must be no hierarchy of rights and this prejudiced the <b>right to freedom of expression</b>. Secondly, Moseneke DCJ found that by banning sound in the visuals to be aired by the applicant, the court had failed to consider if there were less restrictive means to protect the respondent’s <b>right to a fair trial</b>.</p>\n",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "PrintMediaSouthAfricaandAnothervMinisterofHomeAffairsandAnother",
      "href": "http://www.saflii.org/za/cases/ZACC/2012/22.html",
      "title": "Print Media South Africa and Another v Minister of Home Affairs and Another",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2012-09-28T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_16"
      ],
      "justicesConcurring": "Skweyiya J (Mogoeng CJ, Cameron J, Jafta J, Khampepe J, Nkabinde J, Maya AJ and Zondo AJ concurring)",
      "summary": "The High Court declared certain provisions in the Films and Publications Act (Act) unconstitutional.\n\n<p>After the Act was amended, it required publishers except for newspapers to submit for prior approval to an administrative body, publications that showed amongst other things sexual conduct that violated or disrespected the <b>right to human dignity</b>, was degrading or was an incitement to cause harm. </p>\n\n<p>Failure to submit this material to the administrative body before publication was a criminal offence.</p>\n\n<p>The question before the court was whether the provisions were in line with the Constitution and if they limited <b>section 16</b>, whether it was a justifiable limitation. </p>\n\n<p>The court found that the fact that there had to be administrative classification before publication limited a publisher's right to freedom of expression. This limitation was not justifiable because it did not achieve its intended purpose. The court also found that there were less restrictive means to achieve the purpose.</p>\n\n<p>The provision was found to be unconstitutional.</p>\n\n",
      "snippet": "",
      "facts": "",
      "decision": "The Act regulates freedom of expression in varying degrees. <b>Freedom of speech</b> unlike other rights does not require regulation to give it effect, relegating the right amounts to limiting it. The prior classification requirement set out by the Act limited the right. \n\n<p>Administrative prior classification before publication was a transfer of control from the publisher wanting to exercise the right to freedom of speech to the administrative body.</p>\n<p>The administrative body was now the decision-maker in respect of the <b>right to freedom of speech</b> of the publisher because the administrative body got to determine if expression should be made public and not the publisher. The provisions were declared unconstitutional. </p>\n",
      "dissent": "In the majority judgement written by Skweyiya J ( Mogoeng CJ, Cameron J, Jafta J, Khampepe J, Nkabinde J, Maya AJ, and Zondo AJ concurring), the court found that the requirement that publishers submit their work before publication was a limitation of the <b>right to freedom of expression</b>.\n\n<p>Van der Westhuizen J (Yacoob ADCJ and Froneman J concurring) agreed with the above judgement except for adding that the provision was constitutionally invalid because it embodied a system of prior restraint that was based on vague criteria.</p>",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "ChirwavTransnetLimitedandOthers",
      "href": "\nhttp://www.saflii.org/za/cases/ZACC/2007/23.html",
      "title": "Chirwa v Transnet Limited and Others",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2007-11-28T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_23"
      ],
      "justicesConcurring": "Skweyiya J , Moseneke DCJ, Madala J, Navsa AJ, Nkabinde J, Sachs J, Van  Der Westhuizen J, Ngcobo J, Langa CJ, Mokgoro J and O’Regan J",
      "summary": "The applicant, a public sector employee was dismissed from a state-owned company. After her dismissal, she referred the matter to the CCMA as an unfair dismissal. The CCMA failed to resolve the matter within the stipulated time of 30 days and recommended arbitration in terms of the Labour Relations Act. \n\n<p>The applicant did not follow this recommendation and instead approached the High Court to set aside the disciplinary hearing that resulted in her dismissal and reinstate her. The applicant argued that the reason for her approaching the High Court for relief was because she had two causes of action available to her. One flowing from the Labour Relations Act (LRA) and the other flowing from the Bill of Rights read together with the Promotion of Administrative Justice Act (PAJA).</p>\n\n<p>The question posed before the court was whether the High Court and the Labour Court both had jurisdiction regarding employment disputes.</p>\n\n<p><b>Section 23 of the LRA</b> provides that everyone has the <b>right to fair labour practices</b>. This was the section that the court relied on when issuing its judgement.</p> \n\n<p>Firstly the court found that the applicant was not afforded a choice of which court to bring her action. She was not be put in a preferential position because she was a public sector employee and could rely on PAJA.</p> \n\n<p>Secondly, the LRA gave remedies that the applicant should have relied on.  The applicant should have relied on those remedies first and if she was not satisfied, then she could have approached the High Court. The applicant's matter was dismissed. </p>\n\n",
      "snippet": "",
      "facts": "",
      "decision": "<b>Section 23</b> which the LRA was enacted to give effect to serves as the main guarantee for all employees. \n<p>All employees including public service employees, except those excluded by the Act, are covered by unfair dismissal provisions and dispute resolution mechanisms.</p>\n<p>The LRA does not differentiate between the state as an employer and any other employer. If the applicant wanted to rely on a constitutional issue, she must have first gone through the remedies provided for by the LRA before raising the issue in a different forum.</p>\n",
      "dissent": "Skweyiya J  ( Moseneke DCJ, Madala J, Navsa AJ, Nkabinde J, Sachs J and Van Der Westhuizen J concurring) found that the High Court did not have concurrent jurisdiction with the Labour Court because an applicant cannot have access to multiple forums to have their issue resolved. \n\n<p>Ngcobo J concurred with Skweyiya J and added that since the applicant had relied on a breach of the LRA, the Labour Court had exclusive jurisdiction to hear the matter.</p> \n\n<p>Langa CJ (O’Regan J and Mokgoro J concurring) agreed with the outcome but disagreed with the above judges' reasoning. He did not agree that the High Court did not have jurisdiction to hear the matter.</p>\n\n",
      "citedCases": [
        ""
      ]
    },
    {
      "id": "NationalUnionofMetalWorkersofSouthAfricavIntervalvePtyLtdandOthers",
      "href": "http://www.saflii.org/za/cases/ZACC/2014/35.html",
      "title": "National Union of Metal Workers of South Africa v Intervalve (Pty) Ltd and Others",
      "featured": false,
      "highlighted": false,
      "dateOfJudgment": "2014-12-12T00:00:00+00:00",
      "courtName": "Constitutional Court",
      "topics": [
        "sec_23"
      ],
      "justicesConcurring": "\nCameron J, Mogoeng CJ, Moseneke DCJ, Khampepe J, Leeuw AJ, Zondo J,  Nkabinde J, Froneman J, Jafta J, Madlanga J and Van Der Westhuizen J",
      "summary": "The applicant represented employees of the respondents who were dismissed after participating in a strike. The applicant sought to add new employers in its application in the Labour Court. The Labour Court allowed the addition but this addition was overturned in the Labour Appeal Court. The Labour Appeal Court found that the applicant had failed to refer the matter for conciliation first and as such the Labour Court had no jurisdiction to hear the matter. \n\n<p>The applicant represented employees of the respondents who were dismissed after participating in a strike. The applicant sought to add new employers in its application in the Labour Court. The Labour Court allowed the addition but this addition was overturned in the Labour Appeal Court. The Labour Appeal Court found that the applicant had failed to refer the matter for conciliation first and as such the Labour Court had no jurisdiction to hear the matter.Section 191 of the LRA provides that a dispute be referred for conciliation. The applicant had failed to refer the dispute for conciliation and also to join every party who was a respondent. </p>\n\n<p>The main question that the applicant brought was whether s 191 of the LRA could be interpreted given the object of <b>section 23 of the Constitution</b> which prevented unfair labour practices.</p> \n\n<p>The court dismissed the applicants' case because the applicant was aware of the law and procedures that it needed to follow and could not rely on <b>section 23</b> for its failure to do the right thing.</p>\n",
      "snippet": "",
      "facts": "",
      "decision": "<b>Section 23 of the Constitution</b> allows for the existence of trade unios and also prevents unfair labour practices.\n<p>However, trade unions who aware of the procedures that need to be followed in lodging a complaint and fail to do so cannot use <b>section 23</b>.</p>\n<p>The Labour Relations Act was enacted to give effect to <b>section 23</b> and therefore <b>section 23</b> cannot be used directly unless the Labour Relations Act is being challenged regarding its constitutionality.</p>\n",
      "dissent": "The majority judgement by Cameron J (Mogoeng CJ, Moseneke DCJ, Khampepe J, Leeuw AJ and Zondo J concurring) agreed with the Labour Appeal Court. \n\n<p>Nkabinde J ( Froneman J, Jafta J, Madlanga J and Van Der Westhuizen J concurring) found that there had been some compliance with the Labour Relations Act (LRA) when interpreted to give effect to fair labour practices and access to the courts. Strict compliance in some instances interferes with the purpose of the LRA.</p> ",
      "citedCases": [
        ""
      ]
    }
  ],
  "topics": [
    {
      "id": "sec_1__Republic_of_South_Africa",
      "title": "Section 1: Republic of South Africa",
      "content": "<b>Section one of the Constitution</b> provides the <em>founding values</em> on which the Republic of South Africa is founded on. It essentially <em>re-affirms</em> a new state order and confirms a  clear break-away from the apartheid State system characterised by unrestrained State power. It firstly confirms that the Republic of South Africa is “one, sovereign, democratic state”. This confirmation in itself is critical as South Africa was prior to 1994 divided into various homelands (Bantustans) of which Black South Africans were made citizens of. Section one furthermore confirms that the Republic of South Africa is founded on various founding values such as human dignity, non-racialism, supremacy of the Constitution and a multi-party system of democratic governance. \n<p>It is critical to note that an amendment to section one of the Constitution requires a high threshold. At least 75 per cent of the members of the National Assembly have to support the proposed amendment with a supporting vote of at least six  provinces in the National Council of Provinces. It is therefore always important to question whether any proposed amendment to the Constitution indirectly affects the founding values in section one of the Constitution. <p/>\n",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_1"
      ],
      "snippet": "<b>Section one of the Constitution</b> provides the <em>founding values</em> on which the Republic of South Africa is founded on. ",
      "cases": [
        "CertificationoftheConstitutionoftheRepublicofSouthAfrica",
        "NewNationMovementNPCandOthersvPresidentoftheRepublicofSouthAfricaandOthers"
      ]
    },
    {
      "id": "sec_2",
      "title": "Section 2",
      "content": "<b>Section 2 of the Constitution</b> provides that the Constitution is the “supreme law of the Republic; law or conduct inconsistent with it is invalid, and the obligations imposed by it must be fulfilled”. This section forms part of the founding provisions of South Africa’s new constitutional order and reaffirms a clear break away from the doctrine of Parliament sovereignty. \n<p>Under the doctrine of parliament sovereignty, Parliament had the power to make any law it wished and a Court could only declare the law invalid if there were procedural defects in the passing thereof. Under the apartheid state, acting under the doctrine of Parliament sovereignty, South Africa’s Parliament was not represented by all races. Legislation passed by Parliament therefore only advanced the interests of the white minority and trampled on the human rights of all other races. However, due to the doctrine of Parliament sovereignty the Courts were unable to declare an Act of Parliament invalid on the basis that it violated human rights and could only declare an Act invalid if there were procedural defects.</p>\n<p>Under the doctrine of constitutional supremacy, all laws have to comply with the Constitution and the entrenched Bill of Rights in the Constitution. The Courts are now in the position to declare legislation that unduly infringes on a right in the Bill of Rights invalid.</p>",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_2"
      ],
      "snippet": "<b>Section 2 of the Constitution</b> provides that the Constitution is the “supreme law of the Republic; law or conduct inconsistent with it is invalid, and the obligations imposed by it must be fulfilled”. ",
      "cases": []
    },
    {
      "id": "sec_3",
      "title": "Section 3",
      "content": "<b>Section 3 of the Constitution</b> stipulates that there is a common South African citizenship and that all citizens of South Africa are not only equally entitled to the rights, privileges and benefits of citizenship but are also equally subject to the duties and responsibilities of citizenship. The State is obliged to enact national legislation to define citizenship and the South African Citizenship Act 88 of 1995 provides for the acquisition, loss and resumption of South African citizenship.\n<p>The recognition of the right to citizenship as a founding provision in the Constitution must be understood in its historical context. Under the apartheid State, black South Africans were not recognised as citizens of South Africa and were made citizens of defined territories (known as Homelands) under the Bantu Homelands Citizenship Act 26 of 1970.  Under South Africa’s new constitutional dispensation, the right to citizenship in the Constitution is deeply couched on the recognition of equality. The right to citizenship allows a person to access various rights such as the right to political representation and freedom of movement. However it  is important to understand that the Constitutional Court has confirmed at various occasions that arbitrary distinctions between citizens and non-citizens are not consistent with the Constitution and the rights in the Bill of Rights are afforded to everyone, with certain exceptions.</p>\n",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_3"
      ],
      "snippet": "<b>Section 3 of the Constitution</b> stipulates that there is a common South African citizenship and that all citizens of South Africa are not only equally entitled to the rights, privileges and benefits of citizenship but are also equally subject to the duties and responsibilities of citizenship.",
      "cases": []
    },
    {
      "id": "sec_4",
      "title": "Section 4",
      "content": "<b>Section 4 of the Constitution</b> provides that the national anthem of the Republic of South Africa is determined by proclamation. Up until 1994, South Africa’s official national anthem was Die Stem van Suid-Afrika, which was based on a 1918 poem by CJ Langenhoven. In 1994, former President Nelson Mandela announced that in addition to Die Stem van Suid-Afrika, Nkosi Sikelel’ IAfrika would also be a national anthem. Nkosi Sikelel’ IAfrika was originally a church hymn but was later associated with the African National Congress and was regularly sung in defiance of the apartheid regime. In 1997, Former President Nelson Mandela proclaimed the new national anthem for the Republic of South Africa, which is a combined version of “Nkosi Sikelel iAfrika” and “Die Stem van Suid-Afrika” (“The Call of South Africa”).\n<p>The national anthem reflects a commitment to heal the divisions of the past as per the Preamble of the Constitution and reflects unity in diversity. </p>",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_4"
      ],
      "snippet": "<b>Section 4 of the Constitution</b> provides that the national anthem of the Republic of South Africa is determined by proclamation.",
      "cases": []
    },
    {
      "id": "sec_5",
      "title": "Section 5",
      "content": "<b>Section 5 of the Constitution</b> provides that the national flag of the Republic is black, gold, green, white, red and blue, as described and sketched in Schedule 1 to the Constitution. The national flag was designed by a former South African State Herald, Mr Fred Brownwell. The national flag was used for the first time on 27 April 1994 and the central design of the flag, the ‘V’ form flowing into a single horizontal band according to official the Government publications may be interpreted “as the convergence of diverse elements within South African society, taking the road ahead in unity”.",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_5"
      ],
      "snippet": "<b>Section 5 of the Constitution</b> provides that the national flag of the Republic is black, gold, green, white, red and blue, as described and sketched in Schedule 1 to the Constitution.",
      "cases": []
    },
    {
      "id": "sec_6",
      "title": "Section 6",
      "content": "<b>Section 6 of the Constitution</b> recognises that the official languages of the Republic are Sepedi, Sesotho, Setswana, siSwati, Tshivenda, Xitsonga, Afrikaans, English, isiNdebele, isiXhosa and isiZulu. This section further recognises the “historically diminished use and status of the indigenous languages” and obliges the State to take “practical and positive measures to elevate the status and advance the use of these languages”. National and provincial governments are furthermore obliged to regulate and monitor the use of official languages by legislative and other measures and all official languages must be treated equitably. \n<p>The Use of Official Languages Act 12 of 2012 has been specifically enacted to give effect to the constitutional obligations in terms of section 6 of the Constitution.</p>\n<p>Section 6 of the Constitution also obliges the creation of a Pan South African Language Board that has to promote and create conditions for the development and use of all official languages, the Khoi, Nama and San languages and sign language in specific. The recognition of the South African Sign Language (“SASL”) as the 12th official language has been a longstanding issue and in 2017, Parliament’s Joint Constitutional Review Committee recommended that SASL be recognised as the 12th official language which would require a constitutional amendment.</p> \n",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_6"
      ],
      "snippet": "<b>Section 6 of the Constitution</b> recognises that the official languages of the Republic are Sepedi, Sesotho, Setswana, siSwati, Tshivenda, Xitsonga, Afrikaans, English, isiNdebele, isiXhosa and isiZulu. ",
      "cases": []
    },
    {
      "id": "sec_7",
      "title": "Section 7",
      "content": "<b>Section 7 of the Constitution</b> provides that the Bill of Rights is a “cornerstone of democracy in South Africa”. Section 7 furthermore holds that the rights in the Bill of Rights “enshrines the rights of all people in our country and affirms the democratic values of human dignity, equality and freedom”.\n<p>The first recognition of the protection of human rights, the most fundamental rights inherent to every person, was found in the Interim Constitution and is a key development of the constitutional transformation South Africa followed after the dismantlement of apartheid laws. Chapter 2 of the Final Constitution (the Bill of Rights) reinforces the protection and fulfilment of human rights.</p>\n<p>The rights in the Bill of Rights may be limited in terms of the Constitutional test provided for in section 36 of the Constitution and some rights have internal qualifiers as well, such as the right to housing for instance. It is however important that any limitation of a right in the Bill of Rights be tested against the Constitution in order to be justified as a reasonable limitation. </p>",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_7"
      ],
      "snippet": "<b>Section 7 of the Constitution</b> provides that the Bill of Rights is a “cornerstone of democracy in South Africa”.",
      "cases": []
    },
    {
      "id": "sec_8",
      "title": "Section 8",
      "content": "<b>Section 8 of the Constitution</b> stipulates that the Bill of Rights, Chapter 2 of the Constitution, applies to all law and binds the legislature, the executive, the judiciary and all organs of state. Importantly the Bill of Rights not only applies to the State but also to natural or juristic persons, to the extent applicable considering the nature of the rights and the nature of the duty imposed. For instance, the State has to ensure that every citizen has the right to vote in the elections and this is a constitutional duty only the State can fulfil. The State may not deprive a citizen of this right. This form of application of the Bill of Rights is known as the vertical application of rights and this relationship relates more to protecting an individual against State power.\n<p>However, a constitutional right such as privacy can for instance be enforced between individuals and between individuals there is the duty to uphold this right equally. This form of application of the Bill of Rights is known as the horizontal application of the Bill of Rights.</p>",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_8"
      ],
      "snippet": "<b>Section 8 of the Constitution</b> stipulates that the Bill of Rights, Chapter 2 of the Constitution, applies to all law and binds the legislature, the executive, the judiciary and all organs of state.",
      "cases": []
    },
    {
      "id": "sec_9",
      "title": "Section 9",
      "content": "<b>Section 9 of the Constitution</b> protects the right to equality and it provides that everyone is entitled to equal protection and benefit of the law. Furthermore section 9 prohibits unfair discrimination based on certain listed characteristics such as race, sexual orientation and belief and the State is obliged to design measures to protect and advance certain categories of persons that have been previously disadvantaged.\n<p>It is important to note that the constitutional guarantee to the right to equality includes both formal and substantive equality. Essentially formal equality requires that individuals in the same circumstances must be treated alike. However identical treatment alone is not enough to achieve the goal of an equal society the Constitution envisions. It fails to take into account that social, economic and historical injustices impact individuals differently and measures attempting to advance equality should address these realities.</p> ",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_9"
      ],
      "snippet": "<b>Section 9 of the Constitution</b> protects the right to equality and it provides that everyone is entitled to equal protection and benefit of the law. ",
      "cases": []
    },
    {
      "id": "sec_24__Environment",
      "title": "Section 24: Environment",
      "content": "Section 24 of the Constitution confirms that everyone has a right to an environment that is not “harmful to their health or well-being” and places a positive obligation on the State to protect the environment for the benefit of future and present generations. The State is obliged to publish legislation and take other administrative steps to ensure it fulfils this duty and if the State fails an individual can evoke section 24 of the Constitution. It is imperative to note that this constitutional obligation not only applies to the State but action by companies and individuals can also be measured against this constitutional obligation. An important addition in the Final Constitution was ensuring the State secures ecological sustainable developments and the use of natural resources. ",
      "featured": false,
      "highlighted": true,
      "references": [
        "sec_24"
      ],
      "snippet": "",
      "cases": []
    },
    {
      "id": "sec_25__Property_Rights",
      "title": "Section 25: Property Rights",
      "content": "Section 25 of the Constitution, the property provision in the Bill of Rights has both protecting and reformative provisions and it is important to understand this balance. On the on hand the right protects existing property rights and on the other hand the right aims to correct historical injustices. Section 25(1) to (3) of the Constitution essentially provides protection against arbitrary deprivation of property and stipulates the requirements for expropriation. The protection of property against unconstitutional interreference is also directly reflected in international conventions, which South Africa has to adhere to such as the Universal Declaration of Human Rights. Section 25(4) to (9) of the Constitution can be described as the “reformative provisions” and obliges the State to take action to promote land and other reforms to ensure equitable access to South Africa’s natural resources. \r\nIn December 2019, the Ad Hoc Committee on the Amendment of Section 25 of the Constitution published the Constitution Eighteenth Amendment Bill, which aimed to amend section 25 of the Constitution to provide that where land and any other improvements are expropriated for the purpose of land reform, the amount of compensation may be nil. It is important to note that as the Bill relates to an amendment of a right in the Bill of Rights such an amendment can only pass with a supporting vote of at least two thirds of the members in the National Assembly and a supporting vote of at least six provinces in the National Council of Provinces.\r",
      "featured": true,
      "highlighted": false,
      "references": [
        "sec_25"
      ],
      "snippet": "",
      "cases": [
        "MkontwanavNelsonMandelaMetropolitanMunicipality",
        "PortElizabethMunicipalityvVariousOccupiers"
      ]
    },
    {
      "id": "sec_28__Children",
      "title": "Section 28: Children",
      "content": "Section 28 of the Constitution provides a range of rights to children, extending from the right to legal identity, such as the constitutional protection of a child’s right to a name and nationality to the right to parental care and the right to be protected from exploitative labour practices.\r\nThe constitutional rights extended to children specifically in terms of section 28 of the Constitution is in addition to any other constitutional rights in terms of the Bill of Rights where applicable. The purpose of section 28 of the Constitution is to specifically protect children in vulnerable situations. The State has a constitutional obligation to enact legislation providing more detail on the rights in terms of section 28 of the Constitution and the Children’s Act 38 of 2005 has been specifically enacted to give effect to these rights.\r\nThe “best interests of a Child” standard has been cemented in the Constitution and section 28(2) of the Constitution emphasises that- “A child’s best interests are of paramount importance in every matter concerning the child”. This standard provides that in a legal dispute concerning children for instance, the Court must focus on what would be best for the child in the circumstances before focusing on the rights and preferences of the parents.  The “best interests” standard also obliges the State to take action to ensure the necessary legal and administrative structures are in place to protect children.\r\n",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_28"
      ],
      "snippet": "",
      "cases": []
    },
    {
      "id": "sec_29__Education",
      "title": "Section 29: Education",
      "content": "<b>Section 29 of the Constitution</b> provides for education rights and it stipulates that everyone has the right to basic education and to “further education, which the state, through reasonable measures, must make progressively available and accessible.” Unlike other socio-economic rights in the Bill of Rights, the right to basic education is an absolute right and lack of resources cannot justify its constraint. With the right to further education, the State is not obliged to provide access to everyone immediately. The State is only obliged to take reasonable measures over time to provide access to such institutions.\n<p>As the right to basic education extends to “everyone” it is not only restricted to citizens and applies to non-citizens as well. Furthermore, the content of the right to basic education is not only restricted to access to available places at schools but includes teaching materials and ensuring the facilities are appropriate for learning.<p/>\n<p><b>Section 29(2)</b> also provides that where it is reasonably practicable the State is obliged to provide education in an official language of choice. This right is again restricted by internal qualifiers and has been the subject of many legal disputes. Lastly section 29(3) of the Constitution provides protection for the right to establish independent schools subject to the schools not discriminating on the basis of race, registering with the State and maintaining appropriate standards. Importantly the State is not obliged to make available resources to such schools as they operate at their own expense  and the State only has a negative duty not to interfere with such schools.</p>\n",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_29"
      ],
      "snippet": "",
      "cases": [
        "ABandAnothervPridwinPreparatorySchoolandOthersZACC",
        "AfriForumandAnothervUniversityoftheFreeState"
      ]
    },
    {
      "id": "sec_30__Language_and_Culture",
      "title": "Section 30: Language and Culture",
      "content": "<b>Section 30 of the Constitution</b> affords protection to the right to use one’s own language and to participate in the cultural life of one’s choice. It is however on the condition that these rights may not be exercised in a manner that is inconsistent with other fundamental human rights guaranteed in the Bill of Rights. For instance, the right to exercise a cultural practice must be consistent with an individual’s right to dignity and freedom and security of the person. If the right is practised in a manner that endangers a person’s life then it is inconsistent with the constitutional protection afforded in terms of section 30 of the Constitution and the State will have to intervene to protect the individual.\n<p>Section 30 of the Constitution is one of various provisions in the Constitution affording protection to ethnic, religious and linguistic groups in South Africa and also reflects international law commitments to provide protection to such groups.</p>",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_30"
      ],
      "snippet": "",
      "cases": []
    },
    {
      "id": "sec_31",
      "title": "Section 31",
      "content": "<b>Section 31 of the Constitution</b> affords protection to cultural, religious or linguistic communities. Persons belonging to such groups may not be denied the right to enjoy their culture, practise their religion and use their language. The State may also not interfere with the rights of persons belonging to such groups to form and maintain cultural, religious and linguistic associations. It is important to note that these rights may not be exercised in a manner inconsistent with any provisions of the Bill of Rights. For instance, if a religious practice by a community harms an individual’s life then section 31 of the Constitution cannot be relied on as the individual’s right to freedom and security of the person is endangered.\r\n<p>It is also important to note that section 31 of the Constitution protects both the religious, cultural and linguistic interests of an individual and that of a community but for an individual to claim the rights in terms this section, the individual needs to prove that there is a link between themselves and the specific group. Section 31 of the Constitution is also specifically based on article 27 of the International Covenant on Civil and Political Rights and therefore  the constitutional protection afforded to cultural, religious and linguistic communities is aligned with international law.</p>",
      "featured": false,
      "highlighted": false,
      "references": [
        ""
      ],
      "snippet": "",
      "cases": []
    },
    {
      "id": "sec_32__Access_to_Information",
      "title": "Section 32: Access to Information",
      "content": "<b>Section 32 of the Constitution</b> guarantees everyone the right to access to “any information held by the State” as well as “any information held by another person and that is required for the exercise or protection of any rights.”. The State is obliged to enact national legislation to give effect to these constitutional rights and the Promotion of Access to Information Act 2 of 2000 specifically gives effect to these rights.\n<p>The guarantee of this constitutional right is a commitment to break away from the authoritarian state enforced by the apartheid government. Access to information is critical to ensure accountability, transparency and is a powerful defence against corruption.</p>\n",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_32"
      ],
      "snippet": "",
      "cases": []
    },
    {
      "id": "sec_33__Just_Administrative_Action",
      "title": "Section 33: Just Administrative Action",
      "content": "<b>Section 33 of the Constitution</b> guarantees everyone the right to “administrative action that is lawful, reasonable and procedurally fair” and provides individuals with the right to claim relief where their rights have been adversely affected by administrative action. \nAdministrative action involves the exercise of public power by all organs of State. The State is obliged to enact national legislation to give effect to <p><b>section 33 of the Constitution</b> and the Promotion of Administrative Justice Act 3 of 200 specifically gives effect to these rights. Certain public action however does not fall under “administrative action” and is not reviewable in terms of the Promotion of Administrative Justice Act. This for instance includes judicial action by the judiciary, the President when exercising his powers in terms of the Constitution, the legislature when exercising their functions and political decisions by the cabinet.</p>\n<p>The protection of the constitutional right to just administrative action reflects a deep commitment to restrain discretionary power afforded to the executive. The apartheid State was characterised by unlimited power afforded to the State in terms of national legislation. Under South Africa’s new constitutional order such power will now have to comply with the Constitution and has to be lawful, reasonable and procedurally fair.</p>\n",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_33"
      ],
      "snippet": "",
      "cases": []
    },
    {
      "id": "sec_34",
      "title": "Section 34",
      "content": "<b>Section 34 of the Constitution</b> guarantees everyone the right to have a dispute that can be resolved by the application of law decided in a fair public hearing before a court or where appropriate by another independent and impartial tribunal or forum.\r\n<p>This constitutional right provides a strong defence against the abuse of public power and upholds one of the founding values of the Constitution, namely the Rule of Law which essentially embraces equal protection of the law and ensures the powers of the judiciary are not usurped by the Legislature or the Executive.</p>\r\n<p>It is important to emphasise that this constitutional right cannot be interpreted to mean that an individual can approach any court or independent tribunal to resolve a specific dispute as the rules of jurisdiction still apply. However, an individual has the right to approach a competent court or tribunal where appropriate to resolve the dispute and cannot be forced to waive this right. </p>",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_34"
      ],
      "snippet": "",
      "cases": []
    },
    {
      "id": "sec_35",
      "title": "Section 35",
      "content": "The criminal justice system has been extensively revolutionised under South Africa’s new constitutional order and reflects stringent checks and balances to ensure police power is not abused. <b>Section 35 of the Constitution</b> specifically provides for the rights of arrested, detained and accused persons and the range of constitutional rights in this section will only be of application once a person falls into one of these categories. \r\n<p><b>Section 35(1)(a) of the Constitution</b> for instance specifically provides that a person arrested for allegedly committing an offence has the right to remain silent including various other rights such as the right not to be compelled to make any confessions or admissions. A detained person in terms of <b>section 35(2) of the Constitution</b>, including every sentenced person has for instance  the right to be informed promptly of the reason for being detained  and an accused person in terms of <b>section 35(3) of the Constitution</b> has the right to a fair trial which includes various rights  such as the right to be informed of the charge with sufficient detail to answer.</p>\n<p><b>Section 35(5) of the Constitution</b> specifically provides a remedy for breach of constitutional rights and stipulates that evidence obtained in a manner that violates any right in the Bill of Rights must be excluded if the “admission of that evidence would render the trial unfair or otherwise be detrimental to the administration of justice”.</p> \r\n",
      "featured": false,
      "highlighted": false,
      "references": [
        "sec_35"
      ],
      "snippet": "",
      "cases": []
    }
  ]
}