{"id": "\r\nS1N1\r", "contentType": "Case", "href": "http://www.saflii.org/za/cases/ZACC/1996/26.html", "title": "\r\nCertification of the Constitution of the Republic of South Africa, 1996\r\n\r", "dateOfJudgment": 841968000, "courtName": "Constitutional Court", "topics": "Section 1", "justicesConcurring": "President Chaskalson A ,Deputy President  Langa P, Justice Ackermann L, Justice Didcott J, Justice Kriegler J, Justice Madala T, Justice Mahomed I, Justice Mokgoro Y, Justice O’ Reagen K, Justice Sachs A, Justice Golstone RJ", "summary": "The  Constitutional Court judgment was unique in the sense that it required the Constitutional Court to consider whether the constitutional text adopted by the Constitutional Assembly complied with the 34 constitutional principles in schedule four of the Interim Constitution. \r\n\r\nThe first draft of constitutional text was adopted by the Constitutional Assembly on 10 May 1996 and referred to the Constitutional Court in order certify. It is also important to note that in the process, the Constitutional Court heard various submissions on the final constitutional text by political parties and other civil bodies and as elaborated further below the Constitutional Court found that the draft constitutional text did not comply in all aspects with the constitutional principles and referred it back to the Constitutional Assembly.\r\n\r\nThe  Constitutional Court, was tasked with certifying the final constitutional text and the Court had to determine whether the constitutional text complied with the 34 constitutional principles in Schedule 4 of the Interim Constitution. \nThe Constitutional Court’s judgment was divided in eight chapters, ranging from the context of the certification process, the interpretation of the constitutional principles to the application and interpretation of the Bill of Rights and provincial and local Government powers. \n\nThere were certain serious concerns raised by the Constitutional Court in measuring the final text against the constitutional principles. One of the concerns involved the safeguarding and protection of the independence of the Public-Protector and the Auditor-General which did not comply with Constitutional Principle CP XXIX, relating to the independence of the Public Service Commission, the Reserve Bank, an Auditor General and a Public Protector. The Constitutional Court also emphasised that the independence and impartiality of the Public Protector is critical to ensuring an accountable and effective government. As stated above the constitutional text was referred back to the Constitutional Assembly for further amendments. \n", "snippet": NaN, "facts": NaN, "decision": "In the Constitution, section 1 refers to the founding values of the Constitution. These values emphasise that the Republic of South Africa is “one, sovereign, democratic state” which is founded on various core value such as human dignity, non-racialism, supremacy of the Constitution and a multi-party system of democratic governance. It is perhaps critical before briefly summarising the Constitutional Court’s views on these values in the judgment to highlight that these founding values form the foundation of our constitutional order and in terms of the Constitution numerous requirements need to be met to amend these provisions.\r\nTurning to the Constitutional Court judgment, the Court emphasised that it is necessary to identify the basic structures of our new constitutional order and it was the first question the Court was faced with on certifying the final constitutional text against the 34 constitutional principles. The Constitutional Court emphasised that these structures include “a constitutional democracy based on the supremacy of the Constitution protected by an independent judiciary” which aligns with Constitutional principles IV, VII and XV. Furthermore, the Constitutional court emphasised the need for a “representative government embracing multi-party democracy, a common voters’ roll and, in general, proportional representation”. The Constitutional Court found that the new final constitutional test satisfied the  basic structures of our new constitutional order which is now captured in section 1 of the Constitution.\r", "dissent": NaN, "citedCases": ["Coetzee v Government of the Republic of South Africa; Matiso and Others v Commanding Officer, Port Elizabeth Prison and Others 1995 (4) SA 631 (CC)", "Du Plessis and Others v De Klerk and Another 1996(3) SA 850 (CC), 15 May 1996", "Executive Council, Western Cape Legislature and Others v President of the Republic of South Africa and Others, 1995 (4) SA 877 (CC)", "In re: KwaZulu-Natal Amakhosi and Iziphakanyiswa Amendment Bill of 1995, In re: Payment of Salaries  Allowances and Other privileges to the Ingonyama Bill of 1995,  1996 (4) SA 653 (CC)", "Ex Parte Speaker of the National Assembly: In re Dispute Concerning the Constitutionality of Certain Provisions of the National Education Policy Bill 83,1995 1996 (3) SA 289 (CC)", "S v Williams and Others, 1995 (3) SA 632 (CC)", "The Azanian Peoples Organisation (AZAPO) and Others v The President of the Republic of South Africa and Others (CC) 1996 (4) SA 672, 25 July 1996\r\n"]}