{"id": "C9N1", "contentType": "Case", "href": "http://www.saflii.org/za/cases/ZACC/2016/11.html", "title": "Economic Freedom Fighters v Speaker of the National Assembly and Others; Democratic Alliance v Speaker of the National Assembly and Others [2016] ZACC 11; 2016 (5) BCLR 618 (CC); 2016 (3) SA 580 (CC)", "dateOfJudgment": 1459382400, "courtName": "Constitutional Court", "topics": "Chapter 9 Institutions", "justicesConcurring": "Mogoeng CJ, Moseneke DCJ, Bosielo J, Cameron J, Froneman J, Jafta J, Khampepe J, Madlanga J, Mhlantla J, Nkabinde J, and Zondo J. ", "summary": "The case concerned the legal status of the remedial powers that are vested in the Public Protector after the second respondent failed to comply with the remedial action taken against him. His argument lay in the fact that the Public Protector was not a judge and could not be afforded the same power to have binding remedial actions.\n\nThe Court emphasised that the office of the Public Protector was created to strengthen democracy and as such, it is impartial and subject only to the Constitution and the law. The Public Protector derived its powers from the Constitution primarily and the Public Protector Act did not take away nor did it substitute any of the powers vested in the Public Protector by the Constitution. Instead, the Public Protector Act enhanced the powers afforded to the Public Protector under the Constitution. \n\nMaking recommendations that may be disregarded was held by the court to be inconsistent with ss 11 and 182 of the Constitution which govern the Public Protector. The court held that there was a safeguard to the remedial powers of the Public Protector because the remedial actions decided by the Public Protector were open to being challenged in court.\n\nLastly, not all remedial actions would be binding but the context of the case would determine the legal status of the remedial action. \n", "snippet": "The case concerned the legal status of the remedial powers that are vested in the Public Protector after the second respondent failed to comply with the remedial action taken against him. His argument lay in the fact that the Public Protector was not a judge and could not be afforded the same power to have binding remedial actions.", "facts": "The Public Protector (third respondent) in terms of her powers investigated allegations of improper conduct and irregular expenditure regarding the security upgrades done to the private residence of the second respondent. After conducting her investigation, the Public Protector concluded that the second respondent had acted contrary to the Constitution because he had knowingly benefited from the irregular expenditure of State resources. The Public Protector then directed that the second respondent pay back the portion of the undue benefit that had benefitted him and his family. In addition to this, the Public Protector directed that the second respondent would have to reprimand the Ministers that were involved in the project for acting inappropriately.", "decision": "The primary source of the power to take remedial action was the Constitution and the Public Protector Act was a secondary source. \n\nThis remedial power can only be exercised against people that the Public Protector is by law allowed to investigate. \n\nThe Public Protector is empowered to decide on the appropriate remedial action to be taken and how the action must be implemented. \n\nContext, nature, and language would be used to determine whether remedial action is binding or not. \n\n", "dissent": "The main dissenting views in the case were regarding the legal status of the remedial powers that lay with the Public Protector. \r\n\r\nThe second respondent argued that compliance with the Public Protectors remedial action was optional. The remedial action was never intended to be binding on the person being investigated as the Public Protector was not a judicial officer. It was also argued that the Public Protector Act watered down the powers of the Public Protector in particular the remedial powers. \r\n\r\nOn the other hand, it was argued that in the case of the Public Protector handing down an unfavourable remedial action, the person investigated had no option but to comply with the action. A remedial action could not serve as a remedy to an injured party unless it was able to deal with the matter. Therefore, the power to take remedial action would be rendered useless if the person against whom the remedial action is taken could ignore that action.\r", "citedCases": ["Nyathi v Member of the Executive Council for the Department of Health Gauteng and Another [2008] ZACC 8; 2008 (5) SA 94 (CC); 2008 (9) BCLR 865", "My Vote Counts NPC v Speaker of the National Assembly and Others [2015] ZACC 31; 2016 (1) SA 132 (CC); 2015 (12) BCLR 1407 (CC); \nDoctors for Life", "President of the Republic of South Africa and Others v South African Rugby Football Union and Others [1999] ZACC 9; 199 (4) SA 147 (CC); 199 (7) BCLR 725 (CC)", "President of the Republic of South Africa and Another v Hugo [1997] ZACC 4; 1997 (4) SA 1 (CC); 1997 (6) BCLR 708 (CC); \nSouth African Broadcasting Corporation Soc Ltd and Others v Democratic Alliance and Others [2015] ZASCA 156; [2015] 4 All SA 719 (SCA); \nCertification of the Constitution of the Republic of South Africa, 1996 [1996] ZACC 26; 1996 (4) SA 744 (CC); 1996 (10) BCLR 1253 (CC)", "SABC v DA", "Fose v Minister of Safety and Security [1997] ZACC 6; 1997 (7) BCLR 851 (CC)", "Democratic Alliance v South African Broadcasting Corporation Limited and Others [201] ZAWCHC 161; 2015 (1) SA 551 (WCC)", "Pharmaceuticals Manufacturers Association of South Africa and Another", "MEC for Health, Easer Cape and Another v Kirkland Investments (Pty) Ltd [2014] ZACC 6; 2014 (3) SA 481 (CC); 2014 (5) BCLR 547 (CC)", "Democratic Alliance v President of the Republic of South Africa and Others [2012] ZACC 24; 2013 (1) SA 248 (CC); 2012 (12) BCLR 1297 (CC)", "Justice Alliance of South Africa v President of Republic of South Africa and Others", "Helen Suzman Foundation v Judicial Service Commission and Others [2014] ZAWCHC 136; 2015 (20 SA 498 (WCC); [2014] 4 All SA 395 (WCC)", "Mazibuko v Sisulu and Another [2013] ZACC 28; 2013 (11) BCLR 1297 (CC)", "Rail Commuters Action Group v Transnet Ltd t/a Metrorail [2004] ZACC 20; 2005 (2) SA 359 (CC); 2005 (4) BCLR 301 (CC)", ""]}