{"id": "C9N2", "contentType": "Case", "href": "http://www.saflii.org/za/cases/ZACC/2008/13.html", "title": "Public Protector v South African Reserve Bank [2019] ZACC 29; 2019 (9) BCLR 1113 (CC); 2019 (6) SA 253 (CC)", "dateOfJudgment": 1563753600, "courtName": "Constitutional Court", "topics": "Chapter 9 Institutions", "justicesConcurring": "Mogoeng CJ, Basson AJ, Cameron J, Dlodlo AJ, Froneman J, Goliath AJ, Khampepe J, Mhlantla J, Petse AJ and Theron J", "summary": "The applicant investigated an agreement that was entered into by the respondent and Bankorp Limited during the apartheid era.\t\r\n\r\nIn her final report, the applicant directed that the Chairperson of the Parliamentary Portfolio Committee take steps to amend the Constitution to strip the respondents of its primary object of protecting the value of the currency and amend its consulting obligations with the Minister of Finance.The report also recommended that the Special Investigating Unit to approach the President and take steps to recover misused public funds from ABSA Bank Limited who had purchased Bankorp. \r\n\r\nThe main issue in the present case was whether the conduct of the applicant during her investigation warranted the order made that she be personally liable for 15% of the costs of the case. \r\n\r\nThe court decided that the applicant had acted in bad faith and had been grossly negligent in the pursuant of her investigation and as such the order made against her to be personally responsible for the cost of the case was warranted. \r", "snippet": NaN, "facts": "\r\nThe applicant investigated an agreement that was entered into by the respondent and Bankorp Limited during the apartheid era.\t\r\n\r\nIn her final report, the applicant directed that the Chairperson of the Parliamentary Portfolio Committee take steps to amend the Constitution to strip the respondent of its primary object of protecting the value of the currency and amend its consulting obligations with the Minister of Finance.\r\n\r\nThe report also recommended that the Special Investigating Unit approach the President and take steps to recover misused public funds from ABSA Bank Limited who had purchased Bankorp . \r\n\r", "decision": "Holding public officials personally responsible for costs in cases against them is a constitutional mechanism that ensures that they act in good faith and in line with the relevant laws and the Constitution. \r\nThe applicant had acted in bad faith and had exceeded the bounds of her powers and as such, she wasn’t afforded protection under the Public Protector Act. \r\nThe applicant also failed to engage with the respondent and allow them to make representations before publishing her final report. \r\nThat the applicant had misrepresented herself under oath and her behaviour was found to be contradictory further confirming that she acted in bad faith. \r\n \r", "dissent": "The majority judgement written by Khampepe J and Theron J (Basson AJ, Cameron J, Dlodlo AJ, Froneman J, Mhlantla J and Petse AJ concurring) agreed with the High Court that the behaviour of the applicant was in bad faith and fell short of the standards imposed by her office. As a result, the personal costs order made against her was justified. \r\n\r\nThe minority judgement written by Mogoeng CJ (Goliath AJ concurring) decided that the courts exist not as places to crush litigants but to teach them and caution constructively. The minority judgement further held that making the applicant personally responsible for the costs of the case would ruin her financially and career-wise.\r", "citedCases": ["Economic Freedom Fighters v Speaker, National Assembly [2016] ZACC 11; 2016 (3) SA 580 (CC); 2016 (5) BCLR 618 (CC)", "Plastic Converters Association of South Africa on behalf of Members v National Union of Metalworkers of SA [2016] ZALAC 39; [2016] 37 ILJ 2815 (LAC) (Plastic Converters Association of South Africa)", "Absa Bank Limited v Public Protector 2018 JDR 0190 (GP) (High Court judgment)", "Black Sash Trust v Minister of Social Development [2017] ZACC 20; 2017 (9) BCLR 1089 (CC)", "United Democratic Movement v Speaker, National Assembly [2017] ZACC 21; 2017 (5) SA 300 (CC); 2017 (8) BCLR 1061 (CC)", "Mazibuko N.O. v Sisulu N.O. [2013] ZACC 28; 2013 (6) SA 249 (CC); 2013 (11) BCLR 1297 (CC)", "Zondi v MEC for Traditional and Local Government Affairs [2004] ZACC 19; 2005 (3) SA 589 (CC); 2005 (4) BCLR 347 (CC)", "Limpopo Legal Solutions v Vhembe District Municipality [2017] ZACC 30; 2018 (4) BCLR 430 (CC)", "Long v South African Breweries (Pty) Limited [2019] ZACC 7; 2019 JDR 0218 (CC); 2019 (5) BCLR 609 (CC); \nBiowatch Trust v Registrar, Genetic Resources [2009] ZACC 14; 2009 (6) SA 232 (CC); 2009 (10) BCLR 1014 (CC); \nAffordable Medicines Trust v Minister of Health [2005] ZACC 3; 2006 (3) SA 247 (CC); 2005 (6) BCLR 529 (CC)", "Investigating Directorate: Serious Economic Offences v Hyundai Motor Distributors (Pty) Ltd: In Re Hyundai Motor Distributors (Pty) Ltd v Smit N.O. [2000] ZACC 12; 2001 (1) SA 545 (CC); 2000 (10) BCLR 1079 (CC)", "Sanderson v Attorney-General, Eastern Cape [1997] ZACC 18; 1998 (2) SA 38 (CC); 1997 (12) BCLR 1675 (CC); \nMadyibi v Minister of Safety and Security 2008 JDR 0505; \nFerreira v Levin N.O.; Vryenhoek v Powell N.O. [1996] ZACC 27; 1996 (2) SA 621 (CC); 1996 (4) BCLR 441 (CC)", "Stainbank v SA Apartheid Museum at Freedom Park [2011] ZACC 20; 2011 JDR 0706 (CC); 2011 (10) BCLR 1058 (CC)", "Helen Suzman Foundation v President of the Republic of South Africa [2014] ZACC 32; 2015 (2) SA 1 (CC); 2015 (1) BCLR 1 (CC) ", "Florence v Government of the Republic of South Africa [2014] ZACC 22; 2014 (6) SA 456 (CC); 2014 (10) BCLR 1137 (CC); \n National Coalition for Gay and Lesbian Equality and Others v Minister of Home Affairs and Others [1999] ZACC 17; 2000 (2) SA 1 (CC); 2000 (1) BCLR 39 (CC); \nTrencon Construction (Pty) Ltd v Industrial Development Corporation of South Africa Ltd [2015] ZACC 22; 2015 (5) SA 245 (CC); 2015 (10) BCLR 1199 (CC)", " Hotz v University of Cape Town [2017] ZACC 10; 2018 (1) SA 369 (CC); 2017 (7) BCLR 815 (CC) ", "Swartbooi v Brink [2003] ZACC 25; 2006 (1) SA 203 (CC); 2003 (5) BCLR 502 (CC)", " Limpopo Legal Solutions v Vhembe District Municipality [2017] ZACC 14; 2017 (9) BCLR 1216 (CC) (Limpopo Legal Solutions I) ", " Pheko v Ekurhuleni Metropolitan Municipality (No. 2) [2015] ZACC 10; 2015 (5) SA 600 (CC); 2015 (6) BCLR 711 (CC) ", "South African Social Security Agency v Minister of Social Development (Corruption Watch (NPC) RF Amicus Curiae) [2018] ZACC 26; 2018 JDR 1451 (CC); 2018 (10) BCLR 1291 (CC)", "MEC for Health, Eastern Cape v Kirland Investments (Pty) Ltd t/a Eye & Lazer Institute [2014] ZACC 6; 2014 (3) SA 481 (CC); 2014 (5) BCLR 547 (CC) (Kirland)", " Njongi v MEC, Department of Welfare, Eastern Cape [2008] ZACC 4; 2008 (4) SA 237 (CC); 2008 (6) BCLR 571 (CC)", "South African Liquor Traders’ Association v Chairperson, Gauteng Liquor Board [2006] ZACC 7; 2009 (1) SA 565 (CC); 2006 (8) BCLR 901 (CC) (Liquor Traders)", " Mohamed v President of the Republic of South Africa (Society for the Abolition of the Death Penalty in South Africa and Another Intervening) [2001] ZACC 18; 2001 (3) SA 893 (CC); 2001 (7) BCLR 685 (CC)", "Chief Lesapo v North West Agricultural Bank [1999] ZACC 16; 2000 (1) SA 409 (CC); 1999 (12) BCLR 1420 (CC)", "Nyathi v MEC for Department of Health, Gauteng [2008] ZACC 8; 2008 (5) SA 94 (CC); 2008 (9) BCLR 865 (CC)", "MEC for Health, Gauteng v Lushaba [2016] ZACC 16; 2017 (1) SA 106 (CC); 2016 (8) BCLR 1069 (CC)", "Helen Suzman Foundation v Judicial Service Commission [2018] ZACC 8; 2018 (4) SA 1 (CC); 2018 (7) BCLR 763 (CC)", "SS v VV-S [2018] ZACC 5; 2018 JDR 0275 (CC); 2018 (6) BCLR 671 (CC) ; Limpopo Legal Solutions v Eskom Holdings Soc Limited [2017] ZACC 34; 2017 (12) BCLR 1497 (CC) (Eskom)", "Mtuze v Bytes Technology Group South Africa (Pty) Ltd [2013] ZACC 31; 2013 JDR 1998 (CC); 2013 (12) BCLR 1358 (CC)", "Paulsen v Slip Knot Investments 777 (Pty) Limited [2015] ZACC 5; 2015 (3) SA 479 (CC); 2015 (5) BCLR 509 (CC); ", " President of the Republic of South Africa v Quagliani; President of the Republic of South Africa v Van Rooyen; Goodwin v Director-General, Department of Justice and Constitutional Development [2009] ZACC 9; 2009 (2) SA 466 (CC); 2009 (8) BCLR 785 (CC) ", "De Lacy v South African Post Office [2011] ZACC 17; 2011 JDR 0504 (CC); 2011 (9) BCLR 905 (CC)", " Social Development [2016] ZACC 43; 2017 (3) SA 570 (CC); 2017 (3) BCLR 267 (CC)", " Mighty Solutions t/a Orlando Service Station v Engen Petroleum Ltd [2015] ZACC 34; 2016 (1) SA 621 (CC); 2016 (1) BCLR 28 (CC)", " Maphango v Aengus Lifestyle Properties (Pty) Ltd [2012] ZACC 2\n\n"]}