{"id": "C9N3", "contentType": "Case", "href": "http://www.saflii.org/za/cases/ZACC/2020/10.html", "title": "Economic Freedom Fighters v Gordhan and Others; Public Protector and Another v Gordhan and Others [2020] ZACC 10; 2020 (8) BCLR 916 (CC)", "dateOfJudgment": 1590710400, "courtName": "Constitutional Court", "topics": "Chapter 9 Institutions", "justicesConcurring": "Khampepe ADCJ, Jafta J, Madlanga J, Majiedt J, Mathopo AJ, Mhlantla J, Theron J, Tshiqi J and Victor AJ", "summary": "The second applicant conducted an investigation into the respondent regarding violations of the Executive Ethics Code as well as maladministration, improper conduct, and corruption by the South African Revenue Services. The second applicant in her remedial action then directed that the President take note of her findings of maladministration, improper conduct, and corruption against the respondent and take disciplinary action against him.\r\n. \r\nThe respondent then took the report of the applicant for judicial review and applied for an urgent interdict to temporarily suspend the remedial action and prevent the applicant from enforcing it until the review of the report had been concluded. The High Court was satisfied that the respondents’ application met the test for urgency and granted him the urgent interdict sought. \r\n\r\n\r\nThe issue brought before the Constitutional Court was whether the test for urgent interdicts was appropriate for granting interdicts against the second applicant. The first applicant argued that a stricter test for interim interdicts against the second applicant be developed.\r\n \r\nThe court decided that the current test for urgent interdicts provided by the OUTA case where the applicant has to prove:\r\n1.\tThat on the face of it there is a right\r\n2.\tThat there is imminent harm to the right\r\n3.\tBalance of convenience and\r\n4.\tThat the applicant has no other remedy that can help\r\nwas satisfactory. \r\n\r", "snippet": NaN, "facts": "The second applicant investigated the respondent and concluded her investigation by releasing a report into her findings. The report directed that the President take note of the findings made of maladministration, improper conduct, and corruption and take action against the respondent. The respondent then approached the High Court for an urgent interdict to temporarily suspend the remedial action and prevent the applicant from enforcing it. ", "decision": "\r\nThe first applicant’s argument for a stricter test for urgent interdicts against the second applicant was without merit.\r\nThe OUTA test already provided that urgent interdicts are granted only in exceptional circumstances.\r\nThe OUTA test was flexible enough to take into account the constitutional role of the Public Protector and it had enough safeguards to protect these powers and functions when an interim order was being sought. \r\nWhen allowing the interim order, the court also took into account whether or not the interdict would interfere with the powers of the second applicant.\r\nIt was found that the powers of the second applicant would not be hindered by the interdict. \r\n\r", "dissent": NaN, "citedCases": ["National Treasury v Opposition to Urban Tolling Alliance [2012] ZACC 18; 2012 (6) SA 223 (CC); 2012 (11) BCLR 1148 (CC)", "Biowatch Trust v Registrar, Genetic Resources [2009] ZACC 14; 2009 (6) SA 232 (CC); 2009 (10) BCLR 1014 (CC)", "Tiekiedraai Eiendomme (Pty) Limited v Shell South Africa Marketing (Pty) Limited [2019] ZACC 14; 2019 JDR 0719 (CC); 2019 (7) BCLR 850 (CC) ", "Economic Freedom Fighters v Speaker of the National Assembly and Others; Democratic Alliance v Speaker of the National Assembly [2016] ZACC 11; 2016 (5) BCLR 618 (CC); 2016 (3) SA 580 (CC)", "Gcaba v Minister for Safety and Security [2009] ZACC 26; 2010 (1) SA 238 (CC); 2010 (1) BCLR 35 (CC)", "Chirwa v Transnet Limited [2007] ZACC 23; 2008 (4) SA 367 (CC); 2008 (3) BCLR 251 (CC) ", "General Council of the Bar of South Africa v Jiba [2019] ZACC 23; 2019 JDR 1194 (CC); 2019 (8) BCLR 919 (CC) ", "Mankayi v AngloGold Ashanti Ltd [2011] ZACC 3; 2011 (3) SA 237 (CC); 2011 (5) BCLR 453 (CC)", "Minister of Safety and Security v Luiters [2006] ZACC 21; 2007 (2) SA 106 (CC); 2007 (3) BCLR 287 (CC)", "Phoebus Apollo Aviation CC v Minister of Safety and Security [2002] ZACC 26; 2003 (2) SA 34 (CC); 2003 (1) BCLR 14 (CC) at para 9; and S v Boesak [2000] ZACC 25; 2001 (1) SA 912 (CC); 2001 (1) BCLR 36 (CC)", "Loureiro v Imvula Quality Protection (Pty) Ltd [2014] ZACC 4; 2014 (3) SA 394 (CC); 2014 (5) BCLR 511 (CC) ", "Magajane v Chairperson, North West Gambling Board [2006] ZACC 8; 2006 (5) SA 250 (CC); 2006 (10) BCLR 1133 (CC)", " Phillips v National Director of Public Prosecutions [2005] ZACC 15; 2006 (1) SA 505 (CC); 2006 (2) BCLR 274 (CC)", "S v Pennington [1997] ZACC 10; 1997 (4) SA 1076; 1997 (10) BCLR 1413", "Radio Pretoria v Chairperson, Independent Communications Authority of South Africa [2004] ZACC 24; 2005 (4) SA 319 (CC); 2005 (3) BCLR 231 (CC)", "African Christian Democratic Party v Electoral Commission [2006] ZACC 1; 2006 (3) SA 305 (CC); 2006 (5) BCLR 579 (CC)", "South Cape Corporation (Pty) Ltd v Engineering Management Services (Pty) Ltd 1977(3) SA 534 (A) (South Cape Corporation)", "lnternational Trade Administration Commission v SCAW South Africa (Pty) Ltd [2010] ZACC 6; 2012 (4) SA 618 (CC); 2010 (5) BCLR 457 (CC).", "Machele v Mailula [2009] ZACC 7; 2010 (2) SA 257 (CC); 2009 (8) BCLR 767 (CC)", "United Democratic Movement v Speaker of the National Assembly [2017] ZACC 21; 2017 (5) SA 300 (CC); 2017 (8) BCLR 1061 (CC).", "Public Protector v South African Reserve Bank [2019] ZACC 29; 2019 (6) SA 253 (CC); 2019 (9) BCLR 1113 (CC)", "Florence v Government of the Republic of South Africa [2014] ZACC 22; 2014 (6) SA 456 (CC); 2014 (10) BCLR 1137 (CC)", "Trencon Construction (Pty) Limited v Industrial Development Corporation of South Africa Limited [2015] ZACC 22; 2015 (5) SA 245 (CC); 2015 (10) BCLR 1199 (CC) ", "National Coalition for Gay and Lesbian Equality v Minister of Home Affairs [1999]  ZACC 17[1999] ZACC 17; ; 2000 (2) SA 1 (CC); 2000 (1) BCLR 39 (CC)", "Black Sash Trust v Minister of Social Development (Freedom Under Law intervening) [2017] ZACC 20; 2017 (9) BCLR 1089 (CC) (Black Sash)", "Swartbooi v Brink [2003] ZACC 25; 2006 (1) SA 203 (CC); 2003 (5) BCLR 502 (CC)", "South African Social Security Agency v Minister of Social Development (Corruption Watch (NPC) RF Amicus Curiae) [2018] ZACC 26; 2018 JDR 1451 (CC); 2018 (10) BCLR 1291 (CC)", "President of the Republic of South Africa v South African Rugby Football Union [1999] ZACC 11; 2000 (1) SA 1(CC)[1999] ZACC 11; ; 1999 (10) BCLR 1059 (CC)", "Head of Department: Mpumalanga Department of Education v Hoërskool Ermelo [2009] ZACC 32; 2010 (2) SA 415 (CC); 2010 (3) BCLR 177 (CC)\r\n"]}