{"id": "S10N2", "contentType": "Case", "href": "\r\nhttp://www.saflii.org/za/cases/ZACC/2011/11.html\r\r", "title": "The Citizen 1978 (Pty) Ltd and Others v McBride", "dateOfJudgment": 1302220800, "courtName": "Constitutional Court", "topics": "Section 10", "justicesConcurring": "Ngcobo CJ, Brand AJ,Cameron J,Froneman J, Nkabinde J, Yacoob J, Khampepe J, Mogoeng J.", "summary": "The respondent worked as an operative of the armed wing of the political party, the African National Congress (Umkhonto we Sizwe) and he carried out a car bomb attack outside a Restaurant on the Durban beachfront in 1986, that killed three young women and injured 69 other people. The respondent was found guilty of murder and was sentenced to death. In 1997 he however applied for amnesty under the Promotion of National Unity and Reconciliation Act 34 of 1995 and was granted it in 2001. In 2003 the respondent was a candidate to head the Ekurhuleni metro police. The appellant in September and October 2003 published various articles and editorials questioning the respondent’s candidacy and expressed the view that he was a “criminal” and “murdered”. Some of the articles failed to mention that the respondent was granted amnesty by the National Truth and Reconciliation Commission and the respondent sued the appellant and other journalists for defamation in the Witwatersrand Local Division (South Gauteng High Court), arguing that the articles were malicious as he was granted amnesty. The respondent was successful in the High Court with the defamation claim and the appellants then appealed to the Supreme Court of Appeal. The Supreme Court of Appeal only partially upheld the appeal and reduced the amount of damages awarded to the respondent. The appellants then appealed to the constitutional Court against the Supreme Court of Appeal judgment and the respondent cross-appealed the reduction in damages awarded by the Supreme Court of Appeal.\n\nThe key issue the Constitutional Court had to determine was how amnesty granted to the respondent for crimes committed (during the struggle against apartheid) by the National Truth and Reconciliation Commission affected a claim for defamation. The respondent was granted amnesty in terms of the Promotion of National Unity and Reconciliation Act 34 of 1995 for crimes committed in 1986. In 2003 the appellants in various commentary covering the candidacy of the respondent for the position of head of the Erkhuleni Metro police referred to the respondent as a “murderer” and “criminal”. Justice Cameron writing for the majority geld that the Promotion of National Unity and Reconciliation Act 34 of 1995 did not make the fact that the respondent committed murder untrue and the Act did not prohibit frank public discussion. Justice Cameron emphasised that the requirement that a comment must be ”fair”  protects criticism even if it is extreme so long it is without malice, on a matter of public interest and  on facts that are true. The Constitutional Court therefore upheld the appellant’s main appeal and dismissed the respondent’s cross appeal but the Court did find that the appellant had defamed the respondent by claiming falsely that he was not contrite and awarded the respondent damages on this aspect.", "snippet": NaN, "facts": NaN, "decision": "As the matter essentially concerned a defamation claim and the defences raised thereto a key issue the Constitutional Court had to decide was, how to find a balance between two constitutional rights, namely the appellant’s right to freedom of expression on the one hand and the respondent’s right to human dignity. Justice Cameron writing for the majority, emphasised that the right to human dignity is not only given separate constitutional recognition in s 10 of the Constitution but is also one of the founding values of the society terms of s 1. Therefore, a failure to uphold the right is not only a violation of s10 but is also a threat to a founding value underpinning the legitimacy of the State. However importantly Cameron J, pointed out that freedom of expression is just as important as human dignity and one cannot say that human dignity trumps freedom of expression. The law of defamation importantly must be interpreted to give effect to the appropriate balance between the right to freedom of expression on the one hand and a person’s human dignity on the other hand. Cameron J held on this interpretation that the requirement that a comment must be “fair” in defence to a claim for defamation gives effect to the balance between the right to freedom of expression and dignity.", "dissent": "Partial dissenting judgments were written by Ngcobo J and Mogoeng J. Justice Ngcobo agreed with the majority judgment that the Promotion of National Unity and Reconciliation Act 34 of 1995 did not make the facts of the commission of the murders untrue but Ngcobo J held that the balancing of the right to freedom and the right to dignity  required the facts upon which the appellant relied in their comment to include the fact that the respondent was granted amnesty by the National Truth and Reconciliation Commission. However, on reading the coverage of the respondent’s candidacy collectively Ngcobo J found that this fact was adequately stated. Justice Ngcobo however held that since the appellant failed to make reference to the circumstances under which the appellant was released from detention in Mozambique the statement of the appellant concerning gun-running allegations in Mozambique was based on “half-truths” and therefore was untrue, justifying the respondent’s cross appeal. Justice Mogoeng in his judgment specifically held that the defamatory statements that the respondent was a “criminal” and “murder “must be determined within the context of the objective of the amnesty process and that the truth told during the amnesty process was not meant to be used in a manner that defeats the purpose of national reconciliation. Justice Mogoeng held that the defamatory statements that the respondent was a “murderer” and “criminal” was malicious and was contrary to the pursuit of national reconciliation. ", "citedCases": ["Albutt v Centre for the Study of Violence and Reconciliation and Others 2010 (3) SA 293 (CC)", "Azanian Peoples Organisation (AZAPO) and Others v President of the Republic of South Africa and Others 1996 (4) SA 671 (CC)", "Bhe and Others v Magistrate, Khayelitsha, and Others (Commission for Gender Equality, as amicus curiae); Shibi v Sithole and Others; South African Human Rights Commission and Another v President of the Republic of South Africa and Another 2005 (1) SA 580 (CC)", "Brümmer v Minister for Social Development and Others 2009 (6) SA 323 (CC)", "Dawood and Another v Minister of Home Affairs and Others; Shalabi and Another v Minister of Home Affairs and Others; Thomas and Another v Minister of Affairs and Others 2000 (8) BCLR 837 (CC)", "Dikoko v Mokhatla 2007 (1) BCLR 1 (CC)", "Doctors for Life International v Speaker of the National Assembly and Others 2006 (6) SA 416 (CC)", "Du Toit v Minister for Safety and Security and Another 2009 (12) BCLR 1171 (CC)", "Government of the Republic of South Africa and Others v Grootboom and Others 2001 (1) SA 46 (CC)", "Islamic Unity Convention v Independent Broadcasting Authority and Others  2002 (4) SA 294 (CC)", "Khumalo and Others v Holomisa 2002 (5) SA 401 (CC)", "Le Roux and Others v Dey [2011] ZACC 4", "Minister for Justice and Constitutional Development v Chonco and Others 2010 (4) SA 82 (CC)", "National Coalition for Gay and Lesbian Equality and Another v Minister of Justice and Others 1998 (12) BCLR 1517 (CC)", "President of the Republic of South Africa and Another v Hugo 1997 (6) BCLR 708 (CC)", "S v Mamabolo (E TV and Others, intervening) 2001 (5) BCLR 449 (CC)", "Shalabi and Another v Minister of Home Affairs and Others; Thomas and Another v Minister of Home Affairs and Others [2000] ZACC 8; 2000 (3) SA 936 (CC)", "South African Broadcasting Corp Ltd v National Director of Public Prosecutions and Others 2007 (1) SA 523 (CC)\n "]}