{"id": "S11N1", "contentType": "Case", "href": "http://www.saflii.org/za/cases/ZACC/1995/3.html", "title": "S v Makwanyane and Another", "dateOfJudgment": 802396800, "courtName": "Constitutional Court", "topics": "Section 11", "justicesConcurring": "Chaskalson P, Ackermann J, Didcott J, Kentridge AJ, Langa J, Madala J, Mahomed J, Mokgoro J, O’Regan J, Sachs J", "summary": "The matter was referred to the Constitutional Court by the Appelate  division of the Supreme Court, and the Constitutional Court essentially had to determine whether the death sentence  in terms of s 277(1)(a) of the Criminal Procedure Act 51 of 1977 was consistent with ss 9 and 11 (2) of the Interim Constitution, concerning the right to life and the prohibition againt ”cruel, inhuman or degrading punishment”. It is important to note that the trial was concluded before the Interim Constitution (also known as the Constitution of the Republic of South Africa,1993)  came into operation and therefore the constitutionality of the death sentence was not considered  at the trial itself.\n\nChaskalson J,writing for the majority  essentially found that such an extreme form of punishment putting an end to the right to life itself and infringing on  various other constitutional rights, especially the right not to be subjected to cruel, inhuman or degrading punishment, could not be justified as  reasonable in terms of the limitation test in s33 of the Interim Constitution. The Constitutional Court declared  the death penalty unconstitutional.\n\r\nThe Constitutional Court was principally concerned with the question whether the death penalty in terms of s 277(1)(a) of the Criminal Procedure Act 51 of 1977 was in conflict with various provisions of the then Interim Constitution such as the right to life, dignity and the prohibition against “cruel, inhuman or degrading punishment”. \r\n\r\nChaskalson P, considered various foreign judgment  and decisions of International Human Rigs  Tribunals  that  emphasised that ”cruel, inhuman and degrading punishment” is in clear contrast to the right of dignity which is also a  founding value of the South African Constitution.\r\n\r\nChaskalson P, applied the limitation of rights test in terms of s 33 of the Interim Constitution,which involves a two-stage test to determine  whether the limitation on a constitutional right is reasonable, necessary and proportional taking into account all competing rights. Chaskalson P, specicially held that one has to ask whether the death penalty is ”cruel, inhumanor degrading” and whether it can be justified in terms of  s 33 of the Interim Constitution.\r\n", "snippet": NaN, "facts": NaN, "decision": "\r\nIt is important to note that the constitutionality of the death sentence triggered an analysis of various constitutional rights besides the right to life, which at the times was provided for in s 9 of the Interim Constitution. The right not to be subject to “cruel, inhuman and degrading punishment” and the right to dignity were also critical in the analysis. The majority judgment written by Chaskalson P, in fact focused more on the justification of the death sentence in relation to the right not to be subject on “cruel, inhuman and degrading punishment” in light of alternative severe sentences such as life imprisonment. It is however  important to note that Chaskalson P held that although the right to life is stated in unqualified terms, the right itself must accommodate the right to kill in lawful self-defence of one’s own life or the lives of others. \r\n\r\nThe concurring judgment of O’Reagen dealt more with the right to life and O’ Reagen J  explicitly held that the death sentence was also a breach of the right to life and dignity. O’Reagen J,  held that the meaning of the right to life must be considered in light of its purpose for which it was included in the Constitution. O’Reagen J emphasised that the right to life is interlinked with the right to dignity and was included in the Constitution not only to preserve the right to existence but includes the right to experience humanity and is central to a society where every individual is recognised and valued.\r", "dissent": "All the justices of the Constitutional Court concurred with the main  judgment by Chaskalson P. It is however important that critical additional points were made by several justices in their separate judgments. \r\n\r\nJustice Sachs, pointed out although he was in full agreement with the main judgment, he was of the opinion that more weight  should have been placed on the right to life and right to dignity than the prohibition against ”cruel, inhuman or degrading punishment”. \r\n\r\nJustice Kriegler, in his separate judgment held that he also agreed with the reasoning of the main judgment but he was of the opinion that the s 33 limitation of rights’ test  in terms of the Interim Constitution, did not need to extend further than s 9  of the Interim Constitution, concerning the right to life. \r", "citedCases": ["S v Zuma and Two Others CCT/5/94"]}