{"id": "S1N2", "contentType": "Case", "href": "http://www.saflii.org/za/cases/ZACC/2020/11.html", "title": "New Nation Movement NPC and Others v President of the Republic of South Africa and Others", "dateOfJudgment": 1591833600, "courtName": "Constitutional Court", "topics": "Section 1", "justicesConcurring": "Justice Cameron, Justice Froneman, Justice Jafta, Justice Khampepe, Justice Madlanga,  Acting Justice Mathopo, Justice Mhlantla, Justice Theron, Acting Justice Victor", "summary": "The four applicants, except for the second applicant, all involved Non-Governmental organisations or associations. The second applicant, a natural person described herself as a representative of Khoi and San communities and a princess of the Korona Royal Household of the Khoi and the San First Nation. It appears that the objectives of the applicants to an extent were similiar and they were essentially averse to joining or forming a political party and believed that the current electoral system infinged on their constitutional rights.The applicants  applied to the Western Cape High Court on an urgent basis to declare the Electoral Act 73 of 1998 unconstitutional to the extent that an individual could not contest tha national and provincial elections. The matter was heard on an urgent basis as the national elections were to be held in a few weeks. \r\n\r\nThe Western Cape High Court dismissed the matter on 17 April 2019 and the aApplicants then urgently applied for direct leave to appeal the Western Cape High Court judgment to the Constitutional Court on 19 April 2019. In light of the pending elections, the  Constitutional Court only heard arguments on the question of the urgency of the matter on 2 May 2019.  The Constitutional Court held that the Applicants did not make out a case for urgency and postponed the matter to be argued on 15 August 2019\r\n\r\n\r\n\r\n\r\n\n\r\nThe New Nation Movement judgment declared the Electoral Act of 1998 unconstitutional, to the extent that individuals can only be elected to the National Assembly and Provincial Legislature through membership of their political parties. It is, however, important to note that the Constitutional Court did not consider what electoral system would be more appropriate, as this falls within the mandate of Parliament, and hence the Order was suspended for two years in order for Parliament to remedy the defect.  \r\n \r\nThe constitutional challenge in the judgment was essentially distilled to two critical aspects. Firstly, the meaning of s 19(3)(b) of the Constitution, which states that “Every adult citizen has the right (b) to stand for public office and if, elected, to hold office” had to be determined. Secondly, the Court had to determine whether s 57A of the Electoral Act, read with schedule 1A of the Act (which, in effect, required a citizen to be a member of a political party to contest national and provincial elections) unjustifiably limited an individual’s right to freedom of association, provided for in s 18 of the Constitution. The question was approached holistically by Madlanga J who held that that s 19(3)(b) of the Constitution must be read not only in conjunction with the right to freedom of association but also with other political rights in s 19 of the Constitution.  Madlanga J held that the choice to form a political party in terms of s 19(1) equally includes the right not to join a political party. If s 19(3)(b) is read that only by joining a political party an individual can exercise the right to stand for public office, then it is in conflict with s 19(1), which equally protects the choice not to join a political party. \r\n\r\nOn the second aspect concerning the right to freedom of association, Madlanga J held that on consideration of foreign and international law, the right equally includes the right not to be forced to join an association. The question then turned to whether the limitation of the right to freedom of association by the Electoral Act could be justified as a reasonable limitation in terms of s 36 of the Constitution. The majority however found that the respondents were unable to justify on evidence  the limitation and  therefore the Electoral Act was held to be unconstitutional, to the extent that it excluded independent candidates to contest national and provincial elections.\r\n\r\n\r\n\r\n\r\n\r\n\r\n", "snippet": NaN, "facts": NaN, "decision": "Section 1 – the founding  values of the Constitution:\r\n\r\nIn the Constitution, s 1 refers to the founding values of the Constitution. These values emphasise that the Republic of South Africa is “one, sovereign, democratic state” which is founded on various core value such as human dignity, non-racialism, supremacy of the Constitution and a multi-party system of democratic governance. It is  important to note that these  founding values form the premise of our constitutional order and in terms of the Constitution a high threshold is required to amend these provisions\r\n\r\nIn this judgment s 1 (d) of the Constitution was specifically considered as the Western Cape High Court held that the founding values of s 1(d) do not support the applicant’s case. Section 1(d) of the Constitution provides that the founding values of the Republic include: ”Universal adult suffrage, a national common voters roll, regular elections and a multi-party system of democratic government, to ensure accountability, responsiveness and openness”. The applicants argued that s 1(d) of the Constitution cannot be read as requiring an exclusively party based proportional representation system. \r\nThe majority of the Constitutional Court on considering this aspect, held that s 1(d) of the Constitution says nothing about the exclusivity of multi-party representation. A multi-party democracy allows different political groups to organise and participate in an election but this does not mean only political groups can do so. In this regard the majority relied on the Constitutional Court judgment of United Democratic Movement v President of the Republic of South Africa.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r", "dissent": "The dissenting judgment was written by Froneman J, who agreed that leave to appeal should have been grantedn but disagreed with the reasoning and outcome on the merits of the appeal. Essentially Froneman J disagreed with the majority’s interpretation of  ”to stand for public office and, if elected, to hold office”in s 19(3)(b) of the Constitution and held that it was not shown that the Constitution prescribes something other than political parties in its fundamental multi-party system of democratic governance. ", "citedCases": ["August v Electoral Commission 1999 (3) SA 1 (CC)", "Bernstein v Bester N.O  1996 (2) SA 751 (CC)", "Brink v Kitshoff N.O. 1996 (4) SA 197 (CC)", "Dawood v Minister of Home Affairs; Shalabi v Minister of Home Affairs; Thomas v Minister of Home Affairs  2000 (3) SA 936 (CC)", "Democratic Alliance v Speaker, National Assembly; \nDepartment of Land Affairs v Goedgelegen Tropical Fruits  2007 (6) SA 199 (CC)", "Doctors for Life International v Speaker of the National Assembly  2006 (6) SA 416 (CC)", "Electoral Commission v Inkatha Freedom Party [2011] ZACC 16", "Executive Council, Western Cape v Minister for Provincial Affairs and Constitutional Development; Executive Council, KwaZulu-Natal v President of the Republic of South Africa   2000 (1) SA 661 (CC)", "Executive Council, Western Cape Legislature v President of the Republic of South Africa  1995 (4) SA 877 (CC)", "Ex Parte Chairperson of the Constitutional Assembly: In re Certification of the Constitution of the Republic of South Africa, 1996  1996 (4) SA 744 (CC)", "Gauteng Provincial Legislature: In re Dispute concerning the constitutionality of certain provisions of the Gauteng School Education Bill of 1995  1996 (3) SA 165 (CC)", "Johannesburg Metropolitan Municipality v Gauteng Development Tribunal 2010 (6) SA 182 (CC)", "Matatiele Municipality v President of the RSA (No 2)  2007 (6) SA 477 (CC)", "Mazibuko N.O. v Sisulu N.O. 2013 (6) SA 249 (CC)", "Minister of Health v New Clicks South Africa (Pty) Ltd 2006 (2) SA 311 (CC)", "Minister of Justice and Constitutional Development v Prince 2018 (6) SA 393 (CC)", "Moise v Greater Germiston Transitional Local Council 2001 (4) SA 491 (CC)", "My Vote Counts NPC v Minister of Justice and Correctional Services 2018 (5) SA 380 (CC)", "Mvumvu v Minister for Transport  2011 (2) SA 473 (CC)", "New Nation Movement NPC v President of the Republic of South Africa 2019 (9) BCLR 1104 (CC)", "New National Party of South Africa v Government of the Republic of South Africa  1999 (3) SA 191 (CC);\r\nOriani-Ambrosini v Sisulu, Speaker of the National Assembly 2012 (6) SA 588 (CC)", "Prinsloo v Van der Linde 1997 (3) SA 1012 (CC)", "Ramakatsa v Magashule 2013 (2) BCLR 202 (CC);\r\nS v Makwanyane 1995 (3) SA 391 (CC);\r\nS v Rens 1996 (1) SA 1218 (CC);\r\nS v Zuma 1995 (2) SA 642 (CC);\r\nSATAWU v Moloto  2012 (6) SA 249 (CC);\r\nUnited Democratic Movement v President of the Republic of South Africa 2003 (1) SA 495 (CC);\r\nUnited Democratic Movement v Speaker, National Assembly  2017 (5) SA 300 (CC)\r\n"]}