{"id": "S25", "contentType": "Topic", "title": "Section 25: Property Rights", "content": "Section 25 of the Constitution, the property provision in the Bill of Rights has both protecting and reformative provisions and it is important to understand this balance. On the on hand the right protects existing property rights and on the other hand the right aims to correct historical injustices. Section 25(1) to (3) of the Constitution essentially provides protection against arbitrary deprivation of property and stipulates the requirements for expropriation. The protection of property against unconstitutional interreference is also directly reflected in international conventions, which South Africa has to adhere to such as the Universal Declaration of Human Rights. Section 25(4) to (9) of the Constitution can be described as the “reformative provisions” and obliges the State to take action to promote land and other reforms to ensure equitable access to South Africa’s natural resources. \r\nIn December 2019, the Ad Hoc Committee on the Amendment of Section 25 of the Constitution published the Constitution Eighteenth Amendment Bill, which aimed to amend section 25 of the Constitution to provide that where land and any other improvements are expropriated for the purpose of land reform, the amount of compensation may be nil. It is important to note that as the Bill relates to an amendment of a right in the Bill of Rights such an amendment can only pass with a supporting vote of at least two thirds of the members in the National Assembly and a supporting vote of at least six provinces in the National Council of Provinces.\r", "featured": false, "sections": ["25"], "references": ["First National Bank of SA Limited t/a Wesbank v Commissioner for the South African Revenue Services and Another; First National Bank of SA Limited t/a Wesbank v Minister of Finance [2002] ZACC 5; 2002 (4) SA 768; 2002 (7) BCLR 702", "Mkontwana v Nelson Mandela Metropolitan Municipality [2004] ZACC 9; 2005 (1) SA 530 (CC); 2005 (2) BCLR 150 (CC)", "Port Elizabeth Municipality v Various Occupiers [2004] ZACC 7; 2005 (1) SA 217 (CC); 2004 (12) BCLR 1268 (CC) (no summary)\n"], "isBillOfRightsSection": true}