{"id": "S25N2", "contentType": "Case", "href": "http://www.saflii.org/za/cases/ZACC/2004/7.html\r\r", "title": "Port Elizabeth Municipality v Various Occupiers\r\n\r", "dateOfJudgment": 1096588800, "courtName": "Constitutional Court", "topics": "Section 25", "justicesConcurring": "Sachs J (Chaskalson CJ, Langa DCJ, Madala J, Mokgoro J, Moseneke J, Ngcobo J; O’Regan J, Skweyiya J, Van der Westhuizen J and Yacoob J concurring)", "summary": "The Port Elizabeth Municipality required an eviction order against 68 people who erected and occupied 29 shacks on privately owned land within the municipality. In their version, the occupiers had been living on the land for periods ranging from two to eight years and had not applied to the municipality for housing. They indicated that they were willing to leave the property if given reasonable notice and provided suitable alternative land to which they could move. \r\nThey were told they could move to a place referred to as Walmer Township and they rejected the proposal saying the area was crime-ridden and over-crowded and further that they feared they would have no security of occupation there and find themselves liable to further eviction. The municipality argued that if alternative land was made available to them, they would be disrupting the housing programme and forcing the municipality to grant them preferential treatment.\r\n\n\nThe applicant sought for leave to appeal against the decision of the Supreme Court of Appeal to have the eviction order against the respondent restored. The court had to determine whether the decision of the SCA to set aside the eviction order should be overturned. It held that when dealing with constitutionally protected rights, it is important to uphold the values of human dignity, equality and freedom. One of the provisions of the Bill of Rights that has to be interpreted with these values in mind, is section 25, which provides for the right to property. This matter accordingly turns on establishing an appropriate constitutional relationship between section 25 and section 26. The court held that the provisions of section 25 (4) and (5) must be borne in mind whenever section 25 was being construed, this is because they emphasised that under the Constitution, the protection of property as an individual right was not absolute but subject to societal considerations.\n\nThe Prevention of Illegal Eviction from and Unlawful Occupation of Land Act cannot simply be looked at as a legislative mechanism to re-establish common law property rights and it should not be seen as a means of promoting legal compassion in favour of the poor.  \nIn making its decision, the court must consider all relevant circumstances, including the manner in which occupation was effected, its duration and the availability of suitable alternative accommodation or land and as such it held that the application for leave to appeal was denied.\n", "snippet": NaN, "facts": NaN, "decision": "The Court, in a unanimous decision held that considering the period which the occupiers have lived on the land, the fact that eviction is not necessary for the land to be put to productive use and that this is a relatively small group of people who appear to be genuinely homeless and in need, it would not be just and equitable to order the eviction. It found that the state has a duty to satisfy both property and housing rights provided for in sections 25 and 26 of the Constitution. The application for leave to appeal was dismissed with costs.", "dissent": NaN, "citedCases": ["First National Bank of SA Limited t/a Wesbank v Commissioner for the South African Revenue Services and Another; First National Bank of SA Limited t/a Wesbank v Minister of Finance,   [2002] ZACC 5", "Government of the Republic of South Africa and Others v Grootboom and Others [2000] ZACC 19\r\n"]}