{"id": "S29N2", "contentType": "Case", "href": "http://www.saflii.org/za/cases/ZACC/2017/48.html", "title": "AfriForum and Another v University of the Free State", "dateOfJudgment": 1514332800, "courtName": "Constitutional Court", "topics": "Section 29", "justicesConcurring": "Mogoeng CJ (Nkabinde ADCJ, Jafta J, Khampepe J, Madlanga J, Mhlantla J, Mojapelo AJ and Zondo J) Froneman J (Cameron J, Pretorius AJ)", "summary": "The University of the Free State formalised a bilingual (Afrikaans and English) language policy in 2003 after phasing it in since 1993. The effect (although not the intention) of the policy was, amongst other things, separate lecture rooms for white and black students and reported racial tension. \r\n\r\nAfter commissioning a report on the situation within the University under the 2003 policy, the University Council adopted a new policy in 2016 (to be phased in over five years) which made English the primary medium of teaching and learning, with Afrikaans continuing to be used in an expanded tutorial system and selected courses. \n\nSection 29(2) of the Constitution entitles everyone to education in the language of their choice in public institutions where ‘reasonably practicable’, taking into account: (a) equity; (b) practicability; and (c) the need to redress the results of past racially discriminatory laws and practices’.\nThe University of the Free State formalised a bilingual language policy in 2003 after phasing it in since 1993. The effect (although not the intention) of the policy was, amongst other things, separate lecture rooms for white and black students and reported racial tension. \n", "snippet": "This case was about whether the adoption of the language policy that discontinues the use of Afrkiaans as a primary medium of instruction, by the University of the Free State, is constitutionally valid and whether the University's policy is consistent with the Ministerial Language Policy Framework. AfriForum and Solidarity approached the Court as they believe that proper research was not conducted, and that most white and some black Afrikaans-speaking students prefer to be taught in Afrikaans. They see no justification for the language policy-shift. ", "facts": NaN, "decision": "The Court ruled that the fuelling of racial tension was an ‘appropriate justification’ for the limiting the existing access to the right to be taught in one’s mother tongue. \r\nThe Court explained that it may be practically possible or feesable to retain Afrikaans as a major medium of instruction; but – given that the link between racially segregated lectures and racial tensions had not been denied – it was not ‘reasonably practicable’ to maintain the 2003 bilingual policy if that policy endangered race relations and threatened to perpetuate racial discrimination. This was decided, especially so, in light of the state’s responsibility to redress the damage caused by apartheid.\r\nThe Court recognised Afrikaans as a highly developed language of scholarship and science, and a national resource to be treasured. \r\n", "dissent": "Froneman J (Cameron J, Pretorius AJ) dissented, arguing that: (1) the case should not have been dismissed, but argued before the Court in a hearing because it related to ‘unfinished business’ under the constitution, there were prospects of success (the applicants might have been successful) and because it would have been more consistent with the Court’s practice; (2) more evidence, and therefore further hearings at a High Court level, was needed; and (3) the judgment should (hopefully) not undermine the development of other languages aside from English and Afrikaans.", "citedCases": ["Head of Department, Mpumalanga Department of Education v Hoërskool Ermelo 2010 (2) SA 415 (CC); \r\nSouth African Revenue Service v Commission for Conciliation, Mediation and Arbitration 2017 (1) SA 549 (CC);\r\nFerreira v Levin N.O.; Vryenhoek v Powell N.O. 1996 (1) SA 984 (CC);\r\nBiowatch Trust v Registrar Genetic Resources 2009 (6) SA 232 (CC);\r\nAffordable Medicines Trust v Minister of Health 2006 (3) SA 247 (CC);\r\nFedsure Life Assurance Ltd v Greater Johannesburg Transitional Metropolitan Council 1999 (1) SA 374 (CC)", "Cool Ideas 1186 CC v Hubbard 2014 (4) SA 474 (CC);\r\nDengetenge Holdings (Pty) Ltd v Southern Sphere Mining and Development Company Ltd 2014 (5) SA 138 (CC);\r\nDepartment of Land Affairs v Goedgelegen Tropical Fruits (Pty) Ltd 2007 (6) SA 199 (CC); \r\nSalem Party Club v Salem Community [2017] ZACC 46;\r\nDaniels v Scribante 2017 (4) SA 341 (CC);\r\nTrencon Construction (Pty) Limited v Industrial Development Corporation of South Africa Ltd (5) SA 245 (CC);\r\nAllpay Consolidated Investment Holdings (Pty) Ltd v Chief Executive Officer, South African Social Security Agency 2014 (4) SA 179 (CC);\r\nMEC for Education, KwaZulu-Natal v Pillay 2008 (1) SA 474 (CC); \r\nBato Star Fishing (Pty) Ltd v Minister of Environmental Affairs and Tourism  2004 (4) SA 490 (CC);\r\nFraser v Naude 1999 (1) SA 1 (CC);\r\nSnyders N.O. v Louistef (Pty) Ltd 2017 (6) SA 646 (CC); \r\nRadio Pretoria v Chairperson, Independent Communications Authority of South Africa 2005 (4) SA 319 (CC);\r\nDe Reuck v Director of Public Prosecutions, Witwatersrand Local Division 2004 (1) SA 406 (CC);\r\nIslamic Unity Convention v Independent Broadcasting Authority 2002 (4) SA 294 (CC);\r\nNational Education Health and Allied Workers Union v University of Cape Town 2003 (3) SA 1 (CC);\r\nS v Boesak 2001 (1) SA 912 (CC);\r\nBrummer v Gorfil Brothers Investments (Pty) Ltd 2000 (2) SA 837 (CC);\r\nMunicipal Employees Pension Fund v Natal Joint Municipal Pension Fund (Superannuation) [2017] ZACC 43;\r\nS v Barlow 2017 (2) SACR 535 (CC);\r\nDepartment of Home Affairs v Public Servants Association (2017) 38 ILJ 1555 (CC); \r\nCape Town City v Aurecon SA (Pty) Ltd 2017 (4) SA 223 (CC);\r\nAgri SA v Minister for Minerals and Energy 2013 (4) SA 1 (CC);\r\nAlbutt v Centre for the Study of Violence and Reconciliation 2010 (3) SA 293 (CC);\r\nMasetlha v President of the Republic of South Africa 2008 (1) SA 566 (CC);\r\nMashavha v President of the Republic of South Africa 2005 (2) SA 476 (CC);\r\nPresident of the Republic of South Africa v Hugo 1997 (4) SA 1 (CC);\r\nEx parte Chairperson of the Constitutional Assembly: In re Certification of the Constitution of the Republic of South Africa, 1996 1996 (4) SA 744 (CC);\r\nAzanian Peoples Organisation (AZAPO) v President of the Republic of South Africa 1996 (4) SA 671 (CC);\r\nS v Makwanyane 1995 (3) SA 391 (CC);\r\nEx parte Gauteng Provincial Legislature: In re Dispute Concerning the Constitutionality of Certain Provisions of the Gauteng School Education Bill of 1995 1996 (3) SA 165 (CC);\r\nTshwane City v AfriForum 2016 (6) SA 279 (CC);"]}