{"id": "S8N3", "contentType": "Case", "href": "http://www.saflii.org/za/cases/ZACC/2020/12.html\r\r", "title": "\r\n\r\nAB and Another v Pridwin Preparatory School and Others [2020] ZACC 12\r", "dateOfJudgment": 1592352000, "courtName": "Constitutional Court", "topics": "Section 8", "justicesConcurring": "Mogoeng CJ, Cameron J, Froneman J, Jafta J, Khampepe J, Ledwaba AJ, Madlanga J, Mhlantla J, Nicholls AJ and Theron J", "summary": "The applicants were the parents of children that went to the first respondent’s school. The applicants had signed contracts for the two children with the respondent. In these contracts was a clause that allowed the respondent to cancel the contract at any time, for any reason as long as a full term’s written notice was given. \n\nAfter a series of incidents where the applicants behaved inappropriately in front of young children, the respondent terminated the applicants’ contracts with a written full-term notice. The applicants then proceeded to approach the High Court for an interim order whilst they sought to have the termination of their contract with the respondent cancelled.\n\nThe issue was whether the clause in the contract was a Constitutionally valid one as it did not afford the other party to the contract to state their case before the contract was terminated. \nSecondly, whether independent schools had constitutional duties and obligations that limited their exercise of contractual rights.\n\nThe court found that s 8 of the Constitution allowed for the development of the common law to hold independent schools as providing basic education. \n", "snippet": NaN, "facts": NaN, "decision": "\r\nThat the clause was unconstitutional, went against public policy and was unenforceable because there was no fair procedure followed in the case. \r\nIt was found that once an independent school provided basic education then it was required of that school to ensure that the education of the children attending the school were not affected. \r\nThe argument that only the state provides basic education and not independent schools was based on incorrect pre-constitutional common law principles that cannot stand in light of the Constitution. \r\nThe common law was developed under s 8(3)(a) to hold independent schools of providing basic education. \r", "dissent": "\r\nThere were five different judgements that all agreed with the fact that the clause was constitutionally invalid because it went against not only public policy but the Constitution. \r\nIt also impacted the rights of the children in so far as it compromised their basic right to education. \r", "citedCases": ["Governing Body of the Juma Musjid Primary School v Essay NO [2011] ZACC 13; 2011 JDR 0343 (CC); 2011 (8) BCLR 761 (CC)", "Barkhuizen v Napier [2007] ZACC 5; 2007 (5) SA 323 (CC); 2007 (7) BCLR 691 (CC)", "Ruta v Minister of Home Affairs [2018] ZACC 52; 2019 (2) SA 329 (CC); 2019 (3) BCLR 383 (CC)", "National Coalition for Gay and Lesbian Equality v Minister of Home Affairs [1999] ZACC 17; 2000 (2) SA 1 (CC); 2000 (1) BCLR 39 (CC);JT Publishing v Minister of Safety and Security [1996] ZACC 23; 1997 (3) SA 514 (CC); 1996 (12) BCLR 1599 (CC)", "President of the Republic of South Africa v Democratic Alliance [2019] ZACC 35; 2019 JDR 1753 (CC); 2019 (11) BCLR 1403 (CC)", "Sebola v Standard Bank of South Africa Ltd [2012] ZACC 11; 2012 (5) SA 142 (CC); 2012 (8) BCLR 785 (CC); \nIndependent Electoral Commission v Langeberg Municipality [2001] ZACC 23; 2001 (3) SA 925 (CC); 2001 (9) BCLR 883 (CC)", "POPCRU v SACOSWU [2018] ZACC 24; 2019 (1) SA 73 (CC); 2018 (11) BCLR 1411 (CC); \nMankayi v AngloGold Ashanti Ltd [2011] ZACC 3; 2011 (3) SA 237 (CC); 2011 (5) BCLR 453 (CC)", "National Education Health & Allied Workers Union v University of Cape Town [2002] ZACC 27; 2003 (3) SA (1) (CC); 2003 (2) BCLR 154 (CC) at para 25 and S v Boesak [2000] ZACC 25; 2001 (1) SA 912 (CC); 2001 (1) BCLR 36 (CC); \nMEC for Education, Kwazulu-Natal v Pillay [2007] ZACC 21; 2008 (1) SA 474 (CC); 2008 (2) BCLR 99 (CC); \nMinister for Welfare and Population Development v Fitzpatrick [2000] ZACC 6; 2000 (3) SA 422 (CC); 2000 (7) BCLR 713(CC)", "J v National Director of Public Prosecutions [2014] ZACC 1; 2014 (2) SACR 1 (CC); 2014 (7) BCLR 764 (CC); \nS v M [2007] ZACC 18; 2008 (3) SA 232 (CC); 2007 (12) BCLR 1312 (CC); \nDirector of Public Prosecutions, Transvaal v Minister of Justice and Constitutional Development [2009] ZACC 8; 2009 (4) SA 222 (CC); 2009 (7) BCLR 637 (CC); \nC v Department of Health and Social Development, Gauteng [2012] ZACC 1; 2012 (2) SA 208 (CC); 2012 (4) BCLR 329 (CC); \nKwazulu-Natal Joint Liaison Committee v MEC for Education, Kwazulu-Natal [2013] ZACC 10; 2013 (4) SA 262 (CC); 2013 (6) BCLR 615 (CC)", "Head of Department, Mpumalanga Department of Education v Hoërskool Ermelo [2009] ZACC 32; 2010 (2) SA 415 (CC); 2010 (3) BCLR 177 (CC); \nAAA Investments (Pty) Ltd v Micro Finance Regulatory Council [2006] ZACC 9; 2007 (1) SA 343 (CC); 2006 (11) BCLR 1255 (CC); \nResidents of Joe Slovo Community, Western Cape v Thubelisha Homes [2009] ZACC 16; 2010 (3) SA 454 (CC); 2009 (9) BCLR 847 (CC); \nAllPay Consolidated Investment Holdings (Pty) Ltd v Chief Executive Officer, South African Social Security Agency (No 2) [2014] ZACC 12; 2014 (4) SA 179 (CC); 2014 (6) BCLR 641 (CC); \nDu Plessis v De Klerk [1996] ZACC 10; 1996 (3) SA 850 (CC); 1996 (5) BCLR 658 (CC)", "Centre for Child Law v Minister for Justice and Constitutional Development [2009] ZACC 18; 2009 (6) SA 632 (CC); 2009 (11) BCLR 1105 (CC)", "Teddy Bear Clinic for Abused Children v Minister of Justice and Constitutional Development [2013] ZACC 35; 2014 (2) SA 168 (CC); 2013 (12) BCLR 1429 (CC)", "Ex Parte Gauteng Provincial Legislature: In re Dispute Concerning the Constitutionality of the Gauteng School Education Bill of 1995 [1996] ZACC 4, 1996 (3) SA 165 (CC), 1996 (4) BCLR 537", "Gelyke Kanse v Chairperson of the Senate of the University of Stellenbosch [2019] ZACC 38; 2020 (1) SA 368 (CC); 2019 (12) BCLR 1479 (CC); \n"]}